Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: dei:EntityCommonStockSharesOutstanding is required for DocumentType '%(documentType)s' but missing for a non-default-context fact
ru: dei:EntityCommonStockSharesOutstanding требуется для DocumentType '%(documentType)s', но отсутствует для факта не по умолчанию

source: dei:EntityCommonStockSharesOutstanding is required for DocumentType '%(documentType)s' in the default context because there are not multiple classes of common shares
ru: dei:EntityCommonStockSharesOutstanding требуется для DocumentType ' %(documentType)s' в контексте по умолчанию, поскольку не существует нескольких классов простых акций

source: The DTS of must use only one version of the RXD schema
ru: DTS должен использовать только одну версию схемы RXD

source: The DTS must use a standard presentation linkbase from Family RXD in edgartaxonomies.xml.
ru: DTS должен использовать стандартную ссылку презентации из Family RXD в edgartaxonomies.xml.

source: The DTS must use a standard definition linkbase from Family RXD in edgartaxonomies.xml.
ru: DTS должен использовать стандартную ссылку определения (definition) из Family RXD в edgartaxonomies.xml.

source: The DTS must use must use only one version of the COUNTRY schema.
ru: В DTS необходимо использовать только одну версию схемы COUNTRY.

source: The value for dei:DocumentType, %(documentType)s, requires a value for rxd:AmendmentNumber in the Required Context.
ru: Значение для dei:DocumentType, %(documentType)s требует значения для rxd:AmendmentNumber в требуемом контексте.

source: The DTS must use a standard schema from Family RXD in edgartaxonomies.xml.
ru: DTS должна использовать стандартную схему из Family RXD в edgartaxonomies.xml.

source: The dei:CurrentFiscalYearEndDate, %(fyEndDate)s does not match the dei:DocumentReportingPeriod %(reportingPeriod)s
ru: В dei:CurrentFiscalYearEndDate, %(fyEndDate)s не соответствует файлу dei:DocumentReportingPeriod %(reportingPeriod)s

source: The dei:DocumentPeriodEndDate %(reportingPeriod)s has no corresponding rxd:D fact.
ru: В dei:DocumentPeriodEndDate %(reportingPeriod)s не имеет соответствующего факта rxd:D.

source: Extension concept %(concept)s is non-abstract and not a Text Block.
ru: Концепт расширения %(concept)s не является абстрактом и не является текстовым блоком.

source: Extension concept %(concept)s is not allowed in an extension schema.
ru: Концепт расширения %(concept)s не допускается в схеме расширения.

source: The target of the dimension-domain relationship in role %(linkrole)s from %(source)s to %(target)s must be the default member of %(source)s.
ru: Цель отношения dimension-domain в роли %(linkrole)s от %(source)s к %(target)s должна быть элементом по умолчанию %(source)s.

source: The member %(member)s in dimension rxd:PaymentTypeAxis in linkrole %(linkrole)s must be a QName with namespace that begins with "http://xbrl.sec.gov/rxd/".
ru: Член %(member)s в измерении rxd:PaymentTypeAxis в роли связующего звена %(linkrole)s должен быть QName с пространством имен, которое начинается с "http://xbrl.sec.gov/rxd/".

source: The member %(member)s in dimension rxd:CountryAxis in linkrole %(linkrole)s must be a QName with namespace that begins with "http://xbrl.sec.gov/country//".
ru: Член %(member)s в измерении rxd:CountryAxis в ссылке %(linkrole)s должен быть QName с пространством имен, которое начинается с "http://xbrl.sec.gov/country//".

source: The member %(member)s has two dimensions, %(dimension1)s in linkrole %(linkrole1)s and %(dimension2)s in linkrole %(linkrole2)s.
ru: Член %(member)s имеет два размера, %(dimension1)s в ссылке %(linkrole1)s и %(dimension2)s в ссылке %(linkrole2)s.

source: The domain-member relationship in %(linkrole)s from %(source)s to %(target)s is consecutive with domain-member relationship in %(linkrole2)s to %(target2)s.
ru: Отношение domain-member в %(linkrole)s от %(source)s к %(target)s последовательно с отношением domain-member в %(linkrole2)s к %(target2)s.

source: The %(fact)s %(value)s in context %(context)s is not a %(domain)s.
ru: %(fact)s %(value)s в контексте %(context)s не является %(domain)s.

source: The Context %(context)s has dimension %(dimension)s member %(member)s but is missing required fact %(fact)s
ru: Контекст %(context)s имеет размерность %(dimension)s и member %(member)s, но отсутствует необходимый факт %(fact)s

source: Fact rxd:Co value %(value)s in context %(context)s is not in the domain of country:AllCountriesDomain
ru: Факт rxd:Co: значение %(value)s в контексте %(context)s не входит в домен country:AllCountriesDomain

source: The Context %(context)s has a %(fact1)s and is missing required %(fact2NotNil)sfact %(fact2)s
ru: Контекст %(context)s имеет %(fact1)s. Отсутствует требуемый %(fact2NotNil)s факт %(fact2)s

source: Fact %(fact)s in context %(context)s has unit %(unit)s not matching dei:EntityReportingCurrencyISOCode %(currency)s
ru: Факт %(fact)s в контексте %(context)s имеет единицу %(unit)s не соответствующую dei:EntityReportingCurrencyISOCode %(currency)s

source: A value cannot be given for rxd:Cm in context %(context)s because the payment is in the reporting currency %(currency)s.
ru: Значение не может быть указано для rxd:Cm в контексте %(context)s, потому что платеж находится в валюте отчетности %(currency)s.

source: The unit %(unit)s of rxd:A in context %(context)s is not consistent with the value %(currency)s of rxd:Cu.
ru: Единица %(unit)s rxd:A в контексте %(context)s не согласуется со значением %(currency)s rxd:Cu.

source: The Context %(context)s has dimension %(dimension)s but is missing any payment.
ru: Контекст %(context)s включает измерение %(dimension)s, но отсутствует какой-либо платеж.

source: The Context %(context)s has dimension %(dimension)s member %(member)s but is missing any payment.
ru: Контекст %(context)s включает измерение %(dimension)s member %(member)s, но отсутствует какой-либо платеж.

source: The Context %(context)s has payment type %(paymentType)s but is missing a corresponding fact in the required context.
ru: Контекст %(context)s имеет тип платежа %(paymentType)s, но отсутствует соответствующий факт в требуемом контексте.

source: There is a non-nil rxd:A in context %(context)s but missing a dimension rxd:PmtAxis.
ru: Существует non-nil rxd:A в контексте %(context)s, но отсутствует размер rxd:PmtAxis.

source: The rxd:D %(value)s in context %(context)s does not match the context end date %(endDate)s.
ru: В rxd:D %(value)s в контексте %(context)s не соответствует дате окончания контекста %(endDate)s.

source: dei:%(elementName)s is required in the default context
ru: dei:%(elementName)s требуется в контексте по умолчанию

source: FootnoteLink %(footnoteLinkNumber)s has disallowed role %(linkrole)s
fr: FootnoteLink %(footnoteLinkNumber)s a un rôle %(linkrole)s non autorisé
ru: FootnoteLink %(footnoteLinkNumber)s отклонил роль %(linkrole)s

source: FootnoteLink %(footnoteLinkNumber)s has disallowed child element %(elementName)s
fr: FootnoteLink %(footnoteLinkNumber)s a un élément enfant non autorisé : %(elementName)s
ru: FootnoteLink %(footnoteLinkNumber)s отклонил дочерний элемент %(elementName)s

source: FootnoteLink %(footnoteLinkNumber)s loc %(locNumber)s has disallowed role %(role)s
fr: FootnoteLink %(footnoteLinkNumber)s loc %(locNumber)s a un rôle %(role)s non autorisé
ru: FootnoteLink %(footnoteLinkNumber)s loc %(locNumber)s отклонил роль %(role)s

source: FootnoteLink %(footnoteLinkNumber)s loc %(locNumber)s has disallowed href %(locHref)s
fr: FootnoteLink %(footnoteLinkNumber)s loc %(locNumber)s a href %(locHref)s non autorisé
ru: FootnoteLink %(footnoteLinkNumber)s loc %(locNumber)s отклонил href %(locHref)s

source: FootnoteLink %(footnoteLinkNumber)s arc %(arcNumber)s has disallowed arcrole %(arcrole)s
fr: FootnoteLink %(footnoteLinkNumber)s arc %(arcNumber)s a un rôle d'arc non autorisé : arcrole %(arcrole)s
ru: FootnoteLink %(footnoteLinkNumber)s arc %(arcNumber)s отклонил arcrole %(arcrole)s

source: Footnote %(xlinkLabel)s is missing a role
fr: Il manque un rôle au pied de page %(xlinkLabel)s
ru: В сноске %(xlinkLabel)s отсутствует роль

source: Footnote %(xlinkLabel)s has disallowed role %(role)s
fr: Le pied de page %(xlinkLabel)s a un rôle non autorisé : %(role)s
ru: Сноска %(xlinkLabel)s запретила роль %(role)s

source: FootnoteLink %(footnoteLinkNumber)s footnote %(footnoteLabel)s has no linked fact
ru: FootnoteLink %(footnoteLinkNumber)s. Сноска %(footnoteLabel)s не имеет привязанного факта

source: Concept %(concept)s of a standard taxonomy cannot have a documentation label: %(text)s
fr: Le concept %(concept)s d'une taxonomie standard ne peut pas avoir de libellé documentation : %(text)s
ru: Концепт %(concept)s стандартной таксономии не может иметь метку документации (documentation label): %(text)s

source: Same labels for concepts %(concept)s and %(concept2)s for %(lang)s standard role: %(text)s.
fr: Même libellé pour les concepts %(concept)s et %(concept2)s dans la langue %(lang)s pour le rôle standard : %(text)s
ru: Те же метки для концептов %(concept)s и %(concept2)s для %(lang)s стандартной роли: %(text)s.

source: Label for concept %(concept)s role %(role)s length %(length)s must be shorter than 511 characters: %(text)s
fr: Le libellé pour le concept %(concept)s dans le rôle %(role)s de longueur %(length)s doit avoir une taille inférieure à 511 caractères : %(text)s
ru: Метка для концепта %(concept)s роль %(role)s длина %(length)s должна быть короче 511 символов: %(text)s

source: Label for concept %(concept)s role %(role)s lang %(lang)s is not trimmed: %(text)s
fr: Le libellé pour le concept %(concept)s dans le rôle %(role)s de langue %(lang)s n'est pas nettoyé des espaces superflus : "%(text)s"
ru: Метка для концепта %(concept)s роль %(role)s lang %(lang)s не обрезается: %(text)s

source: References for extension concept %(concept)s are not allowed: %(text)s
fr: Les références pour le concept d'extension %(concept)s ne sont pas autorisées : %(text)s
ru: Ссылки для концепты расширения %(concept)s не допускаются: %(text)s

source: References for standard taxonomy concept %(concept)s are not allowed in an extension linkbase: %(text)s
fr: Les références pour le concept standard de taxonomy %(concept)s ne sont pas autorisées dans une base de liens étendue : %(text)s
ru: Ссылки на стандартный концепт таксономии %(concept)s не допускаются в расширенной базе ссылок (extension linkbase): %(text)s

source: Concept %(concept)s missing standard label in local language.
fr: Il manque le libellé standard dans la langue locale pour le concept %(concept)s
ru: В концепте %(concept)s отсутствует стандартная метка на локальном языке.

source: Concept %(concept)s not referred to by presentation relationship.
fr: Le concept %(concept)s n'est pas référenced par une relation de présentation.
ru: Для концепта(ов) %(concept)s нет ссылок посредством презентационного слоя.

source: DTS concept %(concept)s not referred to by presentation relationship.
ru: На концепт DTS %(concept)s не ссылается презентационный слой.

source: Concept %(concept)s has a substitutionGroup of a non-standard concept.
fr: Le concept %(concept)s a un groupe de substitution d'un concept non standard.
ru: Концепт %(concept)s имеет substitutionGroup нестандартного концепта.

source: Tuple %(concept)s has mismatch between content and presentation children: %(missingQname)s.
fr: Le tuple %(concept)s a une non-correspondance entre le contenu et la présentation : %(missingQname)s.
ru: Кортеж %(concept)s имеет несоответствие между содержимым и представлением подчиненных элементов: %(missingQname)s.

source: RoleType %(roleType)s is defined in multiple taxonomies
fr: Le type de role %(roleType)s est défini dans plusieurs taxonomies
ru: RoleType %(roleType)s определен в нескольких таксономиях

source: ArcroleType %(arcroleType)s is defined in multiple taxonomies
fr: L'ArcroleType %(arcroleType)s est défini dans plusieurs taxonomies
ru: ArcroleType %(arcroleType)s определен в нескольких таксономиях

source: References for conflicting standard %(conflictClass)s taxonomies %(namespaceConflicts)s are not allowed in same DTS
ru: Ссылки на конфликтующие стандартные %(conflictClass)s таксономии %(namespaceConflicts)s не допускаются в том же DTS

source: Ineffective arc %(arc)s in link role %(linkrole)s arcrole %(arcrole)s from %(conceptFrom)s to %(conceptTo)s %(ineffectivity)s
fr: L'arc %(arc)s est sans effet dans le rôle %(linkrole)s arcrole %(arcrole)s de %(conceptFrom)s vers %(conceptTo)s
ru: Неэффективная arc %(arc)s в linkrole %(linkrole)s arcrole %(arcrole)s от %(conceptFrom)s в %(conceptTo)s %(ineffectivity)s

source: Preferred label on presentation relationships not allowed
fr: Le libellé préféré sur une relation de présentation n'est pas autorisé
ru: Предпочтительная метка в отношениях представления (presentation) недопустима

source: Concept %(concept)s has duplicate preferred label %(preferredLabel)s in link role %(linkrole)s
fr: Le concept %(concept)s a un libellé préféré %(preferredLabel)s dupliqué dans le rôle %(linkrole)s
ru: Концепт %(concept)s имеет дубликат предпочтительной метки %(preferredLabel)s в роли ссылки %(linkrole)s

source: Duplicate presentation relations from concept %(conceptFrom)s for order %(order)s in base set role %(linkrole)s to concept %(conceptTo)s and to concept %(conceptTo2)s
fr: Relations de présentation dupliquées entre concept %(conceptFrom) pour l'ordre %(order)s dans le rôle d'ensemble de base %(linkrole)s vers le concept %(conceptTo)s et vers le concept %(conceptTo2)s
ru: Дублирующиеся отношения представления из концепты %(conceptFrom)s для порядка %(order)s в базовой заданной роли %(linkrole)s до концепта %(conceptTo)s и концепта %(conceptTo2)s

source: Non-distinguished preferredLabel presentation relations from concept %(conceptFrom)s in base set role %(linkrole)s
ru: Неоднозначные отношения preferredLabel представления из концепта %(conceptFrom)s в базовой заданной роли %(linkrole)s

source: Duplicate calculations relations from concept %(conceptFrom)s for order %(order)s in base set role %(linkrole)s to concept %(conceptTo)s and to concept %(conceptTo2)s
fr: Relations de calcul dupliquées entre concept %(conceptFrom) pour l'ordre %(order)s dans le rôle d'ensemble de base %(linkrole)s vers le concept %(conceptTo)s et vers le concept %(conceptTo2)s
ru: Дублирующиеся отношения вычислений из концепта %(conceptFrom)s для порядка %(order)s в базовой заданной роли %(linkrole)s до концепта %(conceptTo)s и к концепта %(conceptTo2)s

source: Calculation relationships have a directed cycle in base set role %(linkrole)s starting from %(concept)s
fr: La relation de calcul a un cycle orienté dans l'ensemble de base, rôle %(linkrole)s, en démarrant de %(concept)s
ru: Расчетные отношения имеют направленный цикл в базовой заданной роли %(linkrole)s, начиная с %(концепции)s

source: Calculation relationships should have a same set of targets in %(linkrole)s and %(linkrole2)s starting from %(concept)s
ru: Расчетные отношения должны иметь одинаковый набор целей (targets) в %(linkrole)s и %(linkrole2)s, начиная с %(concept)s

source: Calculation linkbase linkrole %(linkrole)s
fr: Linkrole de la base de liens de calcul %(arcrole)s
ru: Роль ссылки вычислений %(linkrole)s

source: Definition relationship from %(conceptFrom)s to %(conceptTo)s in role %(linkrole)s requires domain item target
fr: La relation de type "définition" de %(conceptFrom)s vers %(conceptTo)s dans le rôle %(linkrole)s nécessite une cible de type domaine
ru: Определение отношения от %(conceptFrom)s к %(conceptTo)s в роли %(linkrole)s требует domain item target

source: Dimension-default in from %(conceptFrom)s to %(conceptTo)s in role %(linkrole)s is not allowed
fr: La relation dimension-default de %(conceptFrom)s vers %(conceptTo)s dans le role %(linkrole)s n'est pas autorisée
ru: Значение по умолчанию измерений из %(conceptFrom)s в %(conceptTo)s в роли %(linkrole)s недопустимо

source: Duplicate definitions relations from concept %(conceptFrom)s for order %(order)s in base set role %(linkrole)s to concept %(conceptTo)s and to concept %(conceptTo2)s
fr: Relations de définition dupliquées entre concept %(conceptFrom) pour l'ordre %(order)s dans le rôle d'ensemble de base %(linkrole)s vers le concept %(conceptTo)s et vers le concept %(conceptTo2)s
ru: Дублирующиеся определения отношений из концепта %(conceptFrom)s для порядка %(order)s в базовой заданной роли %(linkrole)s до концепта %(conceptTo)s и к концепта %(conceptTo2)s

source: Disallowed xbrldt:usable='false' attribute on %(arc)s relationship from concept %(conceptFrom)s in base set role %(linkrole)s to concept %(conceptTo)s
fr: Attribut xbrldt:usable='false' non autorisé sur la relation%(arc)s du concept %(conceptFrom)s dans l'ensemble de base rôle %(linkrole)s vers le concept %(conceptTo)s
ru: Недопустимый xbrldt:usable='false' атрибут на %(arc)s отношение из концепта %(conceptFrom)s в базовой заданной роли %(linkrole)s к концепту %(conceptTo)s

source: Concept used in instance %(concept)s does not participate in an effective presentation relationship
ru: Концепт, используемый в примере %(concept)s, не участвует в отношении действующего представления

source: Used calculation relationship from %(conceptFrom)s to %(conceptTo)s does not participate in an effective presentation relationship
fr: La relation de calcul utilisée de %(conceptFrom)s vers %(conceptTo)s ne participe pas à une relation de rpésentation effective
ru: Используемое отношение вычислений от %(conceptFrom)s к %(conceptTo)s не участвует в отношении действующего представления

source: Concept %(concept)s missing %(lang)s preferred labels for role %(preferredLabel)s
fr: Il manque le libellé préféré du concept %(concept)s pour le rôle %(preferredLabel)s
ru: В концепции %(concept)s отсутствуют %(lang)s предпочтительные метки для роли %(preferredLabel)s

source: validate{0}
ru: проверить{0}

source: Concept %(concept)s has duplicated labels for role %(role)s lang %(lang)s.
fr: Le concept %(concept)s a un libellé dupliqué pour le rôle %(role)s langue %(lang)s.
ru: Концепт %(concept)s имеет дублированные метки для роли %(role)s lang %(lang)s.

source: Concept %(concept)s has label for semantical role %(role)s.
ru: Концепт %(concept)s имеет метку для семантической роли %(role)s.

source: Concept %(concept)s has en but no nl label in role %(role)s.
ru: Концепт %(concept)s имеет en, но не nl метку в роли %(role)s.

source: Concept used in facts %(concept)s is missing an %(lang)s standard label.
ru: Концепт, используемый в фактах %(concept)s. Отсутствует стандартная метка %(lang)s.

source: Concept %(concept)s is missing an %(lang)s label for role %(role)s.
fr: Il manque un libellé en langue '%(lang)s' dans le rôle %(role)s pour le concept %(concept)s.
ru: Концепт %(concept)s. Отсутствует метка %(lang)s для роли %(role)s.

source: last monetary item in statement sheet monetary line items parented by nonMonetary concept
ru: последняя денежная единица в отчете денежных позиций, является основной в концепте nonMonetary

source: last monetary item in statement sheet monetary line items with word 'Total' in effective label {0}
ru: последняя денежная единица в отчете о денежных позиций со словом 'Total' в действующей метке {0}

source: last monetary item in statement sheet monetary line items with word 'Total' in concept name {0}
ru: последняя денежная единица в отчете денежных позиций позиции со словом 'Total' в названии концепта {0}

source: last monetary item in statement sheet monetary line items is calc sum of previous line item
ru: последняя денежная единица в отчете денежных позиций - это сумма расчета предыдущей позиции (line item)

source: Financial statement calculation relationship missing from total concept to item concepts, based on required presentation of line items and totals. %(reasonIssueIsWarning)s Presentation link role: %(linkrole)s %(linkroleDefinition)s. Total concept: %(conceptSum)s. Reason presumed total: %(reasonPresumedTotal)s. Summation items missing: %(missingConcepts)s. Expected item concepts: %(itemConcepts)s. Corresponding facts in contexts: %(contextIDs)s
ru: Соотношение вычислений финансовой отчетности отсутствует от концепта итого к концептам-элементам, основываясь на необходимом отображении позиций и итогов. %(ReasonIssueIsWarning)s с Роль ссылки отображения (Presentation): %(linkrole)s с %(LinkroleDefinition)s с. Концепт Итого: %(conceptSum)s с. Предположительный итог: %(reasonPresumedTotal)s с. Элементы суммирования отсутствуют: %(missingConcepts)s с. Ожидаемые концепты элементов: %(itemConcepts)s с. Соответствующие факты в контекстах: %(contextIDs)s

source: Notes calculation relationship missing from total concept to item concepts, based on required presentation of line items and totals. %(reasonIssueIsWarning)s Presentation link role: %(linkrole)s %(linkroleDefinition)s. Total concept: %(conceptSum)s. Reason presumed total: %(reasonPresumedTotal)s. Summation items missing %(missingConcepts)s. Expected item concepts %(itemConcepts)s. Corresponding facts in contexts: %(contextIDs)s
ru: Отношение для расчетов для примечаний отсутствуют от концепта Итого до концептов элементов, основываясь на требуемом отображении позиций и итогов. %(reasonIssueIsWarning)s с Роль отображения: %(linkrole)s с %(linkroleDefinition)s с. Концепт Итого: %(conceptSum)s с. Предположительный итог: %(reasonPresumedTotal)s с. Отсутствующие элементы суммирования %(missingConcepts)s с. Ожидаемые концепты элементов %(itemConcepts)s с. Соответствующие факты в контекстах: %(contextIDs)s

source: Missing items are nil, which doesn't affect validity but may impair analysis of concept semantics from calculation relationships.
ru: Отсутствующие элементы равны нулю (nil), что не влияет на валидацию, но может ухудшить анализ семантики концептов в расчетном слое.

source: Taxonomy schema %(schema)s includes %(include)s, only import is allowed
fr: Le schéma de taxonomie %(schema)s inclut %(include)s, seuls des imports sont autorisés
ru: Схема таксономии %(schema)s включает %(include)s, допускается только импорт

source: Document file name %(filename)s must not exceed 32 characters.
ru: Имя файла документа %(fileName)s не должно превышать 32 символа.

source: Document file name %(filename)s must start with a-z or 0-9, contain upper or lower case letters, ., -, _, and end with .htm.
ru: Имя файла документа %(fileName)s должно начинаться с a-z или 0-9, содержать буквы верхнего или нижнего регистра,., -, _ и заканчиваться на .htm.

source: Document file name %(filename)s must start with a-z or 0-9, contain upper or lower case letters, ., -, _, and end with .xsd or .xml.
ru: Имя файла документа %(fileName)s должно начинаться с a-z или 0-9, содержать буквы верхнего или нижнего регистра,., -, _ и заканчиваться на .xsd или .xml.

source: Taxonomy schema %(schema)s namespace %(targetNamespace)s is a disallowed authority
fr: Dans le schéma de taxonomie %(schema)s, l'espace de nommage %(targetNamespace)s est une autorité non autorisées
ru: Схема таксономии %(schema)s namespace %(targetNamespace)s не разрешено

source: Taxonomy schema %(schema)s namespace %(targetNamespace)s must have format http://{authority}/{versionDate}
fr: Dans le schéma de taxonomie %(schema)s, l'espace de nommage %(targetNamespace)s doit être dans le format http://{authority}/{versionDate}
ru: Схема таксономии %(schema)s пространство имен %(targetNamespace)s должна иметь формат http://{authority}/{versionDate}

source: Warning: Taxonomy schema %(schema)s namespace %(targetNamespace)s has date later than document name date %(docNameDate)s
ru: Предупреждение: Схема таксономии %(schema)s пространство имен %(targetNamespace)s имеет дату позже даты имени документа %(docNameDate)s
