Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: Relationships have a %(cycle)s cycle in arcrole %(arcrole)s link role %(linkrole)s link %(linkname)s, arc %(arcname)s, path %(path)s
fr: Les relations forment un cycle %(cycle)s dans le rôle d'arc %(arcrole)s rôle de lien %(linkrole)s lien %(linkname)s, arc %(arcname)s, chemin %(path)s
ru: Отношения имеют цикл %(cycle)s в arcrole %(arcrole)s роль ссылки %(linkrole)s ссылка %(linkname)s, arc %(arcname)s, путь %(path)s

source: Calculation relationship has zero weight from %(source)s to %(target)s in link role %(linkrole)s
fr: La relation de calcul a une pondération nulle de %(source)s vers %(target)s dans le rôle %(linkrole)s
ru: Отношение вычисления имеет нулевой вес от %(source)s до %(target)s в linkrole %(linkrole)s

source: Calculation relationship has illegal weight %(weight)s from %(source)s, %(sourceBalance)s, to %(target)s, %(targetBalance)s, in link role %(linkrole)s (per 5.1.1.2 Table 6)
fr: La relation de calcul a une pondération %(weight)s non autorisée depuis %(source)s, %(sourceBalance)s, vers %(target)s, %(targetBalance)s, dans le rle %(linkrole)s (selon 5.1.1.2 Table 6)
ru: Отношение вычисления имеет некорреткный вес %(вес)s от %(source)s, %(sourceBalance)s до %(target)s, %(targetBalance)s, в linkrole %(linkrole)s (per 5.1.1.2 Table 6)

source: Calculation relationship has illegal concept from %(source)s%(sourceNumericDecorator)s to %(target)s%(targetNumericDecorator)s in link role %(linkrole)s
fr: La relation de calcul a un concept non autorisé de %(soruce)s%(sourceNumericDecorator)s vers %(target)s%(targetNumericDecorator)s dans le rôle %(linkrole)s
ru: Отношение вычисления имеет некорректный концепт из %(source)s %(sourceNumericDecorator)s в %(target)s %(targetNumericDecorator)s в linkrole %(linkrole)s

source: Presentation relationship from %(source)s to %(target)s in link role %(linkrole)s missing preferredLabel %(preferredLabel)s
fr: La relation de présentation de %(source)s vers %(target)s dans le rôle %(linkrole)s devrait avoir un preferredLabel %(preferredLabel)s
ru: Отношение представления от %(source)s до %(target)s в linkrole %(linkrole)s отсутствует preferredLabel %(preferredLabel)s

source: (Info xbrl.5.2.4.2.1) Presentation relationship from %(source)s to %(target)s in link role %(linkrole)s has empty preferredLabel %(preferredLabel)s
ru: (Info xbrl.5.2.4.2.1) Отношение представления от %(source)s до %(target)s в linkrole %(linkrole)s имеют пустую preferredLabel %(preferredLabel)s

source: Essence-alias relationship from %(source)s to %(target)s in link role %(linkrole)s has different types or periodTypes
fr: La relation Essence-alias de %(source)s vers %(target)s dans le rôle %(linkrole)s a des types ou periodTypes différants
ru: Отношение сущности-алиаса от %(source)s до %(target)s в linkrole %(linkrole)s имеет разные типы или periodTypes

source: Essence-alias relationship from %(source)s to %(target)s in link role %(linkrole)s has different balances
fr: La relation essence-alias de %(source)s vers %(target)s dans le rôle %(linkrole)s a des attributs balance différents
ru: Отношение сущности-алиаса от %(source)s до %(target)s в linkrole %(linkrole)s имеет разные балансы

source: validating instance
fr: validation de l'instance
ru: проверка отчета

source: validating dimensions
ru: проверка измерений

source: validating concepts
fr: validation des concepts
ru: проверка концептов

source: Tuple %(concept)s must be declared globally
ru: Кортеж %(concept)s должен быть объявлен глобально

source: Tuple %(concept)s must not have periodType
ru: Tuple %(concept)s не должен иметь periodType

source: Tuple %(concept)s must not have balance
ru: Кортеж %(concept)s не должен иметь баланс

source: Tuple %(concept)s must not have attribute in this namespace %(attribute)s
ru: Кортеж %(concept)s не должен иметь атрибута в этом пространстве имен %(attribute)s

source: Tuple %(concept)s must not have mixed content
ru: Кортеж %(concept)s не должен иметь смешанный контент

source: Tuple %(concept)s must not have simple content
ru: Кортеж %(concept)s не должен иметь простой контент

source: Tuple %(concept)s element %(tupleElement)s not defined
ru: Кортеж %(concept)s элемент %(tupleElement)s не определен

source: Tuple %(concept)s must not have element %(tupleElement)s not an item or tuple
ru: Кортеж %(concept)s не должен иметь элемент %(tupleElement)s ни элемент (item) или кортеж

source: Item %(concept)s must have a valid periodType
fr: L'item %(concept)s doit avoir un attribut periodType valide
ru: Элемент %(concept)s должен иметь корректный periodType

source: Item %(concept)s must have a valid balance %(balance)s
fr: L'item %(concept)s doit avoir une valeur valide pour l'attribut balance : %(balance)s
ru: Элемент %(concept)s должен иметь корректный баланс %(balance)s

source: Item %(concept)s may not have a balance
fr: L'item %(concept)s ne peut pas avoir d'attribut balance
ru: Элемент %(concept)s может не иметь баланса

source: Item %(concept)s type %(itemType)s invalid
fr: Le type %(itemType)s de l'item %(concept)s non valide
ru: Элемент %(concept)s тип %(itemType)s некорректен

source: Item %(concept)s enumeration type must specify a domain.
ru: Элемент перечисления %(concept)s должен определять домен.

source: Item %(concept)s enumeration type must be a xbrli:item that is neither a hypercube nor dimension.
ru: Элемент перечисления типа %(concept)s должен быть элементом xbrli:item, который не является гиперкубом или измерением.

source: Item %(concept)s enumeration type must specify a linkrole.
ru: Элемент перечисления %(concept)s должен указывать ссылку (linkrole).

source: Hypercube item %(concept)s must be abstract
fr: L'item %(concept)s d'hypercube doit être abstrait
ru: Элемент гиперкуб %(concept)s должен быть абстрактным

source: Dimension item %(concept)s must be abstract
fr: L'élément dimension %(concept)s doit être abstrait
ru: Элемент измерения %(concept)s должен быть абстрактным

source: validating DTS
fr: validation du DTS
ru: проверка DTS

source: Validating instance calculations
fr: validation des calculs de l'instance
ru: Проверка вычислений (calculations)

source: Validating inline document set
ru: Проверка встроенного набора документов (inline document set)

source: Inline XBRL id is not unique in the IXDS: %(id)s, for element(s) %{elements)s
ru: Inline XBRL id не уникален в IXDS: %(id)s, для элемента(ов) %{elements)

source: Inline XBRL fact's footnoteRef not found: %(id)s
ru: Inline XBRL footnoteRef факта не найден: %(id)s

source: Fact %(fact)s is missing a context for contextRef %(context)s
ru: В факте %(fact)s отсутствует контекст для contextRef %(context)s

source: Fact %(fact)s is missing a unit for unitRef %(unit)s
ru: В Факте %(fact)s отсутствует единица для unitRef %(unit)s

source: Inline XBRL footnote id is not unique in the IXDS: %(id)s
ru: Идентификатор сноски Inline XBRL не уникален в IXDS: %(id)s

source: Inline XBRL non-empty footnote %(footnoteID)s is not referenced by any fact
fr: Pied de page inline XBRL %(footnoteID)s non vide n'est référencé par aucun fait
ru: Inline XBRL - непустая сноска %(footnoteID)s не ссылается ни на какой факт

source: Inline XBRL document set must have at least one ix:header element
ru: Набор документов Inline XBRL должен содержать как минимум один элемент заголовка ix:header

source: %(count)s facts have deprecated transformation namespace %(namespace)s
ru: %(count)s фактов имеют недопустимое пространство преобразований имен %(namespace)s

source: Inline XBRL document set must have consistent default namespaces for target %(target)s
ru: Набор документов Inline XBRL должен иметь согласованные пространства имен по умолчанию для целевого %(target)s

source: Inline XBRL document set must have consistent prefixes for target %(target)s: %(prefix1)s, %(prefix2)s
ru: Набор документов Inline XBRL должен иметь согласованные префиксы для целевого %(target)s: %(prefix1)s, %(prefix2)s

source: Inline XBRL fromRef %(ref)s is not a fraction, ix:nonFraction, ix:nonNumeric or ix:tuple.
ru: Inline XBRL fromRef %(ref)s не является fraction, ix:onFraction, ix:nonNumeric или ix:tuple.

source: Inline XBRL fromRef %(ref)s is not a footnote, fraction, ix:nonFraction, ix:nonNumeric or ix:tuple.
ru: Inline XBRL fromRef %(ref)s не является сноской (footnote), fraction, ix:nonFraction, ix:nonNumeric или ix:tuple.

source: Inline XBRL fromRef is not only either footnotes, or ix:fraction, ix:nonFraction, ix:nonNumeric or ix:tuple.
ru: Inline XBRL fromRef - это не только сноски (footnotes), ix:fraction, ix:nonFraction, ix:nonNumeric или ix:ix:tuple.

source: compiling formulae and rendering tables
ru: компиляция формул и таблиц рендеринга

source: compiling formulae
ru: компиляция формул

source: Xlink locator %(xlinkLabel)s missing href in extended link %(linkrole)s
fr: Locator xlink %(xlinkLabel)s doit avoir href dans le lien étendu %(linkrole)s
ru: Локатор Xlink %(xlinkLabel)s отсутствует в href в расширенной ссылке %(linkrole)s

source: Duplicate xlink arcs in extended link %(linkrole)s from %(xlinkLabelFrom)s to %(xlinkLabelTo)s
fr: Arcs xlink dupliqués dans le lien étendu %(linkrole)s de %(xlinkLabelFrom)s vers %(xlinkLabelTo)s
ru: Дубли xlink arcs в расширенной ссылке %(linkrole)s из %(xlinkLabelFrom)s в %(xlinkLabelTo)s

source: Xlink type %(xlinkType)s invalid in extended link %(linkrole)s
fr: Le type xlink %(xlinkType)s n'est pas valide dans le lien étendu %(linkrole)s
ru: Xlink тип %(xlinkType)s недопустим в расширенной ссылке %(linkrole)s

source: Actuate %(xlinkActuate)s invalid in extended link %(linkrole)s
fr: Le xlink:actutate %(xlinkActuate)s est non valide dans le lien étendu %(linkrole)s
ru: Включение %(xlinkActuate)s неверно в расширенной ссылке %(linkrole)s

source: Show %(xlinkShow)s invalid in extended link %(linkrole)s
ru: Показ %(xlinkShow)s недопустимо в расширенной ссылке %(linkrole)s

source: Arc in extended link %(linkrole)s from %(xlinkLabelFrom)s to %(xlinkLabelTo)s attribute '%(attribute)s' has no matching loc or resource label
fr: L'arc dans le lien étendu %(linkrole)s de %(xlinkLabelFrom)s vers %(xlinkLabelTo)s, attribut '%(attribute)s' n'a pas de libellé ou de loc
ru: Arc в расширенной ссылке %(linkrole)s из %(xlinkLabelFrom)s в %(xlinkLabelTo)s атрибут '%(attribute)s' не имеет метки ресурса или loc

source: Footnote arc in extended link %(linkrole)s from %(xlinkLabelFrom)s to %(xlinkLabelTo)s "from" is not a loc
fr: Dans l'arc du pied de page du lien étendu %(linkrole)s de %(xlinkLabelFrom)s vers %(xlinkLabelTo)s : "from" 'est pas une resource "loc"
ru: Сноска в расширенной ссылке %(linkrole)s из %(xlinkLabelFrom)s в %(xlinkLabelTo)s "из" не является loc

source: Footnote arc in extended link %(linkrole)s from %(xlinkLabelFrom)s to %(xlinkLabelTo)s "to" is not a footnote resource
fr: Dans l'arc du pied de page du lien étendu %(linkrole)s de %(xlinkLabelFrom)s vers %(xlinkLabelTo)s : "to" n'est pas une ressource "footnote"
ru: Сноска arc в расширенной ссылке %(linkrole)s из %(xlinkLabelFrom)s в %(xlinkLabelTo)s "to" не является ресурсом сноски

source: Unprohibited labelArc in extended link %(linkrole)s has illegal remote resource loc labeled %(xlinkLabel)s href %(xlinkHref)s
fr: Le labelArc non interdit dans le lien étendu %(linkrole)s a une location de ressource distance, libellé %(xlinkLabel)s href %(xlinkHref)s
ru: Незапрещенный labelArc в расширенной ссылке %(linkrole)s имеет неверный удаленный ресурс loc, помеченный как %(xlinkLabel)s href %(xlinkHref)s

source: Generic label arc in extended link %(linkrole)s to %(xlinkLabel)s must target a generic label
fr: L'arc de libellé générique dans le lien étendu %(linkrole)s vers %(linkLabel)s doit cibler un libellé générique
ru: Общая метка arc в расширенной ссылке %(linkrole)s на %(xlinkLabel)s должна ссылаться на общую метку

source: Generic reference arc in extended link %(linkrole)s to %(xlinkLabel)s must target a generic reference
fr: L'arc de référence générique dans le lien étendu %(linkrole)s vers %(xlinkLabel)s doit cibler une référence générique
ru: Общая ссылочная arc в расширенной ссылке %(linkrole)s на %(xlinkLabel)s должна ссылаться на общую ссылку

source: Fact %(fact)s context %(contextID)s is numeric and must have a unit
fr: Le fait %(fact)s du context %(contextID)s est numérique et doit avoir une unité
ru: Факт %(fact)s контекст %(contextID)s является числовым и должен иметь единицу измерения

source: Fact %(fact)s context %(contextID)s must have a single unit measure which is monetary %(unitID)s
ru: Факт %(fact)s контекст %(contextID)s должен иметь одну монетарную единицу измерения %(unitID)s

source: Fact %(fact)s context %(contextID)s must have a monetary unit measure %(unitID)s
ru: Факт %(fact)s контекст %(contextID)s должен иметь монетарную единицу измерения %(unitID)s

source: Fact %(fact)s context %(contextID)s must have a single xbrli:shares unit %(unitID)s
ru: Факт %(fact)s контекст %(contextID)s должен иметь единицу xbrli: доля единицы %(unitID)s

source: Fact %(fact)s context %(contextID)s must have a xbrli:shares unit %(unitID)s
fr: Le fait %(fact)s du context %(contextID)s doit avoir une unité xbrli:shares %(unitID)s
ru: Факт %(fact)s контекст %(contextID)s должен иметь xbrli:shares единиц %(unitID)s

source: Fact %(fact)s context %(contextID)s precision %(precision)s is invalid
fr: Le fait %(fact)s du context %(contextID)s a une précision %(precision)s non valide
ru: Факт %(fact)s контекст %(contextID)s точность %(precision)s недопустима

source: Fact %(fact)s context %(contextID)s can not have both precision and decimals
fr: Le fait %(fact)s du context %(contextID)s ne peut pas avoir simultanément "decimals" et "precision"
ru: Факт %(fact)s контекст %(contextID)s не может иметь одновременно точность и десятичные знаки

source: Fact %(fact)s context %(contextID)s decimals %(decimals)s is invalid
fr: Le fait %(fact)s du context %(contextID)s, decimals="%(decimal)s" n'est pas valide
ru: Факт %(fact)s контекст %(contextID)s десятичный знак %(decimals)s некорректен

source: Item %(fact)s must have a context
fr: L'item %(fact)s doit avoir un contexte
ru: Элемент %(fact)s должен иметь контекст

source: Fact %(fact)s context %(contextID)s has period type %(periodType)s conflict with context
fr: Le fait %(fact)s du context %(contextID)s a un type de période %(periodType)s en conflit avec le contexte
ru: Факт %(fact)s контекст %(contextID)s имеет тип периода %(periodType)s несоответствующий контексту

source: Fact %(fact)s context %(contextID)s can not be nil and have either precision or decimals
fr: Le fait %(fact)s du contexte %(contextID)s ne peut pas être xsi:nil="true" et avoir "precision" ou "decimals"
ru: Факт %(fact)s контекст %(contextID)s не может быть nil и иметь точность или десятичные знаки

source: Fact %(fact)s context %(contextID)s is a fraction concept and cannot have either precision or decimals
fr: Le fait %(fact)s du context %(contextID)s est un concept de type fraction, et ne peut pas avoir "decimals" ou "precision"
ru: Факт %(fact)s контекст %(contextID)s - fraction концепт не может иметь ни точности, ни десятичных знаков

source: Fact %(fact)s context %(contextID)s is a fraction with invalid numerator %(numerator)s
fr: Le fait %(fact)s du context %(contextID)s est une fraction avec un numérateur %(numerator)s non valide
ru: Факт %(fact)s контекст %(contextID)s - fraction с недопустимым числителем %(numerator)s

source: Fact %(fact)s context %(contextID)s is a fraction with invalid denominator %(denominator)s
ru: Факт %(fact)s контекст %(contextID)s - доля с недопустимым знаменателем %(denominator)s

source: Fact %(fact)s context %(contextID)s may not have child elements %(childElementName)s
fr: Le fait %(fact)s du context %(contextID)s ne peut pas avoir d'élément enfant %(childElementName)s
ru: Факт %(fact)s контекст %(contextID)s может не иметь дочерних элементов %(childElementName)s

source: Fact %(fact)s context %(contextID)s is a numeric concept and must have either precision or decimals
fr: Le fait %(fact)s du context %(contextID)s est un concept numérique et doit avoir soit "precision" soit "decimals"
ru: Факт %(fact)s контекст %(contextID)s является числовым и должен иметь либо точность, либо десятичную дробь

source: Fact %(fact)s context %(contextID)s is a non-numeric concept and must not have precision or decimals
ru: Факт %(fact)s контекст %(contextID)s является нечисловым и не должен иметь точность или десятичные знаки

source: Fact %(fact)s context %(contextID)s enumeration %(value)s is not in the domain of %(concept)s
ru: Факт %(fact)s контекст %(contextID)s перечисление %(value)s не в домене %(concept)s

source: Tuple %(fact)s must not have a context
ru: Крортеж %(fact)s не должен иметь контекста

source: Fact %(fact)s is a tuple and cannot have either precision or decimals
fr: Le fait %(fact)s est un tuple et ne peut pas avoit de "precision" ni "decimals"
ru: Факт %(fact)s является кортежем и не может иметь ни точности, ни десятичного знака

source: Fact %(fact)s is a tuple and must not have attribute in this namespace %(attribute)s
fr: Le fait %(fact)s est un tuple et ne doit pas avoir d'attribut dans l'espace de nommage %(attribute)s
ru: Факт %(fact)s является кортежем и не должен иметь атрибута в этом пространстве имен %(attribute)s

source: Fact %(fact)s must be an item or tuple
fr: Le fait %(fact)s doit être un item ou un tuple
ru: Факт %(fact)s должен быть элементом или кортежем

source: Fact %(fact)s must not have an order (%(order)s) unless in a tuple
ru: Факт %(fact)s не должен иметь порядок (%(order)s), если только он не в кортеже

source: Inline XBRL nil tuple has content
ru: Inline XBRL nil кортеж имеет контент

source: Inline XBRL non-nil tuple requires content: ix:fraction, ix:nonFraction, ix:nonNumeric or ix:tuple
ru: Inline XBRL непустой кортеж требует содержимое: ix:fraction, ix:nonFraction, ix:nonNumeric или ix:tuple

source: Fact %(fact)s is recursively nested in tuple %(tuple)s
ru: Факт %(fact)s рекурсивно вложен в кортеж %(tuple)s

source: Fact %(fact)s missing an order in tuple %(tuple)s
ru: В факте %(fact)s отсутствует порядок в кортеже %(tuple)s

source: Fact %(fact)s has different target, %(factTarget)s, than tuple %(tuple)s, %(tupleTarget)s
ru: Факт %(fact)s имеет другую ссылку, %(factTarget)s, чем кортеж %(tuple)s, %(tupleTarget)s

source: Inline XBRL at order %(order)s has non-matching content %(value)s
ru: Inline XBRL в порядке %(order)s имеет несогласованное содержимое %(value)s

source: Context %(contextID)s must have startDate less than endDate
fr: Le contexte %(contextID)s doit avoir une date de début antérieure à la date de fin
ru: Контекст %(contextID)s должен иметь startDate меньше, чем endDate

source: Context %(contextID)s startDate or endDate: %(error)s
ru: Контекст %(contextID)s startDate или endDate: %(error)s

source: Context %(contextID)s instant date: %(error)s
fr: Contexte %(contextID)s date "instant" : %(error)s
ru: Контекст %(contextID)s с instant датой: %(error)s

source: Unit %(unitID)s illegal measure: %(measure)s
fr: L'unité %(unitID)s a une mesure non autorisée : %(measure)s
ru: Единица %(unitID)s некорректная мера: %(measure)s

source: Unit %(unitID)s numerator measure: %(measure)s also appears as denominator measure
fr: Unité %(unitID)s, la mesure %(measure) apparaît à la fois dans le numérateur et le dénominateur.
ru: Единица %(unitID)s числитель измерения : %(measure)s также отображается как показатель знаменателя

source: Context %(contextID)s %(contextElement)s cannot have xbrli element %(elementName)s
fr: Contexte %(contextID)s %(contextElement)s ne peut pas avoir un élément xbrli:%(elementName)s
ru: Контекст %(contextID)s %(contextElement)s не может иметь элемент xbrli %(elementName)s

source: Context %(contextID)s %(contextElement)s cannot have item or tuple element %(elementName)s
fr: Contexte %(contextID)s %(contextElement)s ne peut pas avoir un élément ou un tuple %(elementName)s
ru: Контекст %(contextID)s %(contextElement)s не может содержать элемент или кортеж %(elementName)s

source: Context %(contextID)s %(contextElement)s cannot be empty
fr: Contexte %(contextID) L'élément %(contextElement)s ne peut pas être vide
ru: Контекст %(contextID)s %(contextElement)s не может быть пустым

source: Calculation inconsistent from %(concept)s in link role %(linkrole)s reported sum %(reportedSum)s computed sum %(computedSum)s context %(contextID)s unit %(unitID)s unreportedContributingItems %(unreportedContributors)s
ru: Вычисление, несовместимое с %(concept)s в роли ссылки %(linkrole)s. Сумма %(reportedSum)s, вычисленная сумма %(compulatedSum)s ,контекст %(contextID)s, единица измерения %(unitID)s unreportedContributingItems %(unreportedContributors)s

source: Essence-Alias inconsistent units from %(essenceConcept)s to %(aliasConcept)s in link role %(linkrole)s context %(contextID)s
fr: Unités non uniformes dans la relation Essence-Alias de %(essenceConcept)s vers %(aliasConcept)s dans le rôle %(linkrole)s, contexte %(contextID)s
ru: Essence-Alias ​​непоследовательные единицы измерения из %(essenceConcept)s к %(aliasConcept)s в linkrole %(linkrole)s контекста %(contextID)s

source: Essence-Alias inconsistent value from %(essenceConcept)s to %(aliasConcept)s in link role %(linkrole)s context %(contextID)s
fr: Valeurs incohérentes dans la relation Essence-Alias de %(essenceConcept)s vers %(aliasConcept)s dans le rôle %(linkrole)s, contexte %(contextID)s
ru: Essence-Alias несогласованное значение от %(essenceConcept)s до %(aliasConcept)s в linkrole %(linkrole)s контекста %(contextID)s

source: Requires-Element %(requiringConcept)s missing required fact for %(requiredConcept)s in link role %(linkrole)s
fr: Dans Requires-Element %(requiringConcept)s, il manque un fait pour %(requiredConcept)s dans le rôle de lien %(linkrole)s
ru: Требуемый элемент %(requireConcept)s. Отсутствует необходимый факт для %(requiredConcept)s в linkrole %(linkrole)s

source: Href %(elementHref)s file not found
fr: Fichier href %(elementHref)s non trouvé
ru: Файл Href %(elementHref)s не найден

source: Href %(elementHref)s not located
fr: href %(elementHref)s non trouvé
ru: Href %(elementHref)s не найден

source: Href %(elementHref)s unsupported scheme: %(scheme)s
fr: href %(elementHref)s protocole non supporté : %(scheme)s
ru: Href %(elementHref)s. Неподдерживаемая схема: %(schema)s

source: Href %(elementHref)s may only have shorthand xpointers
fr: Le href %(elementHref)s ne peut avoir que des xpointers raccourcis
ru: Href %(elementHref)s могут иметь только сокращенные xpointers

source: LinkbaseRef %(linkbaseHref)s does not identify an link:linkbase element
fr: Le linkbaseRef %(linkbaseHref)s n'identifie pas un élément link:linkbase
ru: LinkbaseRef %(linkbaseHref)s не идентифицирует элемент link:linkbase

source: SchemaRef %(schemaRef)s does not identify an xsd:schema element
fr: Le schemaRef %(schemaRef)s n'identifie pas un élément xsd:schema
ru: SchemaRef %(schemaRef)s не идентифицирует элемент xsd:schema

source: %(linkElement)s loc href %(locHref)s must identify a %(acceptableTarget)s
ru: %(linkElement)s loc href %(locHref)s должен идентифицировать %(acceptableTarget)s

source: Instance loc's href %(locHref)s not an element in same instance
fr: Le loc %(locHref)s n'est pas un élément de la même instance
ru: Instance loc href %(locHref)s не является элементом в аналогичном instance

source: Loc's href %(locHref)s does not identify an element in an XBRL document discovered as part of the DTS
fr: Le loc href %(locHref)s n'identifie pas un document XBRL découvert dans le DTS
ru: Loc's href %(locHref)s не идентифицирует элемент в документе XBRL, обнаруженном как часть DTS
