Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: Taxonomy package files (*.zip)
ru: Файлы пакета таксономии (*.zip)

source: PWD Manifest (taxonomyPackage.xml)
ru: Манифест PWD (taxonomyPackage.xml)

source: Archive manifest file name pattern
ru: Шаблон имени файла манифеста архива

source: Provide non-standard archive manifest file name pattern (e.g., *taxonomyPackage.xml). Uses unix file name pattern matching. Multiple manifest files are supported in archive (such as oasis catalogs). (If blank, search for either .taxonomyPackage.xml or catalog.xml).
ru: Нестандартный шаблон имени файла манифеста архива (например, *taxonomyPackage.xml). Использует шаблонам имен файлов unix. В архиве поддерживаются несколько файлов манифеста (например, каталоги oasis). (если пусто, выполните поиск .taxonomyPackage.xml или catalog.xml).

source: Package is not itself a taxonomy package.
ru: Пакет сам по себе не является пакетом таксономии.

source: File does not itself contain a manifest file: {0} If opening an archive file, the manifest file search pattern currently is "", please press "Manifest" to change manifest file name pattern, e.g.,, "*.taxonomyPackage.xml", if needed.
ru: Файл не содержит манифеста: {0} При открытии архива шаблон поиска файла манифеста в настоящий момент "", нажмите "Манифест", чтобы изменить шаблон имени файла манифеста, например, "*.taxonomyPackage.xml", если необходимо.

source: {0} reloaded
ru: {0} перезагружено

source: Package error
ru: Ошибка пакета

source: File or package cannot be reloaded: {0}
ru: Файл или пакет нельзя перезагрузить: {0}

source: Checking for updates to plug-ins
ru: Проверка обновлений плагинов

source: Updates are available for these plug-ins: {0}
ru: Для этих плагинов доступны обновления: {0}

source: No updates found for plug-ins.
ru: Обновлений для плагинов нет.

source: Plug-in Manager
ru: Менеджер подключаемых модулей

source: Find plug-in modules:
ru: Найти подключаемые модули:

source: Select
ru: Выбрать

source: Select python module files from the local plugin directory.
ru: Выберите файлы python из каталога локальных плагинов.

source: Browse
ru: Просмотреть

source: File chooser allows browsing and selecting python module files to add (or reload) plug-ins, from the local file system.
ru: Выбор файла позволяет просматривать и выбирать файлы python для добавления (или перезагрузки) подключаемых модулей из файловой системы.

source: Dialog to enter URL full path to load (or reload) plug-ins, from the web or local file system.
ru: Диалог для ввода полного URL-адреса для загрузки (или перезагрузки) плагинов из интернета или файловой системы.

source: Author
ru: Автор

source: License
ru: Лицензия

source: Class
ru: Класс

source: Modules
ru: Модули

source: author:
ru: автор:

source: classes:
ru: классы:

source: List of classes that this plug-in handles.
ru: Список поддерживаемых плагином классов.

source: Version:
ru: Версия:

source: Version of plug-in module.
ru: Версия подключаемого модуля.

source: URL of plug-in module (local file path or web loaded file).
ru: URL-адрес подключаемого модуля (локальный путь к файлу или веб-адрес).

source: Date of currently loaded module file (with parenthetical node when an update is available).
ru: Дата текущего загруженного файла модуля (с узлом в скобках при наличии обновления).

source: imports:
ru: импорт:

source: Enable/disable plug in.
ru: Включить/отключить подключаемый модуль.

source: Reload/update plug in.
ru: Перезагрузка/обновление плагина.

source: Remove plug in from plug in table (does not erase the plug in's file).
ru: Удалить плагин из таблицы (не удаляет файл плагина).

source: Enable all plug ins.
ru: Включить все подключаемые модули.

source: Disable all plug ins.
ru: Отключить все подключаемые модули.

source: menus of the user interface
ru: меню пользовательского интерфейса

source: and
ru: и

source: model objects of the processor
ru: объекты процессора

source: custom transforms
ru: пользовательские преобразования

source: disclosure system types
ru: типы систем раскрытия информации

source: host system features
ru: функции хост-системы

source: User interface plug-in change
ru: Изменение плагина интерфейса

source: A change in plug-in class methods may have affected {0}. Please restart Arelle to due to these changes. Should Arelle restart itself now (if there are any unsaved changes they would be lost!)?
ru: Изменение в методах класса подключаемого модуля {0}. Пожалуйста, перезапустите Arelle. Если Arelle перезапустится несохраненные изменения будут потеряны! Перезапустить Arelle?

source: Choose plug-in module file
ru: Выберите файл подключаемого модуля

source: Python files
ru: Файлы Python

source: Module is not itself a plug-in or in a directory with package __init__.py plug-in.
ru: Модуль не является плагином или плагином с пакетом __init__.py.

source: File does not itself contain a python program with an appropriate __pluginInfo__ declaration: {0}
ru: Файл не содержит программу python с декларацией __pluginInfo__: {0}

source: Plug-in is imported by a parent plug-in.
ru: Плагин импортируется вместе с основным подключаемым модулем.

source: Plug-in has a parent, please request operation on the parent: {0}
ru: Плагин имеет базовый объект: {0}

source: Module error
ru: Ошибка модуля

source: File or module cannot be reloaded: {0}
ru: Файл или модуль нельзя перезагрузить: {0}

source: RSS Feed Processing Control
ru: Управление обработкой RSS-канала

source: Select an RSS feed to process for item matching, formulas, and validations as selected below
ru: Выберите канал RSS для обработки совпадения элементов, формул и проверок, указанных ниже

source: Enter a regular expression to be matched to the text of each filing instance fact item. Regular expressions may contain patterns to detect, such as ab.?c, for any single character between b and c, or ab.*c for any number of characters between b and c.
fr: Entrer une expression régulière qui doit servir de correspondance avec le texte de chaque fait de l'instance.
ru: Введите регулярное выражение, которое будет совпадать с текстом каждого факта отчета. Регулярные выражения могут содержать шаблоны для поиска, такие как ab.?c (для любого символа между b и c, или ab.*c для любого количества символов между b и c).

source: Select a formula linkbase to to evaluate each filing. The formula linkbase may contain one or more assertions, the results of which is recorded in the log file. If unsuccessful assertion alerts are selected and an e-mail address provided, the recipient will be notified of filings with assertions that do not pass.
ru: Выберите формулу для оценки каждого отчета. Формула может содержать одно или несколько выражений, результаты которых записываются в журнал. Если выбраны неуспешные выражения и указан адрес электронной почты, получатель будет уведомлен о подаче файлов с проверками, которые не прошли.

source: Select a log file in which to save an activity log, including validation results, matched item text, and formula results. If file ends in .xml it is xml-formatted, otherwise it is text.
ru: Выберите файл журнала, в котором необходимо сохранить журнал активности, включая результаты проверки, текст элемента и результаты проверки формул. Если файл заканчивается на .xml, то формат xml, иначе - текст.

source: Specify e-mail recipient(s) for alerts per below.
fr: Indique les e-mails des destinataires pour les alertes ci-dessous
ru: Укажите получателей электронной почты для уведомлений.

source: Enter/edit settings of outgoing e-mail server (SMTP).
ru: Введите/отредактируйте настройки исходящего сервера электронной почты (SMTP).

source: Specify pub dateTime of last processed submission. Next item to examine will be after this dateTime.
ru: Укажите dateTime последней обработанной подачи. Следующий отчет будет после этой даты и времени.

source: Clear pub dateTime so that next cycle processes all entries in RSS feed.
ru: Очистить dateTime, чтобы следующий цикл обрабатывал все записи в RSS-канале.

source: Choose formula file for RSS Watch
ru: Выберите файл formula для RSS

source: Choose log file for RSS Watch
ru: Выберите файл журнала для RSS

source: Log files
fr: Fichiers de log
ru: Файлы журнала

source: RSS feed field contents invalid
ru: Содержимое поля RSS-канала некорректно

source: Match text field contents error {0}
fr: Erreur dans le champ de recherche {0}
ru: Поле проверки совпадения текста содержит ошибку {0}

source: Formula file not found {0}
fr: Fichier de formules {0} non trouvé
ru: Файл Formula не найден {0}

source: Log file directory not found {0}
fr: Fichier de log {0} non trouvé
ru: Каталог файла журнала не найден {0}

source: E-mail address format error
fr: Adresse électronique non valide
ru: Ошибка формата адреса электронной почты

source: Please enter E-mail server settings (SMTP)
ru: Введите настройки сервера электронной почты (SMTP)

source: Latest pub date field contents invalid
ru: Недопустимое содержимое поля последней даты

source: SEC search
ru: Поиск SEC

source: Opens US SEC Edgar Company Search (in web browser) (1) Find the company in web browser, (2) Click 'documents' button for desired filing, (3) Find 'data files' panel, instance document row, 'document' column, (4) On instance document file name, right-click browser menu: 'copy shortcut', (5) Come back to this dialog window, (6) Ctrl-v (paste) shortcut into above URL text box, (7) Click ok button to load instance document
ru: Открыть поиск компании US SEC Edgar (в веб-браузере) (1) Найдите предприятие в веб-браузере, (2) Нажмите кнопку "documents", (3) Найдите панель "data files", строку документа экземпляра, столбец "document", (4) Щелкните правой кнопкой мыши на файле документ в меню браузера и выберите: "copy shortcut", (5) Вернитесь в это диалоговое окно, (6) Ctrl-v (вставить) ссфлку в текстовое поле над URL, (7) Нажмите ok, чтобы загрузить отчет

source: Opens current US SEC Edgar RSS feed
ru: Открывает текущий RSS-канал США SEC Edgar

source: Opens above URL from web cache, downloading to cache if necessary
fr: Ouvre l'URL ci-dessus depuis le cache web, en téléchargent les ressources nécessaires dans le cache
ru: Открывает URL из кэша веб-сайта, и, при необходимости, загружает в кеш

source: Cancel operation
fr: Annuler l'opération
ru: Отмена операции

source: Authentication Request
fr: Demande d'authentification
ru: Запрос аутентификации

source: Outgoing E-mail Server (SMTP)
ru: Сервер исходящей электронной почты (SMTP)

source: XBRL Database Server
ru: Сервер базы данных XBRL

source: After logging on (by web browser, if applicable) click 'retry' to reload web file
ru: После входа в систему (через веб-браузер, если применимо) нажмите "повторить попытку (retry)", чтобы перезагрузить веб-файл

source: Host:
fr: Serveur :
ru: Хост:

source: Realm:
fr: Domaine :
ru: Область:

source: Use proxy server of {0}
fr: Utilisation du serveur mandataire de {0}
ru: Использовать прокси-сервер {0}

source: Check to use {0} Uncheck to specify: No proxy if URL address is left blank, Proxy via URL address if it is not blank, with user and password (if provided)
fr: Cocher pour utiliser {0} Décocher pour préciser: Aucun proxu si l'URL est laissée vide, Proxy indiqué dans l'URL si complété, avec l'authentification utilisateur/mot de passe (si indiqué)
ru: Поставьте галку, чтобы использовать {0} Снимите галку, чтобы указать: Нет прокси-сервера, если URL-адрес оставлен пустым, Прокси через URL-адрес, если адрес не пуст, с пользователем и паролем (если есть)

source: Address:
fr: Adresse :
ru: Адрес:

source: Port:
ru: Порт:

source: Enter URL address and port number e.g., address: 168.1.2.3 port: 8080 or address: proxy.myCompany.com port: 8080 or leave blank to specify no proxy server
fr: Entrer l'adresse sous la forme serveur:port ex: 168.192.1.2:8080 ex: proxy.mycompany.domain:8000 ou laisser vide pour ne pas utiliser de mandataire
ru: Введите URL-адрес и номер порта например, 168.1.2.3:8080 или proxy.myCompany.com:8080 или оставьте пустым, чтобы указать прокси-сервер

source: User:
fr: Utilisateur
ru: Пользователь:

source: Password:
fr: Mot de passe :
ru: Пароль:

source: Database:
ru: База данных:

source: Enter database name (optional) or leave blank
ru: Введите имя базы данных (необязательно) или оставьте пустым

source: Timeout:
ru: Тайм-аут:

source: Enter timeout seconds (optional) or leave blank for default (60 secs.)
ru: Введите время для тайм-аута (необязательно) или оставьте пустым значение (по умолчанию 60 секунд)

source: DB type:
ru: Тип базы данных:

source: Port number invalid
ru: Недопустимый номер порта

source: Timeout seconds invalid
ru: Время тайм-аута некорректно

source: DB type is invalid
ru: Недопустимый тип базы данных

source: parsing disclosuresystems.xml
ru: парсинг disclosuresystems.xml

source: Disclosure System listing, import error: %(error)s
ru: Система Раскрытия, ошибка импорта: %(error)s

source: loading disclosure system and mappings
ru: загрузка Системы раскрытия информации и меппинга

source: unable to load disclosure system {}
ru: не удалось загрузить систему раскрытия {}

source: Disclosure System "%(name)s" not recognized (a plug-in may be needed).
ru: Система раскрытия информации "%(name)s" не распознана (может потребоваться подключаемый модуль).

source: exception during loading
fr: exception lors du chargement
ru: ошибка при загрузке

source: Disclosure System "%(name)s" loading error: %(error)s
ru: Система раскрытия "%(name)s" ошибка загрузки: %(error)s

source: Disclosure system and mappings {0}: {1}
ru: Система раскрытия и меппинги {0}: {1}

source: parsing {0}
fr: analyse {0}
ru: парсинг {0}

source: Disclosure System "%(name)s" import %(importFile)s, error: %(error)s
ru: Система раскрытия информации "%(name)s" загрузка %(importFile)s, ошибка: %(error)s

source: Archive {}
ru: Архив {}

source: Taxonomy package must contain one and only one metadata file: {0}.
ru: Пакет таксономии должен содержать один файл метаданных: {0}.

source: Unable to open file: {0}.
ru: Не удалось открыть файл: {0}.

source: Consistency assertion %(id)s formula %(xlinkLabel)s fact %(derivedFact)s has zero precision and no radius is defined, skipping consistency assertion
fr: Cohérence de Assertion %(id)s : formule %(xlinkLabel)s fait %(derivedFact)s n'a aucune précision et le rayon n'est pas défini, la cohérence de l'assertion est ignorée
ru: Правило %(id)s formula %(xlinkLabel)s fact %(derivedFact)s: нулевая точность и не задан радиус. Правило пропущено

source: Consistency assertion %(id)s formula %(xlinkLabel)s no input facts matched to %(derivedFact)s, skipping consistency assertion
fr: Cohérence de Assertion %(id)s : formule %(xlinkLabel)s aucun fait d'entrée ne correspond à %(derivedFact)s, la cohérence de l'assertion est ignorée
ru: Правило %(id)s formula %(xlinkLabel)s: нет входных данных, сопоставленных с %(derivedFact)s. Правило пропщено

source: Consistency assertion %(id)s formula %(xlinkLabel)s input fact matched to %(derivedFact)s has zero precision and no radius, skipping consistency assertion
fr: Cohérence de Assertion %(id)s : formule %(xlinkLabel)s le fait d'entrée fact correspondand à %(derivedFact)s n'a aucune précision et pas de rayon, la cohérence d'assertion est ignorée
ru: Правило %(id)s formula %(xlinkLabel)s: входной факт, сопоставленный с %(derivedFact)s, имеет нулевую точность и не указан радиус. Правило пропущено

source: Consistency assertion %(id)s result %(result)s
fr: Cohérence de Assertion %(id)s : résultat %(result)s
ru: Правило %(id)s: результат %(result)s

source: Existence Assertion %(xlinkLabel)s Result: %(result)s
fr: Assertion existence %(xlinkLabel)s Résultat: %(result)s
ru: Правило %(xlinkLabel)s Результат: %(result)s

source: unlabeled variableSet
fr: variableSet sans libellé
ru: variableSet без Label

source: Variable set %(xlinkLabel)s had no xpCtx.evaluations
fr: Ensemble de varables : %(xlinkLabel)s n'a pas d'évaluation xpCtx
ru: Набор переменных %(xlinkLabel)s не включает xpCtx.evaluations

source: Variable set %(xlinkLabel)s time for %(count)s evaluations: %(time)s
ru: Набор переменных %(xlinkLabel)s: время %(count)s оценки: %(time)s

source: Variable set %(label)s Exception: %(error)s
ru: Набор переменных %(label)s Исключение: %(error)s

source: Variable set %(xlinkLabel)s evaluations: %(evaluations)s x %(variables)s
ru: Набор переменных %(xlinkLabel)s: %(evaluations)s x %(variables)s

source: Variable set %(xlinkLabel)s skipped evaluation, all fact variables have fallen back
fr: Ensemble de varables : %(xlinkLabel)s a passé l'évaluation, toutes les variables ont pris leur valeur de repli
ru: Набор переменных %(xlinkLabel)s: пропущена оценка, все факты пустые

source: Variable set %(xlinkLabel)s skipped non-different or fallback evaluation, duplicates another evaluation
fr: L'ensemble de variables %(xlinkLabel)s a passé une évaluation non-different ou valeur de repli car elle duplique une autre évaluation
ru: Набор переменных: set %(xlinkLabel)s. пропуск (дублирует другую проверку/evaluation)

source: Variable set %(xlinkLabel)s skipped evaluation %(count)s: %(time)s sec
ru: Набор переменных %(xlinkLabel)s: пропущена проверка %(count)s: %(time)s сек

source: Variable set %(xlinkLabel)s Precondition %(precondition)s Result: %(result)s
fr: Ensemble de variables : %(xlinkLabel)s Pré-condition %(precondition)s Résultat : %(result)s
ru: Набор переменных %(xlinkLabel)s Предусловие %(precondition)s Результат: %(result)s

source: Variable set %(xlinkLabel)s precondition blocked evaluation %(count)s: %(time)s sec
ru: Набор переменных %(xlinkLabel)s: предусловие не выполнено. Оценка не проводилась %(counts)s: %(time)s сек

source: %(variableSetType)s %(xlinkLabel)s{0} Expression: %(expression)s Evaluated: %(evaluatedExpression)s Result: %(result)s
ru: %(VariableSetType)s %(xlinkLabel)s {0} Выражение:%(expression)s Оценка:%(evaluatedExpression)s Результат:%(result)s

source: Variable set %(xlinkLabel)s completed evaluation %(count)s: %(time)s sec
ru: Набор переменных %(xlinkLabel)s: завершена проверка %(count)s: %(time)s сек

source: Variable set chained in scope of variable set %(variableset)s Exception: %(error)s
ru: Набор переменных связан с другими наборами переменных %(variableset)s Исключение: %(error)s

source: Fact Variable %(variable)s: start with %(factCount)s facts previously cached after explicit filters
ru: Переменная-факт %(variable)s: начать с %(factCount)s фактов , ранее кэшированных после фильтров

source: Fact Variable %(variable)s: start with %(factCount)s facts previously cached before variable filters
ru: Переменная-факт %(variable)s: начать с %(factCount)s фактов, ранее кэшированных до фильтров

source: Fact Variable %(variable)s filtering: start with %(factCount)s facts
fr: Application du filtre sur la variable de fait %(variable)s : démarrage avec %(factCount)s faits
ru: Переменная-факт %(variable)s фильтрация: начиная с фактов %(factCount)s

source: Fact Variable %(variable)s: filters result %(result)s
fr: Variable de fait %(variable)s : résultat des filtres %(result)s
ru: Переменная-факт %(variable)s: результат фильтрации %(result)s

source: Fact Variable %(variable)s: fallbackValue result %(result)s
fr: Variable de fait %(variable)s : repli sur la valeur par défaut résulte en %(result)s
ru: Переменная-факт %(variable)s: fallbackValue результат %(result)s

source: General Variable %(variable)s: select result %(result)s
fr: variable générale %(variable)s : résultat sélectionné %(result)s
ru: Общая переменная %(variable)s: выберите результат %(result)s

source: %(variableType)s %(variable)s: bound value %(result)s
fr: %(variableType)s %(variable)s: valeur liée %(result)s
ru: %(VariableType)s %(variable)s: связанное значение %(result)s

source: Fact Variable %(variable)s %(filterType)s %(filter)s filter %(xlinkLabel)s passes %(factCount)s facts
fr: La variable de fait %(variable)s filtrée par %(filterType)s %(filter)s passe avec succès %(factCount)s faits
ru: Переменная-факт %(variable)s %(filterType)s %(filter)s фильтр %(xlinkLabel)s передает %(factCount)s факты

source: Fact Variable %(variable)s implicit filter %(aspect)s passes %(factCount)s facts
ru: Переменная-факт %(variable)s неявный фильтр %(aspect)s передает %(factCount)s факты

source: Formula %(label)s concept: %(concept)s
ru: Формула %(label)s: %(concept)s

source: Formula %(label)s concept %(concept)s is not a %(element)s
ru: Формула %(label)s %(concept)s не является %(element)s

source: Formula %(label)s entity identifier scheme: %(scheme)s
ru: Формула %(label)s: идентификатор схемы объекта (entity): %(scheme)s

source: Formula %(label)s entity identifier value: %(entityIdentifier)s
ru: Значение идентификатора объекта формулы %(label)s: %(entityIdentifier)s ​

source: Formula %(label)s period type: %(periodType)s
ru: Формула %(label)s: тип периода: %(periodType)s

source: Formula %(label)s period end: %(period)s
ru: Формула %(label)s: конец периода: %(period)s

source: Formula %(label)s period start: %(period)s
ru: Формула %(label)s: начало периода: %(period)s

source: Formula %(label)s unit: %(unit)s
ru: Формула %(label)s: единица измерения: %(unit)s

source: Formula %(label)s
ru: Формула %(label)s

source: Formula %(label)s dimension %(dimension)s: %(value)s
ru: Формула %(label)s: измерение %(dimension)s: %(value)s

source: Formula %(label)s dimension %(dimension)s value is not a node: %(value)s
ru: Формула %(label)s: значение измерения %(dimension)s не является узлом: %(value)s

source: Formula %(label)s OCC element %(occ)s covers a dimensional aspect
ru: Формула %(label)s: элемент OCC %(occ)s охватывает аспект измерения

source: Formula %(label)s value is a sequence of length %(valueSequenceLength)s
ru: Значение формулы %(label)s представляет собой последовательность длины %(valueSequenceLength)s

source: neither source {0}, nor an aspect rule, were found.
fr: ne la source {0}, ni une règle d'aspect, non été trouvé
ru: не было найдено ни источника {0}, ни правила аспекта.

source: source, {0}, contains the QName of a fact variable that binds as a sequence where that fact's aspect rule covers this filtered aspect
fr: La source {0} contient le QName d'une variable de fait qui se lie comme une séquence, où l'a règle d'aspect de ce tfait couvre cet aspect filtré
ru: источник, {0}, содержит QName факта, которая привязана как последовательность, в которой аспектное правило этого факта охватывает этот отфильтрованный аспект

source: Fact Variable
fr: Variable de fait
ru: Переменная-факт

source: General Variable
fr: Variable Générale
ru: Общая переменная

source: Parameter
fr: Paramètre
ru: Параметр

source: Tuple
ru: Кортеж

source: %(cfi)s step %(step)s Expression: %(expression)s
fr: %(cfi)s étape %(step)s Expression: %(expression)s
ru: %(cfi)s шаг %(step)s Выражение: %(expression)s

source: %(cfi)s step %(step)s Result: %(expression)s
fr: %(cfi)s étape %(step)s Résultat: %(expression)s
ru: %(cfi)s шаг %(step)s Результат: %(expression)s

source: %(cfi)s output Expression: %(expression)s
fr: %(cfi)s sortie Expression: %(expression)s
ru: %(cfi)s результат Выражение: %(expression)s

source: %(cfi)s output Result: %(expression)s
fr: %(cfi)s sortie Résultat : %(expression)s
ru: %(cfi)s результат Результат: %(expression)s

source: Regular expression interpretation flag unrecognized: {0}
fr: Drapeau de l'expression régulière non reconnu : {0}
ru: Флаг интерпретации регулярных выражений не определен: {0}

source: fn:matches regular expression pattern error: {0}
ru: ошибка регулярного выражения fn:matches: {0}

source: fn:replace pattern '$' error in: {0}
ru: fn:replace '$' ошибка шаблона в: {0}

source: fn:replace regular expression pattern error: {0}
ru: fn:replace ошибка регулярного выражения: {0}

source: Effective boolean value indeterminate
fr: Valeur booléen effective non déterminée
ru: Эффективное булево значение не определено
