Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: Disallowed character '%(text)s' in file %(file)s at line %(line)s col %(column)s
fr: Caractère '%(text)s' non autorisée dans le fichier %(file) ligne %(line)s colonne %(column)s
ru: Недопустимый символ '%(text)s' в файле %(file)s в строке %(line)s колонке %(column)s

source: Fact %(fact)s contextID %(contextID)s has disallowed entity %(entity)s
fr: Le fait %(fact)s du context %(contextID)s contient une entité %(entity)s non autorisée
ru: Факт %(fact)s contextID %(contextID)s включает запрещенный объект %(entity)s

source: Fact %(fact)s contextID %(contextID)s has text which causes the XML error %(error)s
fr: Le fait %(fact)s du context %(contextID)s contient du texte qui a généré l'erreur XML %(error)s
ru: Факт %(fact)s contextID %(contextID)s включает текст, который вызывает ошибку XML %(error)s

source: Fact %(fact)s of context %(contextID)s has javascript in '%(attribute)s' for <%(element)s>
ru: Факт %(fact)s контекста %(contextID)s имеет javascript в '%(attribute)s' для <%(element)s>

source: Fact %(fact)s of context %(contextID)s has an invalid external reference in '%(attribute)s' for <%(element)s>
ru: Факт %(fact)s контекста %(contextID)s имеет недопустимую внешнюю ссылку в '%(attribute)s' для <%(element)s>

source: Fact %(fact)s of context %(contextID)s references a graphics file which isn't .gif or .jpg '%(attribute)s' for <%(element)s>
ru: Факт %(fact)s контекста %(contextID)s ссылается на графический файл, который не является .gif или .jpg '%(attribute)s' для <%(element)s>

source: Fact %(fact)s of context %(contextID)s references a graphics file which doesn't have expected content '%(attribute)s' for <%(element)s>
ru: Факт %(fact)s контекста %(contextID)s ссылается на графический файл, который не имеет ожидаемого содержимого '%(attribute)s' для <%(element)s>

source: Fact %(fact)s of context %(contextID)s references a graphics file which isn't openable '%(attribute)s' for <%(element)s>, error: %(error)s
ru: Факт %(fact)s контекста %(contextID)s ссылается на графический файл, который не открывается '%(attribute)s' для <%(element)s>, ошибка: %(error)s

source: Fact %(fact)s of context %(contextID)s has nested <table> elements.
ru: Факт %(fact)s контекста %(contextID)s имеет вложенные элементы <table>.

source: Footnote {}
ru: Сноска {}

source: %(validatedObjectLabel)s causes the XML error %(error)s
ru: %(validatedObjectLabel)s вызывает ошибку XML %(error)s

source: %(validatedObjectLabel)s has disallowed element <%(element)s>
ru: %(validatedObjectLabel)s включает запрещенный элемент <%(element)s>

source: If element <a> does not have attribute @href, it should not have any ancestors other than html, body, or div. Disallowed ancestors: %(disallowedAncestors)s
ru: Если элемент <a> не имеет атрибута @href, он не должен иметь никаких элементов, кроме html, body или div. Запрещенные элементы: %(disallowedAncestors)s

source: %(validatedObjectLabel)s has disallowed attribute on element <%(element)s>: %(attribute)s="%(value)s"
ru: %(validatedObjectLabel)s включает запрещенный атрибут на элементе <%(element)s>: %(attribute)s="%(value)s"

source: %(validatedObjectLabel)s has disallowed attribute on element <%(element)s>: xml:base="%(value)s"
ru: %(validatedObjectLabel)s включает запрещенный атрибут на элементе <%(element)s>: xml:base="%(value)s"

source: %(validatedObjectLabel)s has disallowed attribute on element <%(element)s>: xsi:schemaLocation="%(value)s"
ru: %(validatedObjectLabel)s включает запрещенный атрибут на элементе <%(element)s>: xsi:schemaLocation="%(value)s"

source: %(validatedObjectLabel)s has javascript in '%(attribute)s' for <%(element)s>
ru: %(validatedObjectLabel)s имеет javascript в '%(attribute)s' для <%(element)s>

source: %(validatedObjectLabel)s has an invalid external reference in '%(attribute)s' for <%(element)s>: %(value)s
ru: %(validatedObjectLabel)s имеет недопустимую внешнюю ссылку в '%(attribute)s' для <%(element)s>: %(value)s

source: %(validatedObjectLabel)s references a graphics file which isn't .gif or .jpg '%(attribute)s' for <%(element)s>
ru: %(validatedObjectLabel)s ссылается на графический файл, который не является .gif или .jpg ' %(attribute)s' для <%(element)s>

source: %(validatedObjectLabel)s references a graphics file which doesn't have expected content '%(attribute)s' for <%(element)s>
ru: %(validatedObjectLabel)s ссылается на графический файл, который не имеет ожидаемого содержимого '%(attribute)s' для <%(element)s>

source: %(validatedObjectLabel)s references a graphics file which isn't openable '%(attribute)s' for <%(element)s>, error: %(error)s
ru: %(validatedObjectLabel)s ссылается на графический файл, который не открывается '%(attribute)s' для <%(element)s>, ошибка: %(error)s

source: %(validatedObjectLabel)s <meta> content is "%(metaContent)s" but must be "text/html"
ru: %(validatedObjectLabel)s <meta> контент "%(metaContent)s", а должен быть "text/html"

source: %(validatedObjectLabel)s has nested <table> elements.
ru: %(validatedObjectLabel)s имеет вложенные элементы <table>.

source: Relationship from %(xlinkFrom)s to %(xlinkTo)s should have an %(element)s source
fr: La relation de %(xlinkFrom)s vers %(xlinkTo)s devrait avoir une source %(element)s
ru: Отношение %(xlinkFrom)s к %(xlinkTo)s должно иметь источник %(element)s

source: Relationship from %(xlinkFrom)s to %(xlinkTo)s should not have an %(element)s source
ru: Отношение %(xlinkFrom)s к %(xlinkTo)s не должно содержать источника %(element)s

source: Relationship from %(xlinkFrom)s to %(xlinkTo)s should have an %(element)s target
ru: Отношение %(xlinkFrom)s к %(xlinkTo)s должно иметь цель %(element)s

source: Relationship from %(xlinkFrom)s to %(xlinkTo)s should not have an %(element)s target
ru: Отношение %(xlinkFrom)s к %(xlinkTo)s не должно иметь цель %(element)s

source: Function-implementation relationship from signature %(name)s has more than one implementation target
fr: La relation fonction-implémentation dont la signature est %(name)s a plusieurs implémentations pour cible
ru: Отображение функции-реализации от подписи %(name)s имеет более одного целевого объекта реализации

source: Function implementation %(xlinkLabel)s must be the target of only one function-implementation relationship
fr: L'implémentation de la fonction %(xlinkLabel)s ne doit être la cible que d'une relation fonction-implémentation
ru: Реализация функции %(xlinkLabel)s должна быть target только одной связи функция-реализация

source: Assertion-unsatisfied-severity relationship from %(xlinkLabel)s has more than one severity target
ru: Отображение assertion-unsatisfied-severity от %(xlinkLabel)s имеет более одной severity target

source: Executing call
fr: Exécution de l'appel
ru: Вызов выполнения

source: %(name)s result %(result)s
fr: %(name)s résultat %(result)s
ru: %(name)s результат %(result)s

source: Executing test
fr: Exécution du test
ru: Выполнение теста

source: Test %(name)s result %(result)s
fr: Test %(name)s ; résultat %(result)s
ru: Тест %(name)s, результат %(result)s

source: %(name)s evaluation error: %(error)s %(errorSource)s
fr: %(name)s erreur d'évaluation: %(error)s %(errorSource)s
ru: %(name)s ошибка оценки: %(error)s %(errorSource)s с

source: Formula validation skipped due to %(error)s error
fr: La validation de formule n'est pas réalisée en raison de l'erreur %(error)s
ru: Проверка формулы пропущена из-за ошибки %(error)s

source: Undefined dependencies in parameter %(name)s, to names %(dependencies)s
fr: Dépendances non défines dans le %(name)s vers les noms %(dependencies)s
ru: Неопределенные зависимости в параметре %(name)s к именам %(dependencies)s

source: Cyclic dependencies in parameter %(name)s, to names %(dependencies)s
fr: Dépendance cyclique dans le paramètre %(name)s pour les noms %(dependencies)s
ru: Циклические зависимости в параметре %(name)s к именам %(dependencies)s

source: Custom function %(name)s has namespace reserved for functions in the function registry %(namespace)s
fr: La fonction spécifique %(name)s utilise un espace de nomamge réservé aux fonctions du registre %(namespace)s
ru: Пользовательская функция %(name)s имеет пространство имен, зарезервированное для функций в реестре функций %(namespace)s

source: Custom Function Signature %(name)s output type %(type)s is not valid
ru: Подпись пользовательской функции %(name)s, тип вывода %(type)s некорректен

source: Custom Function Signature %(name)s input type %(type)s is not valid
ru: Подпись пользовательской функции %(name)s, тип ввода %(type)s некорректен

source: Custom function %(name)s signature has %(parameterCountSignature)s parameters but implementation has %(parameterCountImplementation)s, must be matching
fr: La signature de la fonction spécifique %(name)s a %(parameterCountSignature)s paramètres mais son implémentation a %(parameterCountImplementation)s paramètres ; cela doit correspondre
ru: У подписи пользовательской функции %(name)s есть параметры %(parameterCountSignature)s, но реализация имеет %(parameterCountImplementation)s, и должна соответствовать

source: Custom function implementation %(xlinkLabel)s has no relationship from any custom function signature
fr: L'implémentation de la fonction spécifique %(xlinkLabel)s n'a aucune relation avec les signatures des fonctions spécifiques
ru: Реализация пользовательской функции %(xlinkLabel)s не имеет отношения от какой-либо подписи пользовательской функций

source: Parameter %(name)s type %(type)s is not valid
ru: Параметр %(name)s тип %(type)s некорректен

source: Parameter %(name)s input value %(input)s
fr: Paramètre %(name)s, valeur d'entrée %(input)s
ru: Параметр %(name)s, входное значение %(input)s

source: Parameter %(name)s is required but not input
ru: Параметр %(name)s требуется, но не получен

source: Parameter %(name)s does not have a select attribute
ru: Параметр %(name)s не имеет атрибута выбора

source: Parameter %(name)s select result %(result)s
fr: Paramètre %(name)s, résultat sélectionné %(result)s
ru: Результат выбора параметра %(name)s - %(result)s

source: Parameter %(name)s Exception: %(error)s
fr: Paramètre %(name)s Exception: %(error)s
ru: Параметр %(name)s с Исключение: %(error)s

source: Multiple typed domain definitions from %(typedDomain)s to %(equalityDefinition1)s and %(equalityDefinition2)s
fr: Plusieurs définition de domaine typé %(typedDomain)s : %(equalityDefinition1)s et %(equalityDefinition2)s
ru: Множественные типизированные определения домена из %(typedDomain)s в %(equalityDefinition1)s и %(equalityDefinition2)s

source: Multiple output instances for formula %(xlinkLabel)s, to names %(instanceTo)s, %(instanceTo2)s
fr: Plusieurs instances générées pour la formule %(xlinkLabel)s vers les noms %(instanceTo)s et %(instanceTo2)s
ru: Несколько экземпляров вывода для формулы %(xlinkLabel)s, для имен %(instanceTo)s, %(instanceTo2)s

source: Formula:formula %(xlinkLabel)s is not allowed
fr: Formule %(xlinkLabel)s non autorisée
ru: Formula:formula %(xlinkLabel)s не допускается

source: Variable set %(xlinkLabel)s, aspect model %(aspectModel)s not recognized
fr: Ensemble de varables : %(xlinkLabel)s, le modèle d'aspect %(aspectModel)s n'est pas reconnu
ru: Переменный набор %(xlinkLabel)s, аспектная модель %(aspectModel)s не распознана

source: Multiple variables named %(xlinkLabel)s in variable set %(name)s
fr: Plusieurs variables nommées %(xlinkLabel)s dans l'ensemble %(name)s
ru: Несколько переменных с именем %(xlinkLabel)s в наборе переменных %(name)s

source: Variables name %(name)s cannot be determined on arc from %(xlinkLabel)s
fr: La variable nommée %(name)s ne peut pas être déterminée sur l'arc de %(xlinkLabel)s
ru: Имя переменных %(name)s не может быть определено для arc из %(xlinkLabel)s

source: Variable set %(xlinkLabel)s, variable %(name)s, dependences %(dependencies)s
fr: Ensemble de varables : %(xlinkLabel)s, variable %(name)s, dépendances %(dependencies)s
ru: Набор переменных %(xlinkLabel)s, переменная %(name)s, зависимости %(dependencies)s

source: Variable set %(xlinkLabel)s fallbackValue '%(fallbackValue)s' cannot refer to variable %(dependency)s
fr: Ensemble de variables : %(xlinkLabel)s, le valeur de repli '%(fallbackValue)s' ne peut pas renvoyer vers une variable %(dependency)s
ru: Значение переменной %(xlinkLabel)s fallbackValue '%(fallbackValue)s' не может ссылаться на переменную %(dependency)s

source: Undefined variable dependencies in variable set %(xlinkLabel)s, from variable %(nameFrom)s to %(nameTo)s
fr: Dépendances de variable non défines dans l'ensemble de variables %(xlinkLabel)s, de la variable %(nameFrom)s vers %(nameTo)s
ru: Неопределенные зависимости переменных в наборе переменных %(xlinkLabel)s, от переменной %(nameFrom)s до %(nameTo)s

source: Cyclic dependencies in variable set %(xlinkLabel)s, from variable %(nameFrom)s to %(nameTo)s
fr: Dépendance cyclique dans l'ensemble de variables %(xlinkLabel)s, de la variabel %(nameFrom)s vers %(nameTo)s
ru: Циклические зависимости в наборе переменных %(xlinkLabel)s, от переменной %(nameFrom)s до %(nameTo)s

source: Undefined variable dependency in variable set %(xlinkLabel)s, %(name)s
fr: Dépendance de variable non défine dans l'ensemble de variable %(xlinkLabel)s, %(name)s
ru: Неопределенная зависимость переменной в наборе переменных %(xlinkLabel)s, %(name)s

source: Variable set %(xlinkLabel)s, variables order: %(dependencies)s
fr: Ensemble de varables : %(xlinkLabel)s, ordre des variables : %(dependencies)s
ru: Набор переменных %(xlinkLabel)s, порядок переменных: %(dependencies)s

source: Variable set %(xlinkLabel)s, instance dependences %(dependencies)s
fr: Ensemble de varables : %(xlinkLabel)s, dépendances de l'instance %(dependencies)s
ru: Набор переменных %(xlinkLabel)s, зависимости экземпляра %(dependencies)s

source: Existence Assertion %(xlinkLabel)s, cannot refer to variable %(name)s
fr: Assertion existence %(xlinkLabel)s, ne peut pas référencer la variable %(name)s
ru: Assertion %(xlinkLabel)s, не может ссылаться на переменную %(name)s

source: Variable set %(xlinkLabel)s, filter %(filterLabel)s, cannot be covered
fr: Ensemble de varables : %(xlinkLabel)s, le filtre %(filterLabel)s ne peut pas êter couvert
ru: Набор переменных %(xlinkLabel)s, фильтр %(filterLabel)s не может быть покрыт

source: Variable set %(xlinkLabel)s, filter %(filterLabel)s, cannot refer to variable %(name)s
fr: Ensemble de varables : %(xlinkLabel)s, le filter %(filterLabel)s ne peut pas pointer vers la variable %(name)s
ru: Набор переменных %(xlinkLabel)s, фильтр %(filterLabel)s не может ссылаться на переменную %(name)s

source: Cyclic dependencies of instance %(name)s produced by a formula, with variables consuming instances %(dependencies)s
fr: Dépendance cyclique de l'instance %(name)s causée par une formule, dont les variables consomment les instances %(dependencies)s
ru: Циклические зависимости экземпляра %(name)s, вырабатываемые формулой с переменными в отчетах %(dependencies)s

source: Cyclic dependencies of instance %(name)s produced by its own variables
ru: Циклические зависимости экземпляра %(name)s, создаваемого его собственными переменными

source: Variable instances processing order: %(dependencies)s
fr: Ordre de traitement des variables d'instance : %(dependencies)s
ru: Порядок обработки экземпляров переменных: %(dependencies)s

source: Consistency assertion %(xlinkLabel)s has both absolute and proportional acceptance radii
fr: Cohérence de Assertion %(id)s :%(xlinkLabel)s a simultanément le rayon d'acceptation proportionnel et absolu
ru: Согласованное утверждение %(xlinkLabel)s имеет как абсолютные, так и пропорциональные направления согласования

source: Consistency assertion %(xlinkLabel)s has relationship to a %(elementTo)s %(xlinkLabelTo)s
fr: Cohérence de Assertion %(id)s :%(xlinkLabel)s a une relation vers un %(elementTo)s %(xlinkLabelTo)s
ru: Согласованное утверждение %(xlinkLabel)s имеет отношение к %(elementTo)s %(xlinkLabelTo)s

source: Variable set %(xlinkLabel1)s in instance %(instance1)s has variables scope relationship to varaible set %(xlinkLabel2)s in instance %(instance2)s
fr: L'ensemble de variables %(xlinkLabel1)s de l'instance %(instance1)s a une relation de périmètre de variables vers l'ensemble de variabels %(xlinkLabel2)s de l'instance %(instance2)s
ru: Набор переменных %(xlinkLabel1)s в экземпляре %(instance1)s имеет отношение видимости переменных к набору переменных %(xlinkLabel2)s в экземпляре %(instance2)s

source: Variable set %(xlinkLabel1)s aspectModel (%(aspectModel1)s) differs from varaible set %(xlinkLabel2)s aspectModel (%(aspectModel2)s)
ru: Набор переменных %(xlinkLabel1)s aspectModel ( %(aspectModel1)s) отличается от набора переменных %(xlinkLabel2)s aspectModel ( %(aspectModel2)s)

source: initializing formula output instances
ru: инициализация вывода формул в отчеты

source: running formulae
ru: выполнение формул

source: Formua/assertion IDs restriction: %(ids)s
ru: Формула/ ограничение assertion ID: %(ids)s

source: evaluating {0}
ru: проверка {0}

source: Variable set %(variableSet)s Exception: %(error)s
fr: Ensemble de variables %(variableSet)s Exception : %(error)s
ru: Набор переменных %(variableSet)s Исключение: %(error)s

source: Formula execution ended after %(mins)s minutes
ru: Выполнение формулы закончилось после %(mins)s минут

source: %(assertionType)s Assertion %(id)s evaluations : %(satisfiedCount)s satisfied, %(notSatisfiedCount)s not satisfied
fr: %(assertionType)s Assertion %(id)s évaluations : %(satisfiedCount)s satisfaite(s), %(notSatisfiedCount)s non satisfaite(s)
ru: %(assertionType)s Утверждение %(id)s оценки: %(satisfCount)s выполнено, %(notSatisfiedCount)s не выполнено

source: Consistency Assertion %(id)s evaluations : %(satisfiedCount)s satisfied, %(notSatisfiedCount)s not satisfied
fr: Cohérence de Assertion %(id)s : %(satisfiedCount)s évaluations satisfaites, %(notSatisfiedCount)s évaluations non satisfaites
ru: Согласованное утверждение %(id)s: %(satisfCount)s удовлетворено, %(notSatisfiedCount)s не выполнено

source: formulae finished
ru: Формулы проверены

source: Variable set %(xlinkLabel)s, aspect cover filter %(filterLabel)s, aspect %(aspect)s, conflicts with %(filterLabel2)s with inconsistent cover attribute
fr: L'ensemble de variables %(xlinkLabel)s, filtre de couverture d'aspect %(filterLabel)s, aspect %(aspect)s, entre en conflit avec %(filterLabel2)s avec un attribut de couverture non cohérent
ru: Набор переменных %(xlinkLabel)s, фильтр покрытия объектов %(filterLabel)s, аспект %(aspect)s конфликтует с %(filterLabel2)s с несогласованным атрибутом покрытия

source: Variable set %(xlinkLabel)s, aspect model %(aspectModel)s filter %(filterName)s %(filterLabel)s can cover aspect not in aspect model
fr: Ensemble de varables : %(xlinkLabel)s, model d'aspect %(aspectModel)s, filtre %(filterName)s %(filterLabel)s peut couvrir un aspect en dehors du modèle d'aspect
ru: Набор переменных %(xlinkLabel)s, аспектная модель %(aspectModel)s фильтр %(filterName)s. %(filterLabel)s может охватывать аспект не в аспектной модели

source: Formula %(xlinkLabel)s concept rule does not have a nearest source and does not have a child element
fr: Formule %(xlinkLabel)s la règle d econcept n'a pas de source la plus proche et n'a pas d'élément enfant
ru: Формула концепта %(xlinkLabel)s не имеет ближайшего источника и не имеет дочернего элемента

source: Formula %(xlinkLabel)s omits a rule for the concept aspect
fr: Formule %(xlinkLabel)s omet une règle pour l'aspect concept
ru: Формула %(xlinkLabel)s исключает правило для аспекта концепции

source: Formula %(xlinkLabel)s entity identifier rule does not have a nearest source and does not have either a @scheme or a @value attribute
fr: Formule %(xlinkLabel)s, la règle sur l'identifiant de l'entité n'a pas de source la plus proche et n'a pas d'attribut @scheme ni @value.
ru: Правило идентификатора формулы %(xlinkLabel)s не имеет ближайшего источника и не имеет атрибута @scheme или @value

source: Formula %(xlinkLabel)s omits a rule for the entity identifier aspect
fr: La formule %(xlinkLabel)s omet une règle pour l'aspect identifiant d'entité
ru: Формула %(xlinkLabel)s исключает правило для аспекта идентификатора сущности

source: Formula %(xlinkLabel)s period rule does not have a nearest source and does not have a child element
fr: La règle période de la formule %(xlinkLabels)s n'a pas de source la plus proche et n'a pas d'élément enfant
ru: Правило периода формулы %(xlinkLabel)s не имеет ближайшего источника и не имеет дочернего элемента

source: Formula %(xlinkLabel)s omits a rule for the period aspect
fr: La formule %(xlinkLabel)s omet une règle pour l'aspect période
ru: Формула %(xlinkLabel)s исключает правило для аспекта периода

source: Formula %(xlinkLabel)s unit rule does not have a source and does not have a child element
fr: La règle unité de la formule %(xlinkLabel)s n'a pas de source et n'a pas d'élément enfant
ru: Формула %(xlinkLabel)s. Правило проверки unit не имеет источника и не имеет дочернего элемента

source: Formula %(xlinkLabel)s omits a rule for the unit aspect
fr: La formule %(xlinkLabel)s omet une règle pour l'aspect unité
ru: Формула %(xlinkLabel)s исключает правило для единичного аспекта

source: Formula %(xlinkLabel)s has a rule for the unit aspect of a non-numeric concept %(concept)s
fr: La formule %(xlinkLabel)s a une règle pour l'aspect unité du concept non numérique %(concept)s
ru: Формула %(xlinkLabel)s имеет правило для единичного аспекта нечислового концепта %(concept)s

source: Formula %(xlinkLabel)s has a rule for the %(aspectPeriodType)s period aspect of a %(conceptPeriodType)s concept %(concept)s
fr: La formule %(xlinkLabel)s a une règle pour l'aspect période %(aspectPeriodType)s dun concept %(conceptPeriodType)s %(concept)s
ru: Формула %(xlinkLabel)s имеет правило %(aspectPeriodType)s для аспекта периода %(conceptPeriodType)s концепта %(concept)s

source: Formula %(xlinkLabel)s dimension attribute %(dimension)s on the %(dimensionType)s dimension rule contains a QName that does not identify an (dimensionType)s dimension.
fr: Formule %(xlinkLabel)s attribut de dimension %(dimension)s, la règle contient un nom qualifié (QName) qui n'identifie pas une dimension %(dimensionType)s.
ru: Атрибут измерения %(xlinkLabel)s формулы %(dimension)s в правиле измерения %(sizeType)s содержит QName, которое не идентифицирует измерение (dimensionType)s.

source: Formula %(xlinkLabel)s %(dimension)s dimension rule does not have any child elements and does not have a SAV for the %(dimensionType)s dimension that is identified by its dimension attribute.
fr: Dans la formule %(xlinkLabel)s, dimension %(dimension)s, la règle n'a pas d'élément enfant et n'a pas de "valeur d'aspect source" pour la dimension %(dimensionType)s qui est identifiée par son attribut dimensions.
ru: Правило измерения %(xlinkLabel)s формулы %(xlinkLabel)s не имеет дочерних элементов и не имеет SAV для измерения %(sizeType)s, которое идентифицируется его атрибутом измерения.

source: Formula %(xlinkLabel)s aspect model, %(aspectModel)s, includes an rule for aspect not defined in this aspect model: %(undefinedAspects)s
fr: Formule %(xlinkLabel)s, modèle d'aspect %(aspectModel)s, inclut une tègle pour un aspect non défini dans le modèle : %(undefinedAspects)s
ru: Аспектная модель формулы %(xlinkLabel)s, %(aspectModel)s, включает правило для аспекта, не определенного в модели аспекта: %(undefinedAspects)s

source: Formula %(xlinkLabel)s, not implicit filtering element has formulaUncovered source: %(name)s
fr: Dans la formule %(xlinkLabel)s, l'élément filtrant non-implicite a une source formulaUncovered : %(name)s
ru: Формула %(xlinkLabel)s, не implicit фильтрующий элемент имеет sourceUncovered источник: %(name)s
