Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: Exception preparing {0}: {1}, at {2}
fr: Exception lors de la préparation de {0}: {1} à {2}
ru: Подготовка исключения {0}: {1}, в {2}

source: Exception preparing view
fr: Exception lors de la préparation de la vue
ru: Представление исключения

source: Exception {0}: {1}, at {2}
fr: Exception {0}: {1}, à {2}
ru: Исключение {0}: {1}, в {2}

source: Validation - disclosure system checks is requested but no disclosure system is selected, please select one by validation - select disclosure system.
ru: Валидация - запрошена проверка согласно системе раскрытия информации, но система раскрытия не выбрана. Выберите систему раскрытия.

source: Two DTSes are required for the Compare DTSes operation, {0} found
fr: Deux DRS sont requises pour la comparaison de DTS, {0} trouvées
ru: Для операции сравнения DTS необходимы два DTS, {0} найдено

source: arelle - Save Versioning Report File
fr: arelle - Enregistrer le rapport de versioning
ru: arelle - Сохранить файл отчета о сравнении версий

source: Versioning report file
fr: Fichier de rapport de version
ru: Файл отчета о сравнении версий

source: Loaded {0} items from {1}
fr: {0} items chargés de {1}
ru: Загружено {0} элементов из {1}

source: Failed to load {0} {1}
fr: Échec du chargement de {0} {1}
ru: Не удалось загрузить {0} {1}

source: arelle - Clear Internet Cache
fr: arelle - Vider le cache Internet
ru: arelle - Очистить интернет-кеш

source: Are you sure you want to clear the internet cache?
fr: Êtes-vous sûr de vouloir vider le cache Internet?
ru: Вы действительно хотите очистить интернет-кеш?

source: Clearing internet cache
ru: Очистка интернет-кеша

source: Internet cache cleared
ru: Интернет-кеш очищен

source: RSS Watch Control Error
ru: Ошибка контроля просмотра RSS

source: RSS Feed is not set up, please select options and select feed
fr: Le flux RSS n'est pas configuré, merci de choisir les options et sélectionner un flux
ru: RSS-лента не настроена, выберите опции и выберите ленту

source: arelle - Labels language code setting
fr: arelle - Paramètre de langue des libellés
ru: arelle - установка кода языка для Labels

source: The system default language is: {0} You may override with a different language for labels display. Current language override code: {1} (Leave empty to use the system default language.)
ru: Системный язык по умолчанию: {0} Вы можете переопределить другой язык для отображения Labels. Текущий код переопределения языка: {1} (Оставьте пустым, чтобы использовать системный язык по умолчанию.)

source: Validate versioning report
fr: Validation du rapport de version
ru: Проверка отчета о сравнении версий

source: Check calculations (infer decimals)
fr: Validation des calculs (inférence des décimales)
ru: Проверка вычислений (вывести десятичные числа)

source: Check calculations (infer precision)
fr: Vérication des calculs (inférence de précision)
ru: Проверка вычислений (вывести точность)

source: Check unit type registry
fr: Vérification du registre des types d'unité
ru: Проверка единиц измерения (Units)

source: Validate {0} Check disclosure system rules {1}{2}{3}
ru: Проверка {0} Проверка правил системы раскрытия информации {1} {2} {3}

source: Validate {0}{1}{2}
ru: Валидировать {0} {1} {2}

source: About arelle
fr: À propos d'Arelle
ru: Об Arelle

source: arelleÂ® {0} {1}bit {2} An open source XBRL platform Â© 2010-2015 Mark V Systems Limited All rights reserved http://www.arelle.org support@arelle.org Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License. You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License. Includes: PythonÂ® {4[0]}.{4[1]}.{4[2]} Â© 2001-2013 Python Software Foundation PyParsing Â© 2003-2013 Paul T. McGuire lxml {5[0]}.{5[1]}.{5[2]} Â© 2004 Infrae, ElementTree Â© 1999-2004 by Fredrik Lundh xlrd Â© 2005-2013 Stephen J. Machin, Lingfo Pty Ltd, Â© 2001 D. Giffin, Â© 2000 A. Khan xlwt Â© 2007 Stephen J. Machin, Lingfo Pty Ltd, Â© 2005 R. V. Kiseliov{3} May include installable plug-in modules with author-specific license terms
ru: arelle® {0} {1} бит {2} Платформа XBRL с открытым исходным кодом © 2010-2015 Mark V Systems Limited Все права защищены http://www.arelle.org support@arelle.org Лицензирован по лицензии Apache, версия 2.0 ("Лицензия"); Вы не можете использовать этот файл, кроме как в соответствии с Лицензией. Вы можете получить копию Лицензии на http://www.apache.org/licenses/LICENSE-2.0 Если это не предусмотрено действующим законодательством или не согласовано в письменной форме, программное обеспечение, распространяемое по лицензии, распространяется на основе "КАК ЕСТЬ" БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ, как явных, так и подразумеваемых. См. Лицензию на конкретном языке, регулирующим разрешения и ограничения по Лицензии. Включает: Python® {4 [0]}. {4 [1]}. {4 [2]} © 2001-2013 Python Software Foundation PyParsing © 2003-2013 Paul T. McGuire Lxml {5 [0]}. {5 [1]}. {5 [2]} © 2004 Infrae, ElementTree © 1999-2004 by Fredrik Lundh Xlrd Â © 2005-2013 Stephen J. Machin, Lingfo Pty Ltd, © 2001 D. Giffin, © 2000 A. Khan Xlwt © 2007 Стивен Дж. Мачин, Lingfo Pty Ltd, © 2005 Р. В. Киселев {3} Может включать устанавливаемые модули плагинов с условиями лицензии для конкретного автора

source: Bottle Â© 2011-2013 Marcel Hellkamp
ru: BottleÂ © 2011-2013 Марсель Хеллкамп

source: arelle - Save Messages Log
fr: arelle - Enregistre les messages de log
ru: arelle - Сохранить журнал сообщений

source: Txt file
fr: Fichier txt
ru: Txt-файл

source: Exception
ru: Исключение

source: {0} Call trace {1}
ru: {0} Трассировка {1}

source: OK
fr: D'accord
ru: ОК

source: Select Arcrole Group
ru: Выберите Arcrole Group

source: Group:
ru: Группа:

source: Select an existing arcrole group, or enter a name for a new arcrole group. If selecting an existing group, it can be edited, and changes will be saved in the config file. If nothing is changed for an existing group, the saved setting is not disturbed. Arcroles with checkboxes below are shown only for arcroles that have relationships in the loaded DTS, but if an existing group is selected with more arcroles (that were not in the current DTS) then the prior setting with not-present arcroles is preserved.
ru: Выберите существующую группу arcrole или введите имя для новой группы arcrol. Если вы выбираете существующую группу, ее можно редактировать, и изменения сохраняются в файле конфигурации. Если в существующей группе ничего не изменилось, сохраненная настройка не будет нарушена. Arcroles с выбором ниже показаны только для arcroles, которые имеют отношения в загруженной DTS, но если существующая группа выбрана с большим количеством arcrole (которые не были в текущей DTS), то прежняя установка с не существующими arcrole сохраняется.

source: Remove the currently selected arcrole group from the config file. After removing, you may select another arcrole, but must select 'OK' for the removal to be saved.
ru: Удалите выбранную группу arcrole из файла конфигурации. После удаления вы можете выбрать другой arcrole, но для удаления нужно выбрать "ОК".

source: Shows all the arcroles that are present in this DTS.
ru: Показывает все arcrole, которые присутствуют в этом DTS.

source: detect
ru: определить

source: If checked, this arcrole group will be detected if any arcrole of the group is present in a DTS, for example to open a treeview pane.
ru: Если эта галочка установлена, эта группа аркролов будет обнаружена, если какой-либо аркрол группы присутствует в DTS, например, чтобы открыть панель тривью.

source: Cancel
fr: Annuler
ru: Отмена

source: Open a treeview with named arcrole group and selected arcroles. If any changes were made to checkboxes or name, save in the config.
ru: Откройте иерархию с группой arcrole и выбранными arcroles. Если какие-либо изменения были внесены в окно выбора или наименование, сохраните в конфигурации.

source: Close this dialog, without saving arcrole group changes or opening a view pane.
ru: Закройте это диалоговое окно, не сохраняя изменения группы arcrole или открыв панель просмотра.

source: Enter expression to find, or select from combo box drop down history list.
fr: Entrer l'expression à chercher, ou sélection un élément de l'historique
ru: Введите выражение для поиска или выберите из списка истории.

source: Scope for an XBRL document (instance or DTS). For an RSS Feed, all properties are matched.
fr: Périmètre pour un document XBRL (instance ou DTS). Pour un flux RSS, toutes les propriétés sont
ru: Область применения документа XBRL (отчет или DTS). Для RSS-ленты все свойства совпадают.

source: Find/Next up (on screen) from last to first match.
fr: Recherche/Précédant du dernier au premier
ru: Найти / Далее вверх (на экране) от последнего до первого совпадения.

source: Find/Next down (on screen) from first to last match.
fr: Recherche/Suivant du premier au dernier
ru: Найти / Далее вниз (на экране) от первого до последнего совпадения.

source: Expression is a set of characters to match, ignoring case. The match may occur anywhere within the scope.
fr: L'expression est un ensemble de caractères à trouver, en ignorant la casse. La correspondance peut avoir lieu n'importe où dans le périmètre.
ru: Выражение представляет собой набор символов для совпадения, игнорируя регистр. Совпадение может происходить где угодно в пределах области применения.

source: A regular expression to match, anywhere in the scope, ignoring case. For example, "cash" would match cash anywhere in a string (like cash on hand), whereas "^cash$" would match a full string to only contain cash. Use regular expression metacharacters, e.g., "." for any single character, ".*" for any number of wild characters, .{3} for exactly 3 wild characters.
fr: Une expression régulière à utiliser, dans le périmètre complet, en ignorant la casse. Par exemple, "passif" correspondra à "Passifs immobilisés". Certains caractères ont un sens particulier : '.' correspond à n'importe quel caractère ; '^' correspond au début de ligne ; '$' correspond à la fin de ligne ; '('...')' regroupe plusieurs caractères ; '*' est une répétition du groupe précédent.
ru: Регулярное выражение для соответствия в любом месте области применения, игнорируя регистр. Например, "cash" будут соответствовать cash в любой строке (например, cash on hand), тогда как "^cash$" будет соответствовать строке, содержащей только cash. Используйте символы регулярного выражения, например, "." для одиночного символа ". *" для любого количества символов, .{3} для ровно 3 символов.

source: An XPath 2 expression, where the context element, ".", is a candidate concept QName, if any concept scope is checked, and a candidate fact item, if any fact scope is checked. The XPath 2 functions do not need an "fn:" prefix (but it is defined). The XBRL Functions Registry functions do require an "xfi:" prefix. Constructors require an "xs:" prefix. The expression is considered "matched" for the candidate concept QNames or fact items where the effective boolean value of the expression is "true()".
ru: Выражение XPath 2, где элемент контекста, ".", является QName концепта. Если проверяется какая-либо область концепта и значение факт, если проверяется какая-либо область действия. Для функций XPath 2 не нужен префикс "fn:" (но он определен). Для функций XBRL требуется префикс "xfi:". В конструкторе требуется префикс "xs:". Выражение считается "совпадающим" для QNames концепта или фактов тем, где логическое значение выражения верно "true()".

source: Compile (if regular expression or XPath 2), and find first match (if down direction) or last match (if up direction).
fr: Compile (si expression régulière ou XPath 2) et trouve le premier (resp. dernier) résultat si la direction de recherche est "vers le bas" (resp. "vers le haut")
ru: Скомпилировать (если регулярное выражение или XPath 2) и найти первое совпадение (если поиск вниз) или последнее совпадение (если поиск вверх).

source: Next
fr: Suivant
ru: Следующий

source: Advance to the next matched object (in selected direction).
fr: Aller au prochain objet correspondant
ru: Переход к следующему подходящему объекту (в выбранном направлении).

source: Close the find dialog.
fr: Fermer la boîte de recherche
ru: Закрыть диалоговое окно поиска.

source: Find cannot be completed
fr: La recherche n'a pas abouti
ru: Поиск не может быть завершен

source: XPath matching is not available for searching messages, please choose text or regular expression.
fr: La correspondance XPath n'est pas disponible pour la recherhche de messages, merci de choisir texte ou expression régulière.
ru: XPath недоступно для поиска сообщений, выберите текст или регулярное выражение.

source: Find requires an opened DTS or RSS Feed
fr: La recherche nécessite une DTS ou un RSS ouvert
ru: Для поиска требуется открытый DTS или RSS-канал

source: XPath matching is not available for an RSS Feed, please choose text or regular expression.
fr: La correspondance XPath n'est pas disponible dans un flux RSS, merci de choisir texte ou expression régulière.
ru: XPath недоступно для RSS-канала, выберите текст или регулярное выражение.

source: Compiling xpath expression...
fr: Compile l'expression XPath
ru: Компиляция выражения xpath ...

source: Matching concepts...
fr: Recherche de concepts...
ru: Сравнение концептов...

source: Matching facts...
fr: Recherche de faits...
ru: Сравнение фактов...

source: Find expression error: {0} {1}
fr: Erreur dans l'expression de recherche : {0} {1}
ru: Ошибка выражения поиска: {0} {1}

source: Completed with errors
fr: Terminé avec succès
ru: Выполнено с ошибками

source: Next cannot be completed
fr: Suivant n'a pas pu aboutir
ru: Следующий шаг не может быть завершен

source: A different DTS is active, than find was initiated with. Please press 'find' to re-search with the current DTS
fr: La recherche a été effectuée sur un DTS différent de celui qui est actif. Veuillez utiliser "Recherche" pour rechercher de nouveau avec le DTS actuel.
ru: Активна другая DTS. Нажмите "Найти" для повторного поиска в текущей DTS

source: No matches were found. Please try a different search.
fr: Aucune correspondance trouvée. Merci d'essayer une auter recherche.
ru: Совпадений не найдено. Пожалуйста, попробуйте другой поиск.

source: Formula Parameters and Trace Options
fr: Paramétrage des formules et des logs
ru: Параметры формулы и трассировки

source: arelle - User Interface and Labels language code settings
ru: arelle - Пользовательский интерфейс и языковые настройки (Labels)

source: The system default language is: {0} You may override with a different language for user interface language and locale settings, and for language of taxonomy linkbase labels to display.
ru: Системный язык по умолчанию: {0} Вы можете переопределить язык для интерфейса пользователя и настроек, а также для отображения таксономии.

source: User Interface:
ru: Пользовательский интерфейс:

source: Labels:
ru: Метки (Labels):

source: User interface locale error
ru: Ошибка локализации интерфейса пользователя

source: Locale setting {0} ({1}) is not supported on this system
ru: Настройка локализации {0} ({1}) не поддерживается в этой системе

source: User interface language changed
ru: Язык интерфейса изменен

source: Should Arelle restart with changed user interface language, if there are any unsaved changes they would be lost!
ru: Arelle перезапустится с измененным языком интерфейса. Если есть несохраненные изменения, они будут потеряны!

source: Please restart Arelle for the change in user interface language.
ru: Перезапустите Arelle для изменения языка интерфейса.

source: New Fact Item Options
fr: Options Nouvel item de fait
ru: Новые опций Fact Item

source: Enter the scheme for the context entity identifier
fr: Entrer le schéma pour l'identifiant de l'entité dans le contexte
ru: Введите схему для идентификатора объекта контекста

source: Enter the entity identifier value (e.g., stock ticker)
fr: Entrer l'identifiant de l'entité (ex: le code ISIN)
ru: Введите значение идентификатора объекта (например, биржевой тикер)

source: Enter the start date for the report period (e.g., 2010-01-01)
fr: Entrer la date de début du rapport (ex: 2011-01-01)
ru: Введите дату начала отчетного периода (например, 2017-01-01)

source: Enter the end date for the report period (e.g., 2010-12-31)
fr: Entrer la date de fin du rapport (ex: 2011-12-31)
ru: Введите дату окончания периода отчета (например, 2017-12-31)

source: Select a monetary unit (e.g., EUR)
fr: Sélectionner une unité montaire (ex: EUR)
ru: Выберите денежную единицу (например, EUR)

source: Enter decimals for monetary items
fr: Entrer les décimales pour les items monétaires
ru: Введите десятичные знаки для денежных единиц

source: Enter decimals for non-monetary items (e.g., stock shares)
fr: Entrer les décimales pour les items non monétaires (ex: nombre d'actions)
ru: Введите десятичные знаки для неденежных единиц (например, акции)

source: Cancel operation, discarding changes and entries
fr: Annuler l'opération, les modifications seront perdues
ru: Отмена операции, изменений и ввода данных

source: Accept the options as entered above
fr: Accepter les options précédantes
ru: Принять варианты, указанные выше

source: Entity scheme invalid
fr: Le schéma pour l'entité n'est pas valide
ru: Недопустимая схема объекта

source: Entity identifier value invalid
fr: La valeur de l'identifiant d'entité n'est pas valide
ru: Недопустимое значение идентификатора объекта

source: Start date invalid
fr: Date de début invalide
ru: Дата начала некорректна

source: End date invalid
fr: Date de fin invalide
ru: Дата окончания некорректна

source: Monetary unit invalid
fr: Unité monétaire non valide
ru: Денежная единица некорректна

source: Monetary decimals invalid
fr: Décimales monétaires non valides
ru: Денежная разрядность некорректна

source: Non-monetary decimals invalid
fr: Décimales non-monétaires non valides
ru: Неденежная разрядность некорректна

source: Dialog validation error(s)
fr: Boîte de dialogue des erreurs de validation
ru: Ошибка(и) проверки

source: Select Entry Point
fr: Sélectrionner le point d'entrée
ru: Выберите точку входа

source: Select Archive File
fr: Sélectionner le fichier archive
ru: Выберите Архивный файл

source: Load disclosure systems
ru: Загрузить систему раскрытия информации

source: Disclosure systems are provided by plug-ins, no applicable plug-in(s) have been enabled. Press OK to open the plug-in manager and select plug-in(s) (e.g., validate or EdgarRenderer).
ru: Системы раскрытия предоставляются в плагинах. Подходящие плагины не подключены. Нажмите OK, чтобы открыть диспетчер плагинов и выбрать нужные плагины (например, validate или EdgarRenderer).

source: Select Disclosure System
ru: Выберите систему раскрытия информации

source: Disclosure System
ru: Система раскрытия информации

source: Select Plug-in Module
ru: Выберите подключаемый модуль (плагин)

source: loading archive {0}
fr: chargement de l'archive {0}
ru: загрузка архива {0}

source: Failed to parse metadata; the underlying error was: {0}
fr: Problème d'analyse des meta-données, l'erreur sous-jascente est : {0}
ru: Не удалось загрузить метаданные; ошибка: {0}

source: Malformed taxonomy package
fr: Paquet de taxonomie mal constitué
ru: Некорректная таксономия

source: Show Entries
fr: Afficher les entrées
ru: Показать записи

source: Show Files
ru: Показать файлы

source: Checking for updates to packages
ru: Проверка обновлений пакетов

source: Updates are available for these packages: {0}
ru: Для этих пакетов доступны обновления: {0}

source: No updates found for packages.
ru: Обновлений для пакетов не найдено .

source: Enable
ru: Включить

source: Disable
ru: Выключить

source: Taxonomy Packages Manager
ru: Менеджер таксономий

source: Find taxonomy packages:
ru: Поиск пакетов таксономий:

source: Locally
ru: Локально

source: File chooser allows selecting taxonomy packages to add (or reload), from the local file system. Select either a PWD or prior taxonomy package zip file, or a taxonomy manifest (.taxonomyPackage.xml) within an unzipped taxonomy package.
ru: Выбор файла позволяет выбирать пакеты таксономии для добавления (или перезагрузки) из файловой системы. Выберите пакет обновления PWD или zip, или манифест (.taxonomyPackage.xml) в разархивированном пакете таксономии.

source: On Web
ru: В Интернете

source: Dialog to enter URL full path to load (or reload) package, from the web or local file system. URL may be either a PWD or prior taxonomy package zip file, or a taxonomy manifest (.taxonomyPackage.xml) within an unzipped taxonomy package.
ru: Диалог для ввода полного URL-адреса для загрузки (или перезагрузки) пакета из веб или файловой системы. URL-адрес может быть PWD, zip или файлом манифеста таксономии (.taxonomyPackage.xml).

source: Manifest
ru: Манифест

source: Provide pre-PWD non-standard archive manifest file name pattern (e.g., *taxonomyPackage.xml). Uses unix file name pattern matching. Multiple manifest files are supported in pre-PWD archives (such as oasis catalogs). (Replaces pre-PWD search for either .taxonomyPackage.xml or catalog.xml).
ru: Укажите шаблон имени файла манифеста нестандартного архива (например, * taxonomyPackage.xml). Использует шаблон имени файла unix. Несколько файлов манифеста поддерживаются в архивах pre-PWD (таких как каталоги oasis). (Замена pre-PWD для .taxonomyPackage.xml или catalog.xml).

source: Name
ru: Имя

source: Version
ru: Версия

source: Status
ru: Статус

source: File Date
ru: Дата файла

source: Update
ru: Обновить

source: Description
ru: Описание

source: Prefix
ru: Префикс

source: Remapping
ru: Перепривязка

source: version:
ru: версия:

source: license:
ru: лицензия:

source: description:
ru: описание:

source: prefixes:
ru: префиксы:

source: List of prefixes that this package remaps.
ru: Список префиксов на которые этот пакет ссылается.

source: URL of taxonomy package (local file path or web loaded file).
ru: URL пакета таксономии (локальный путь или веб-адрес).

source: date:
ru: дата:

source: Filesystem date of currently loaded package file (with parenthetical node when an update is available).
ru: Дата файловой системы файла пакета.

source: publisher:
ru: издатель:

source: Publisher of currently loaded package file.
ru: Издатель загруженного в данный момент пакета.

source: publication date:
ru: дата публикации:

source: Publication date
ru: Дата публикации

source: Enable/disable package.
ru: Включить/отключить пакет.

source: Move Up
ru: Переместить вверх

source: Move package up (above other remappings).
ru: Переместить пакет вверх.

source: Move Down
ru: Переместить вниз

source: Move package down (below other remappings).
ru: Переместите пакет вниз.

source: Reload
ru: Перезагрузить

source: Reload/update package.
ru: Перезагрузить/обновить пакет.

source: Remove
ru: Удалить

source: Remove package from packages table (does not erase the package file).
ru: Удалить пакет из списка пакетов (не удаляет файл пакета).

source: Accept and changes (if any) and close dialog.
ru: Принять изменения (если есть) и закрыть диалог.

source: Cancel changes (if any) and close dialog.
ru: Отменить изменения (если есть) и закрыть диалог.

source: Enable All
ru: Включить все

source: Enable all packages.
ru: Включить все пакеты.

source: Disable All
ru: Отключить все

source: Disable all packages.
ru: Отключить все пакеты.

source: available
ru: доступный

source: (an update is available)
ru: (доступно обновление)

source: Choose taxonomy package file
ru: Выберите файл пакета таксономии
