Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: fn:zero-or-one called with a sequence containing more than one item
ru: fn:zero-or-one вызвана с последовательностью, содержащей более одного элемента

source: fn:one-or-more called with a sequence containing no items
ru: fn:one-or-more вызвана с последовательностью, не содержащей элементов

source: fn:exactly-one called with a sequence containing zero or more than one item
ru: fn:exactly-one вызвана с последовательностью, содержащей ноль или более одного элемента

source: Function xf:doc no formula resource element for {0}
fr: La fonction xf:doc n'a pas d'élément de resource formule pour {0}
ru: Функция xf:doc - нет элемента ресурса формулы для {0}

source: Function xf:doc $uri is not valid {0}
fr: Function xf:doc $uri n'est pas valide {0}
ru: Функция xf:doc - $uri некорректен {0}

source: Function xf:doc $uri not successfully loaded {0}
fr: Function xf:doc $uri n'a pas pu être chargé correctement : {0}
ru: Функция xf:doc - загрузка $uri не удалась {0}

source: ixt function not available
fr: Function ixt non disponible
ru: функция ixt недоступна

source: Saka calendar year not supported: {0} {1} {2}
ru: Календарный год Saka не поддерживается: {0} {1} {2}

source: Saka calendar month error: {0} {1} {2}
ru: Ошибка календарного месяца Saka: {0} {1} {2}

source: Saka calendar day error: {0} {1} {2}
ru: Ошибка календарного дня Saka: {0} {1} {2}

source: Value operation {0} incompatible arguments {1} ({2}) and {3} ({4})
ru: Операция {0} - несовместимые аргументы {1} ({2}) и {3} ({4})

source: xfi function not available
fr: fonction xfi non disponible
ru: функция xfi недоступна

source: Period is not instant
fr: La période est un instant
ru: Период не instant

source: Period is forever
fr: La période est éternelle
ru: Период forever

source: Argument 1 {0} is not inferrable.
fr: L'argument 1 {0} ne peut pas être inféré.
ru: Аргумент 1 {0} недопустимый.

source: Argument 1 is not reported with {0}.
fr: L'argument 1 n'est pas rapporté avec {0}
ru: Аргумент 1 не выводится с {0}.

source: Function xff:uncovered-aspect cannot be used on an XPath expression associated with a {0}
fr: La fonction xff:uncovered-aspect ne peut pas être utilisé dans une expression XPath associée à {0}
ru: Функция xff:uncovered-aspect не может использоваться в выражении XPath, связанном с {0}

source: Function xff:uncovered-aspect cannot be used with implicitFiltering=false
fr: La fonction xff:uncovered-aspect ne peut pas êter utilisé avec implicitFiltering=false
ru: Функция xff:uncovered-aspect не может использоваться с implicitFiltering=false

source: Argument 1 {0} is not a concept in the DTS.
fr: L'argument 1 {0} n'est pas un concept dans le DTS.
ru: Аргумент 1 {0} не является концептом в DTS.

source: Argument 1 {0} is not a dimension concept QName.
fr: L'argument 1 {0} n'est pas un concept dimensionnel QName.
ru: Аргумент 1 {0} не является QName измерением концепта.

source: Argument 1 {0} is not in the DTS.
ru: Аргумент 1 {0} отсутствует в DTS.

source: Argument 1 {0} is not a dimension.
ru: Аргумент 1 {0} не является измерением.

source: Argument 2 {0} is not in the DTS.
ru: Аргумент 2 {0} отсутствует в DTS.

source: Argument 2 {0} is not a primary item.
ru: Аргумент 2 {0} не является основным элементом.

source: dimension does not specify an explicit dimension
fr: la dimension ne spécifie pas une dimension explicite
ru: измерение не определено как explicit

source: dimension does not specify a typed dimension
fr: la dimension ne spécifie pas une dimension typée
ru: измерение не определено как typed

source: Exception: FORG0001, invalid constructor
fr: Exception: FORG0001, constructeur non valide
ru: Исключение: FORG0001, недопустимый конструктор

source: Exception: FONS0004, no namespace found for prefix
fr: Exception: FONS0004, aucun espace de nommage ne correspond au préfixe
ru: Исключение: FONS0004, не найдено пространства имен для префикса

source: xs function not available
fr: fonctin xs non disponible
ru: функция xs недоступна

source: invalid cast from {0} to xs:{1}{2}
ru: недопустимое преобразование типа из {0} в xs: {1} {2}

source: Afrikaans (South Africa)
ru: Африкаанс (Южная Африка)

source: Albanian (Albania)
ru: Албанский (Албания)

source: Arabic (Algeria)
ru: Арабский (Алжир)

source: Arabic (Bahrain)
ru: Арабский (Бахрейн)

source: Arabic (Egypt)
ru: Арабский (Египет)

source: Arabic (Iraq)
ru: Арабский (Ирак)

source: Arabic (Jordan)
ru: Арабский (Иордания)

source: Arabic (Kuwait)
ru: Арабский (Кувейт)

source: Arabic (Lebanon)
ru: Арабский (Ливан)

source: Arabic (Libya)
ru: Арабский (Ливия)

source: Arabic (Morocco)
ru: Арабский (Марокко)

source: Arabic (Oman)
ru: Арабский (Оман)

source: Arabic (Qatar)
ru: Арабский (Катар)

source: Arabic (Saudi Arabia)
ru: Арабский (Саудовская Аравия)

source: Arabic (Syria)
ru: Арабский (Сирия)

source: Arabic (Tunisia)
ru: Арабский (Тунис)

source: Arabic (U.A.E.)
ru: Арабский (О.А.Э.)

source: Arabic (Yemen)
ru: Арабский (Йемен)

source: Basque (Spain)
ru: Баскей (Испания)

source: Bulgarian (Bulgaria)
ru: Болгарский (Болгария)

source: Belarusian (Belarus)
ru: Белорусский (Беларусь)

source: Catalan (Spain)
ru: Каталанский (Испания)

source: Chinese (PRC)
ru: Китайский (КНР)

source: Chinese (Taiwan)
ru: Китайский (Тайвань)

source: Chinese (Singapore)
ru: Китайский (Сингапур)

source: Croatian (Croatia)
ru: Хорватский (Хорватия)

source: Czech (Czech Republic)
ru: Чехия (Чехия)

source: Danish (Denmark)
ru: Датский (Дания)

source: Dutch (Belgium)
ru: Голландский (Бельгия)

source: Dutch (Netherlands)
ru: Голландский (Нидерланды)

source: English (Australia)
ru: Английский (Австралия)

source: English (Belize)
ru: Английский (Белиз)

source: English (Canada)
ru: Английский (Канада)

source: English (Caribbean)
ru: Английский (Карибский)

source: English (Ireland)
ru: Английский (Ирландия)

source: English (Jamaica)
ru: Английский (Ямайка)

source: English (New Zealand)
ru: Английский (Новая Зеландия)

source: English (South Africa)
ru: Английский (Южная Африка)

source: English (Trinidad)
ru: Английский (Тринидад)

source: English (United States)
ru: Английский Соединенные Штаты)

source: English (United Kingdom)
ru: Английский (Великобритания)

source: Estonian (Estonia)
ru: Эстонский (Эстония)

source: Faeroese (Faroe Islands)
ru: Фарерские острова (Фарерские острова)

source: Farsi (Iran)
ru: Фарси (Иран)

source: Finnish (Finland)
ru: Финский (Финляндия)

source: French (Belgium)
ru: Французский (Бельгия)

source: French (Canada)
ru: Французский (Канада)

source: French (France)
ru: Французский (Франция)

source: French (Luxembourg)
ru: Французский (Люксембург)

source: French (Switzerland)
ru: Французский (Швейцария)

source: German (Austria)
ru: Немецкий (Австрия)

source: German (Germany)
ru: Немецкий (Германия)

source: German (Luxembourg)
ru: Немецкий (Люксембург)

source: German (Switzerland)
ru: Немецкий (Швейцария)

source: Greek (Greece)
ru: Греческий (Греция)

source: Hebrew (Israel)
ru: Иврит (Израиль)

source: Hindi (India)
ru: Хинди (Индия)

source: Hungarian (Hungary)
ru: Венгерский (Венгрия)

source: Icelandic (Iceland)
ru: Исландский (Исландия)

source: Indonesian (Indonesia)
ru: Индонезийский (Индонезия)

source: Italian (Italy)
ru: Итальянский (Италия)

source: Italian (Switzerland)
ru: Итальянский (Швейцария)

source: Japanese (Japan)
ru: Японский (Япония)

source: Korean (Korea)
ru: Корейский (Корея)

source: Latvian (Latvia)
ru: Латвийский (Латвия)

source: Lithuanian (Lituania)
ru: Литовский (Литва)

source: Malaysian (Malaysia)
ru: Малайзия (Малайзия)

source: Maltese (Malta)
ru: Мальтийский (Мальта)

source: Norwegian (Bokmal)
ru: Норвежский (Бокмал)

source: Norwegian (Nynorsk)
ru: Норвежский (Нюнорск)

source: Persian (Iran)
ru: Персидский (Иран)

source: Polish (Poland)
ru: Польский (Польша)

source: Portuguese (Brazil)
ru: Португальский (Бразилия)

source: Portuguese (Portugal)
ru: Португальский (Португалия)

source: Romanian (Romania)
ru: Румынский (Румыния)

source: Russian (Russia)
ru: Русский (Россия)

source: Serbian (Cyrillic)
ru: Сербский (кириллица)

source: Serbian (Latin)
ru: Сербский (латинский)

source: Slovak (Slovakia)
ru: Словацкий (Словакия)

source: Slovenian (Slovania)
ru: Словенский (Словакия)

source: Spanish (Argentina)
ru: Испанский (Аргентина)

source: Spanish (Bolivia)
ru: Испанский (Боливия)

source: Spanish (Colombia)
ru: Испанский (Колумбия)

source: Spanish (Chile)
ru: Испанский (Чили)

source: Spanish (Costa Rica)
ru: Испанский (Коста-Рика)

source: Spanish (Dominican Republic)
ru: Испанский (Доминиканская Республика)

source: Spanish (Ecuador)
ru: Испанский (Эквадор)

source: Spanish (El Salvador)
ru: Испанский (Сальвадор)

source: Spanish (Guatemala)
ru: Испанский (Гватемала)

source: Spanish (Honduras)
ru: Испанский (Гондурас)

source: Spanish (Mexico)
ru: Испанский (Мексика)

source: Spanish (Nicaragua)
ru: Испанский (Никарагуа)

source: Spanish (Panama)
ru: Испанский (Панама)

source: Spanish (Paraguay)
ru: Испанский (Парагвай)

source: Spanish (Peru)
ru: Испанский (Перу)

source: Spanish (Puerto Rico)
ru: Испанский (Пуэрто-Рико)

source: Spanish (Spain)
ru: Испанский (Испания)

source: Spanish (United States)
ru: Испанский (США)

source: Spanish (Uruguay)
ru: Испанский (Уругвай)

source: Spanish (Venezuela)
ru: Испанский (Венесуэла)

source: Swedish (Sweden)
ru: Шведский (Швеция)

source: Swedish (Finland)
ru: Шведский (Финляндия)

source: Thai (Thailand)
ru: Тайский (Таиланд)

source: Turkish (Turkey)
ru: Турецкая (Турция)

source: Ukrainian (Ukraine)
ru: Украинский (Украина)

source: Urdu (Pakistan)
ru: Урду (Пакистан)

source: Vietnamese (Vietnam)
ru: Вьетнамский (Вьетнам)

source: Picture requires a number convertable to decimal or float
ru: Изображение требует число, преобразуемое в десятичное

source: Picture contains multiple picture sepearators {0}
ru: Изображение содержит несколько раздилителей {0}

source: Picture contains multiple percent or per_mille charcters {0}
ru: Изображение содержит несколько процентов или per_mille символов {0}

source: Sub-picture contains decimal point sepearators {0}
ru: Во вложенном изображении содержатся разделители десятичной точки {0}

source: Sub-picture passive character {0} between active characters {1}
ru: Во вложенном изображении пассивные символы {0} между активными символами {1}

source: Sub-picture must contain at least one digit position or sign character {0}
ru: Во вложенном изображении должен быть по крайней мере один символ позиции или символ знака {0}

source: Prohibited file for filings %(blockedIndicator)s: %(url)s
fr: Il est interdit de rapporter %(url)s : %(blockedIndicator)s
ru: Запрещенный файл для отчетов %(blockedIndicator)s: %(url)s

source: blocked
fr: bloqué
ru: заблокирован

source: File can not be loaded: %(fileName)s Loading terminated.
ru: Невозможно загрузить файл: %(fileName)s Загрузка остановлена.

source: File can not be loaded: %(fileName)s
fr: Le fichier %(fileName)s n'a pas pu être chargé
ru: Невозможно загрузить файл: %(fileName)s

source: File can not be loaded, requires loadFromExcel plug-in: %(fileName)s
ru: Файл не может быть загружен, требуется loadFromExcel плагин: %(fileName)s

source: %(error)s, %(fileName)s, line %(line)s, column %(column)s, %(sourceAction)s source element
ru: %(error)s, %(fileName)s, строка %(line)s, колонка %(column)s, %(sourceAction)s исходный элемент

source: %(fileName)s: file error: %(error)s Loading terminated.
ru: %(fileName)s: ошибка файла: %(error)s Загрузка прекращена.

source: %(fileName)s: file error: %(error)s
fr: %(fileName)s erreur de fichier : %(error)s
ru: %(fileName)s: ошибка файла: %(error)s

source: Unrecoverable error: %(error)s, %(fileName)s, %(sourceAction)s source element
ru: Неустранимая ошибка: %(error)s, %(fileName)s, %(sourceAction)s исходный элемент

source: loading {0}
fr: chargement de {0}
ru: загружается {0}

source: Schema file with same targetNamespace %(targetNamespace)s loaded from %(fileName)s and %(otherFileName)s
ru: Файл схемы с тем же targetNamespace %(targetNamespace)s, загруженным из %(fileName)s и %(otherFileName)s

source: SchemaLocation of %(fileName)s expected namespace %(namespace)s found targetNamespace %(targetNamespace)s
ru: SchemaLocation %(fileName)s - ожидаемое пространство имен %(namespace)s. Найдено targetNamespace %(targetNamespace)s

source: Error loading creation software names table %(error)s
ru: Ошибка загрузки имен для создания таблицы %(error)s

source: Discovery of %(fileName)s expected namespace %(namespace)s found targetNamespace %(targetNamespace)s
fr: Dans %(fileName)s, l'espace de nommage attendu est %(namespace)s mais le targetNamespace est %(targetNamespace)s
ru: Открытие %(fileName)s - ожидалось пространства имен %(namespace)s. Найдено targetNamespace %(targetNamespace)s

source: Namespace: %(namespace)s disallowed schemaLocation %(schemaLocation)s
fr: Espace de nommage %(namespace)s : schemaLocation %(schemaLocation)s non autorisée
ru: Пространство имен: %(namespace)s. Запрещена schemaLocation %(schemaLocation)s

source: Prohibited base attribute: %(attribute)s
fr: Attribut de base %(attribute)s interdit
ru: Запрещенный базовый атрибут: %(attribute)s

source: Namespace: %(namespace)s disallowed schemaLocation blocked %(schemaLocation)s
fr: Espace de nommage %(namespace)s : schemaLocation %(schemaLocation)s bloquée
ru: Пространство имен: %(namespace)s - запрещенная schemaLocation заблокирована %(schemaLocation)s

source: Linkbase reference for %(linkbaseRefElement)s href attribute missing or malformed
fr: La référence de base de liens pour %(linkbaseRefElement)s a un attribut href manquant ou mal formé
ru: Ссылочная база %(linkbaseRefElement)s - href атрибут отсутствует или некорректен

source: Locator href attribute "%(href)s" missing or malformed in standard extended link
ru: Href атрибут "%(href)s" отсутствует или неверно сформирован в стандартной расширенной ссылке

source: Locator href attribute "%(href)s" missing or malformed in non-standard extended link
ru: Href атрибут "%(href)s" отсутствует или неверно сформирован в нестандартной расширенной ссылке

source: Linkbase extended link %(element)s missing schema definition
fr: Le lien étendu de base de liens %(element)s devait avoir une définition de schéma
ru: В расширенной ссылке %(element)s отсутствует определение схемы

source: Instance facts missing schema concept definition: %(elements)s
ru: В сведения о фактах отсутствует определение концепта схемы: %(element)s

source: Multiple ix namespaces were found
ru: Было найдено несколько пространств имён ix

source: Reference for roleURI href attribute missing or malformed
ru: Ссылка на roleURI - href атрибут отсутствует или искажен

source: Reference for arcroleURI href attribute missing or malformed
ru: Ссылка на arcroleURI - href атрибут отсутствует или искажен

source: Inline XBRL ix:references attribute %(name)s duplicated in target %(target)s
ru: Inline XBRL ix:references атрибут %(name)s дублируется в %(target)s

source: Inline XBRL ix:references id %(id)s duplicated in inline document set
ru: Inline XBRL ix:references идентификаторы %(id)s дублируются в наборе документов

source: Inline XBRL has multiple ix:references with id in target %(target)s
ru: Inline XBRL имеет несколько ix:references с идентификатором в %(target)s

source: Inline XBRL ix:references prefix %(prefix)s has multiple namespaces %(ns1)s and %(ns2)s in target %(target)s
ru: Inline XBRL ix:references префикс %(prefix)s имеет несколько пространств имен %(ns1)s и %(ns2)s в %(target)s

source: Inline XBRL ix:resources element not found
ru: Элемент Inline XBRL ix:resources не найден

source: Inline XBRL tupleRef %(tupleRef)s not found
fr: tupleRef inline XBRL %(tupleRef)s non trouvé
ru: Inline XBRL tupleRef %(tupleRef)s не найден

source: continuedAt %(continuationAt)s target is an %(targetElement)s element instead of ix:continuation element.
ru: continuedAt в %(continuationAt)s является элементом %(targetElement)s, а не элементом ix:continuation.

source: Inline XBRL continuation %(continuationAt)s not found
ru: Inline XBRL продолжение %(continuationAt)s не найдено

source: Inline XBRL continuation cycle: %(continuationCycle)s
ru: Цикл продолжения Inline XBRL: %(continuationCycle)s

source: Inline XBRL continuation chain element %(ancestorElement)s has descendant element %(descendantElement)s
ru: Элемент Inline XBRL цепи продолжения %(ancestorElement)s имеет подчиненные элементы %(descendantElement)s

source: Instance fact missing schema definition: %(qname)s of Inline Element %(localName)s
ru: Отсутствует определение экземпляра схемы для факта %(qname)s Inline элемента %(localName)s

source: Inline XBRL element %(qname)s base type %(type)s mapped by %(localName)s
ru: Inline XBRL элемент %(qname)s базовый тип %(type)s присоединен к %(localName)s

source: Inline relationship toRef(s) %(toIds)s not found.
ru: Inline отношение toRef (s) %(toIds)s не найдено.

source: Inline relationship references footnote(s) %(toFootnoteIds)s and thereby is not allowed to reference %(toFactQnames)s.
ru: Inline отношение ссылается на сноску %(toFootnoteIds)s и, следовательно, не позволяет ссылаться на %(toFactQnames)s.

source: continuedAt %(continuedAt)s has %(referencesCount)s references on %(sourceElements)s elements, only one reference allowed.
ru: continueAt %(continuedAt)s имеет %(referenceCount)s ссылок на %(sourceElements)s. Только одна ссылка разрешена.

source: ix:continuation %(continuedAt)s is not referenced by a, ix:footnote, ix:nonNumeric or other ix:continuation element.
ru: ix:continuation %(continuedAt)s не ссылается на ix:footnote, ix:nonNumeric или другой элемент ix:continuation.

source: maxOccurs must be positive
ru: maxOccurs должен быть положительным

source: minOccurs must be positive
ru: minOccurs должен быть положительным

source: Invalid formula object %(element)s
fr: Objet de formule non valide : %(element)s
ru: Недопустимый объект формулы %(element)s

source: Concept aspect has multiple rules in formula.
ru: Концепт имеет несколько правил в формуле.

source: Dimension %(dimension)s aspect has multiple rules in formula.
ru: Измерение %(dimension)s имеет несколько правил в формуле.

source: Forever period aspect has multiple rules in formula.
ru: Период - бесконечный имеет несколько правил в формуле.

source: Augment unit attribute has multiple values in formula.
ru: Атрибут единица измерения имеет несколько значений в формуле.

source: Parameter name used on multiple parameters %(name)s
fr: Le nom de paramèter %(name)s est utilisé sur plusieurs paramètres
ru: Имя параметра, используемое для нескольких параметров %(name)s

source: Matched variable sequence includes fact {0} inconsistent in aspect {1}
fr: La séquence des variables correspondantes contient le fait {0}, ce qui est incohérent dans l'aspect {1}
ru: Соответствующая последовательность переменных включает в себя факт {0} несогласованный в аспекте {1}

source: %(dimension)s is not an explicit dimension concept QName.
fr: %(dimension)s n'est pas un QName de dimension explicite.
ru: %(dimension)s не является QName explicit измерением концепта.

source: dimension: not available
ru: измерение: недоступно

source: input {0}
fr: entrée {0}
ru: ввод {0}

source: {0}({1}) as {2}
fr: {0}({1}) en tant que {2}
ru: {0} ({1}) как {2}

source: step {0}
fr: étape {0}
ru: шаг {0}

source: step ${0}: {1}
fr: étape ${0}: {1}
ru: шаг $ {0}: {1}

source: output: {0}
fr: sortie : {0}
ru: вывод: {0}

source: Open file handle is not open: {0}
ru: Открытый дескриптор файла не открыт: {0}

source: [exception] Validation exception: {0} at {1}
fr: [exception] Exception de validation : {0} à {1}
ru: [exception] Исключение проверки: {0} в {1}

source: prohibited arc (priority {0}) has no other arc to prohibit
fr: L'arc interdit (priotrité {à}) n'a pas d'autre arc à restreindre
ru: запрещенный arc (приоритет {0}) не имеет другой arc для запрета

source: prohibited arc (priority {0}, {1} - {2}) has an equivalent prohibited arc (priority {3}, {4} - {5})
fr: L'arc interdit (priorité {0}, {1} - {2}) a un arc interdit équivalent (priorité {3}, {4} - {5})
ru: запрещенный arc (приоритет {0}, {1} - {2}) имеет эквивалентный запрещенный arc (приоритет {3}, {4} - {5})

source: arc (priority {0}, {1} - {2}) is ineffective due to equivalent arc (priority {3}, {4} - {5})
fr: L'arc (priority {0}, {1} - {2}) est sans effet en raison d'un arc équivalent (priority {3}, {4} - {5})
ru: arc (приоритет {0}, {1} - {2}) неэффективен из-за эквивалентного arc (приоритет {3}, {4} - {5})

source: %(element)s set %(xlinkLabel)s Exception: %(error)s
ru: %(element)s набор %(xlinkLabel)s Исключение: %(error)s

source: tested
fr: testé
ru: протестировано

source: not tested
fr: non testé
ru: не протестировано

source: Comparing namespaces
fr: Compare les espaces de nommages
ru: Сравнение пространств имен

source: Comparing roles
fr: Compare les rôles
ru: Сравнение ролей

source: Comparing concepts
fr: Compare les concepts
ru: Сравнение концептов

source: Comparing {0} relationships
fr: Compare {0} relations
ru: Сравнение {0} отношений

source: Comparing dimension defaults
fr: Compare les valeurs par défaut de dimensions
ru: Сравнение значений по умолчанию для измерений

source: Comparing explicit dimensions
fr: Compare les dimensions explicites
ru: Сравнение измерений (explicit dimensions)

source: Checking report file
fr: Vérification du fichier de rapport
ru: Проверка файла отчета

source: Writing report file
fr: Enregistre le fichier rapport
ru: Запись файла отчета

source: C report file
fr: Fichier rapport C
ru: C-файл отчета

source: ready
fr: prêt
ru: готово

source: corresponding relationship {0} toDTS toName="{1}"
fr: Relation correspondante {0} toDTS toName="{1}"
ru: соответствующее отношение {0} toDTS toName = "{1}"

source: toDTS does not have a corresponding relationship at position {0}
fr: toDTS n'a pas de relation correspondante à la position {0}
ru: toDTS не имеет связи в позиции {0}

source: fromDTS does not have a corresponding relationship at position {0}
fr: fromDTS n'a pas de relation correspondante à la position {0}
ru: fromDTS не имеет отношения в позиции {0}

source: typed domain element {0}
fr: élément du domaine type {0}
ru: типизированный элемент домена (typed domain element) {0}

source: typedDomainRef={0} (element qname cannot be determined)
ru: typedDomainRef={0} (qname элемента не может быть определен)

source: from value: {0}
fr: de la valeur {0}
ru: из значения: {0}

source: ({0} does not have an id attribute)
fr: ({0} n'a pas d'attribut 'id')
ru: ({0} не имеет атрибута id)

source: to value: {0}
fr: vers valeur : {0}
ru: в значение: {0}

source: loading
fr: chargement en cours
ru: загрузка

source: xbrl loading finished, {0}...
fr: Chargement XBRL terminé, {0}...
ru: xbrl загрузка завершена, {0}...

source: Create context for %(priItem)s, cannot determine valid context elements, no suitable hypercubes
ru: Создать контекст для %(priItem)s. Нельзя определить корректные элементы контекста, нет подходящих гиперкубов

source: Create context, %(dimension)s, cannot determine context element, either no all relationship or validation issue
ru: Создать контекст, %(dimension)s. Нельзя определить элемент контекста. Нет связи или ошибка в проверке

source: Exception viewing properties {0} {1} at {2}
fr: Exception lors de l'affichage de la propriété {0} {1} à {2}
ru: Исключение при просмотре свойств {0} {1} в {2}

source: %.3f secs
ru: % .3f сек

source: Profile statistics
ru: Статистика профиля

source: %s %.3f secs, %.0fK
ru: %s% .3f сек.,% .0fK

source: %(activity)s %(time)s secs
ru: %(activity)s %(time)s секунд
