Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: Taxonomy schema %(schema)s namespace %(targetNamespace)s must be a valid URL with a valid authority for the namespace.
ru: Схема таксономии %(schema)s пространство имен %(targetNamespace)s должна быть допустимым URL-адресом с допустимым полномочием для пространства имен.

source: Taxonomy schema %(schema)s namespace %(targetNamespace)s missing prefix for the namespace.
ru: В схеме таксономии %(schema)s пространство имен %(targetNamespace)s отсутствует префикс для пространства имен.

source: Taxonomy schema %(schema)s namespace %(targetNamespace)s prefix %(prefix)s must not have an '_'
fr: Dans le schéma de taxonomie %(schema)s, namespace %(targetNamespace)s le préfixe %(prefix)s ne doit pas avoir de caractère '_'
ru: Схема таксономии %(schema)s пространство имен %(targetNamespace)s префикс %(prefix)s не должен иметь '_'

source: Concept %(concept)s is also defined in standard taxonomy schema schema %(standardSchema)s
fr: Le concept %(concept)s est également défin dans le schéma %(standardSchema)s de taxonomie standard
ru: Концепт %(concept)s также определяется в стандартной схеме таксономии %(standardSchema)s

source: Concept %(concept)s is also defined in standard taxonomy schema %(standardSchema)s without a general-special relationship
fr: Le concept %(concept)s est également défin dans le schéma %(standardSchema)s de taxonomie standard, sans relation générale-spécifique
ru: Концепт %(concept)s также определена в стандартной схеме таксономии %(standardSchema)s без обще-специальных связей

source: Concept %(concept)s id %(id)s should be %(requiredId)s
ru: ID концепта %(concept)s %(id)s должен быть %(requiredId)s

source: Taxonomy schema %(schema)s element %(concept)s nillable %(nillable)s should be 'true'
fr: Dans le schéma de taxonomie %(schema)s, l'élément %(concept)s, l'annulable %(nillable)s devrait être "true"
ru: Схема таксономии %(schema)s элемент %(concept)s nillable %(nillable)s должен быть 'true'

source: Concept %(concept)s is a tuple
fr: Concept %(concept)s est un tuple
ru: Концепт %(concept)s является кортежем

source: Concept %(concept)s has typedDomainRef %(typedDomainRef)s
fr: Le concept %(concept)s a typedDomainRef %(typedDomainRef)s
ru: Концепт %(concept)s имеет typedDomainRef %(typedDomainRef)s

source: Taxonomy schema %(schema)s element %(concept)s is abstract but period type is not duration
fr: Dans le schéma de taxonomie %(schema)s, l'élément %(concept)s est asbtrat mais le type de période n'est pas "duration"
ru: Схема таксономии %(schema)s элемент %(concept)s является абстрактом, но тип периода не является duration

source: Concept %(concept)s must end in Axis to be in xbrldt:dimensionItem substitution group
ru: Концепт %(concept)s должен заканчиваться в Axis, чтобы быть в xbrldt:dimensionItem группе подстановки

source: Concept %(concept)s must end in Table to be in xbrldt:hypercubeItem substitution group
ru: Концепт %(concept)s должна заканчиваться в Table, чтобы быть в xbrldt:hypercubeItem группе подстановки

source: Concept %(concept)s has disallowed substitution group %(substitutionGroup)s
fr: Le concept %(concept)s a un groupe de substitution %(substitutionGroup)s désactivé
ru: В концептах %(concept)s запрещены группы подстановки %(substitutionGroup)s

source: Concept %(concept)s is a LineItems but not abstract
fr: Le concept %(concept)s est un LineItems mais n'est pas abstrait
ru: Концепт %(concept)s - это LineItems, но не абстракт

source: Concept %(concept)s must end with Domain or Member for type of domainItemType
fr: Le concept %(concept)s doit se terminer par 'Domain' ou 'Member'pour être de type domainItemType
ru: Концепт %(concept)s должен заканчиваться Domain или Member для типа domainItemType

source: Concept %(concept)s is a domainItemType and must be periodType duration
fr: Le concept %(concept)s est un domainItemType et doit avoir une periodType "duration"
ru: Концепт %(concept)s является domainItemType и должен быть periodType

source: Concept %(concept)s is a fraction
ru: Концепт %(concept)s - это часть

source: Taxonomy schema %(schema)s element %(concept)s is non-numeric but period type is not duration
ru: Схема таксономии %(schema)s элемент %(concept)s не является числовым, но тип периода не является длительностью (duration)

source: Concept %(concept)s name must start with a capital letter
ru: Название концепта %(concept)s должно начинаться с заглавной буквы

source: Concept %(concept)s has disallowed name character
ru: Концепт %(concept)s имеет запрещенный символ в имени

source: Concept %(concept)s name length %(namelength)s exceeds 200 characters
ru: Концепт %(concept)s длина имени %(namelength)s превышает 200 символов

source: Concept %(concept)s should match expected LC3 composition %(lc3name)s
ru: Концепт %(concept)s должен соответствовать ожидаемому объединению LC3 %(lc3name)s

source: Concept %(concept)s should not contain company or period information, found: %(matches)s
ru: Концепт %(concept)s не должен содержать информацию о компании или периоде, найдено: %(matches)s

source: Concept %(concept)s must have a balance because it appears in a statement of income or balance sheet
ru: Концепт %(concept)s должен иметь баланс, поскольку она фигурирует в отчете о прибылях и убытках или балансе

source: Concept %(concept)s is monetary without a balance and must have a documentation label that disambiguates its sign
ru: Концепт %(concept)s является денежным без баланса и должен иметь метку документации, которая устраняет неоднозначность знака

source: Concept %(concept)s of type xbrli:dateItemType must have periodType duration
ru: Концепт %(concept)s типа xbrli:dateItemType должен иметь длительность periodType

source: Concept %(concept)s of type xbrli:stringItemType must have periodType duration
ru: Концепт %(concept)s типа xbrli:stringItemType должен иметь длительность periodType

source: Concept %(concept)s is an abstract tuple
fr: Le concept %(concept) est un tuple abstrait
ru: Концепт %(concept)s является абстрактным кортежем

source: Tuple %(concept)s has a tuple cycle
ru: Кортеж %(concept)s имеет цикл

source: Tuple %(concept)s must have nillable='false'
ru: Кортеж %(concept)s должен иметь nillable='false'

source: Abstract root concept %(concept)s must have nillable='false'
fr: Le concept racine abstrait %(concept)s foir avoir nillable='false'
ru: Абстрактный корневой концепт %(concept)s должен иметь nillable='false'

source: Abstract root concept %(concept)s must have type='xbrli:stringItemType'
fr: Le concept racine abstrait %(concept)s doit avoir type='xbrli:stringItemType'
ru: Абстрактный корневой концепт %(concept)s должен иметь type='xbrli: stringItemType'

source: Abstract concept %(concept)s must not have a balance attribute
fr: Le concept abstrait %(concept)s ne doit pas d'avoir d'attribut "balance"
ru: Абстрактный концепт %(concept)s не должна иметь атрибут баланса

source: Concept %(concept)s must have a documentation label or reference
fr: Le concept %(concept)s doit avoir un libellé documentation ou un référence
ru: Концепт %(concept)s должен иметь метку документации или ссылку

source: Non-monetary concept %(concept)s must not have a balance attribute
fr: Concept non monétaire %(concept)s doit avoir un attribut balance
ru: Неденежный концепт %(concept)s не должна иметь атрибут баланса

source: Link:part concept %(concept)s is not allowed
ru: Link:part концепта %(concept)s не допускается

source: Link part definition %(concept)s must have a generic label in language 'nl'
fr: La définition de partie de concept %(concept)s doit avoir un libellé générique en langue 'nl'
ru: Определение части ссылок %(concept)s должно иметь общую метку в языке 'nl'

source: Taxonomy schema %(schema)s contains an embedded linkbase
fr: Le schéma de taxonomie %(schema)s contient une base de liens embaquée
ru: Схема таксономии %(схема)s содержит встроенную ссылочную базу (embedded linkbase)

source: RoleType %(roleType)s does not match authority %(targetNamespaceAuthority)s
fr: RoleType %(roleType)s ne correspond pas à l'autorité %(targetNamespaceAuthority)s
ru: RoleType %(roleType)s не соответствует полномочию %(targetNamespaceAuthority)s

source: RoleType %(roleType)s missing used on %(usedOn)s
fr: Le type de rôle %(roleType)s doit avoir usedOn %(usedOn)s
ru: RoleType %(roleType)s отсутствует на %(usedOn)s

source: RoleType %(roleType)s definition "%(definition)s" must match {Sortcode} - {Type} - {Title}
fr: RoleType %(roleType)s définition "%(definition)s" doit correspondre à {Sortcode} - {Type} - {Title}
ru: Определение RoleType %(roleType)s "%(definition)s" должно соответствовать {Sortcode} - {Type} - {Title}

source: RoleType %(roleuri)s is defined using role types already defined by standard roles for: %(qnames)s
ru: RoleType %(roleuri)s определяется с использованием типов ролей, уже определенных стандартными ролями для: %(qnames)s

source: Link RoleType %(roleType)s missing a generic standard label
fr: Il manque un libellé standard générique pour le type de rôle de lien %(roleType)s
ru: Связь RoleType %(roleType)s: отсутствует стандартная метка (generic standard label)

source: Link RoleType %(roleType)s definition does not match NL standard generic label, definition: %(definition)s NL label: %(label)s
ru: Определение связи RoleType %(roleType)s не соответствует стандартной метке NL, определение: %(definition)s Метка NL: %(label)s

source: Link RoleType %(roleType)s definition has leading or trailing spaces: "%(definition)s"
ru: Определение роли RoleType %(roleType)s имеет начальные или конечные пробелы: "%(definition)s"

source: ArcroleType %(arcroleType)s does not match authority %(targetNamespaceAuthority)s
fr: L'ArcroleType %(arcroleType)s ne correspond à aucune autorité %(targetNamespaceAuthority)s
ru: ArcroleType %(arcroleType)s не соответствует полномочию %(targetNamespaceAuthority)s

source: ArcroleType %(arcroleType)s should end with /arcrole/{LC3name}
fr: L'ArcroleType %(arcroleType)s devrait se terminer par /arcrole/{LC3name}
ru: ArcroleType %(arcroleType)s должен заканчиваться на /arcrole/{LC3name}

source: ArcroleType %(arcroleType)s definition must be non-empty
fr: La définition de l'ArcroleType %(arcroleType)s ne peut pas être vide
ru: Определение ArcroleType %(arcroleType)s должно быть непустым

source: ArcroleType %(arcroleuri)s is defined using role types already defined by standard arcroles for: %(qnames)s
ru: ArcroleType %(arcroleuri)s определяется с использованием типов ролей, уже определенных стандартными arcroles для: %(qnames)s

source: Arcrole type definition is not allowed: %(arcroleURI)s
fr: La définition de l'ArcroleType n'est pas autorisé : %(roleURI)s
ru: Определение типа Arcrole не допускается: %(arcroleURI)s

source: Appinfo contains disallowed non-link element %(element)s
ru: Appinfo содержит запрещенный элемент без ссылки %(element)s

source: ComplexType contains disallowed xs:choice element
ru: ComplexType содержит запрещенный элемент xs:choice

source: ComplexContent is disallowed
ru: ComplexContent запрещен

source: Type name attribute must be lower camelcase: %(name)s.
ru: Атрибут типа имени должен быть в нижнем регистре: %(name)s.

source: Enumeration element has value(s) without generic label.
ru: Элемент перечисления имеет значения без общей метки (generic label).

source: link parts
ru: части ссылок

source: abstract items
fr: Éléments abstraits
ru: абстрактные элементы

source: nonabstract items
fr: item non abstrait
ru: неабстрактные элементы

source: tuples
ru: кортежи

source: types
ru: типы

source: enumerations
fr: énumérations
ru: перечисления

source: dimensions
ru: измерения

source: domains
fr: domaines
ru: домены

source: hypercubes
ru: гиперкубы

source: Taxonomy schema may only define one of these: %(contents)s
ru: Схема таксономии может определять только один из: %(contents)s

source: Taxonomy schema must be a DTS entrypoint OR define linkroles OR arcroles OR link:parts OR context fragments OR abstract items OR tuples OR non-abstract elements OR types OR enumerations OR dimensions OR domains OR hypercubes
fr: Le schéma de taxonomie doit être un point d'entrée DTS OU BIEN définir des linkroles OU des arcroles OU des link:parts OU des fragments de contexte OU des items abstrait OU des tuples OU des éléments non-abstraits OU des types OU des énumérations OU des dimensions OU des domaines OU des hypercubes
ru: Схема таксономии должна быть точкой входа DTS ИЛИ определять linkroles ИЛИ arcroles ИЛИ link:parts ИЛИ контекстные фрагменты ИЛИ абстрактные элементы ИЛИ кортежи ИЛИ не абстрактные элементы ИЛИ типы ИЛИ перечисления ИЛИ измерения ИЛИ домены ИЛИ гиперкубы

source: A schema that defines concepts MUST have a linked 2.1 label linkbase
ru: Схема, которая определяет концепты, ДОЛЖНА иметь связанную ссылочную базу меток 2.1

source: A schema that defines non-abstract items MUST have a linked (2.1) reference linkbase AND/OR a label linkbase with @xlink:role=documentation
fr: Un schéma qui définit des items non-abstraits DOIT avoir une base de liens liée (2.1) ER/OU une base de liens de libellés avec @xlink:role=documentation
ru: Схема, которая определяет не абстрактные элементы, ДОЛЖНА иметь связанную (2.1) ссылочную базу И/ИЛИ ссылочную базу меток @xlink:role=documentation

source: Schema file name warning: %(filename)s, should match %(expectedFilename)s
ru: Предупреждение о имени файла схемы: %(fileName)s должно соответствовать %(expectedFilename)s

source: Invalid schema file base name part (date) in "{base}-{yyyymmdd}.xsd": %(filename)s
ru: Недопустимая часть имени файла базы данных схемы (дата) в "{base}-{yyyymmdd}.xsd": %(filename)s

source: Invalid schema file name, must match "{base}-{yyyymmdd}.xsd": %(filename)s
ru: Недопустимое имя файла схемы, должно соответствовать "{base}-{yyyymmdd}.xsd": %(filename)s

source: Invalid linkbase file name: %(filename)s, has no extended link element, cannot determine link type.
ru: Недопустимое имя файла базы ссылок: %(fileName)s, не имеет расширенного элемента ссылки, не может определить тип ссылки.

source: Invalid linkbase link element %(linkElement)s in %(filename)s
ru: Недопустимый элемент ссылки в базе ссылок %(linkElement)s в %(fileName)s

source: Linkbase name warning: %(filename)s should match %(expectedFilename)s
ru: Предупреждение о названии ссылочной базы: %(fileName)s должно соответствовать %(expectedFilename)s

source: Invalid linkbase base file name part (date) in "{base}-{yyyymmdd}_{suffix}.xml": %(filename)s
ru: Недопустимая часть (дата) имени файла базы ссылок в "{base}-{yyyymmdd}_{suffix}.xml": %(filename)s

source: Invalid linkbase name, must match "{base}-{yyyymmdd}%(expectedSuffix)s.xml": %(filename)s
ru: Недопустимое имя базы ссылок. Должно соответствовать "{base}-{yyyymmdd}%(expectedSuffix)s.xml": %(filename)s

source: Label of non-numeric concept %(concept)s has a numeric role: %(role)s
ru: Метка нечислового концепцта %(concept)s имеет числовую роль: %(role)s

source: All hypercube %(hypercube)s in DRS role %(linkrole)s, does not have closed='true'
fr: L'hypercube 'All' %(hypercube)s du rôle DRS %(linkrole)s n'a pas l'attribut closed='true'
ru: Все гиперкубы %(hypercube)s в роли DRS %(linkrole)s не имеют closed='true'

source: Not all hypercube %(hypercube)s in DRS role %(linkrole)s, does not have closed='false'
fr: Hypercube "not all" %(hypercube)s dans le rôle DRS %(linkrole)s n'a pas closed="false"
ru: Не все гиперкубы %(hypercube)s в роли DRS %(linkrole)s не имеют closed='false'

source: Not all hypercube %(hypercube)s in DRS role %(linkrole)s, is also the target of a positive hypercube
fr: Hypercube "not all" %(hypercube)s dans le rôle DRS %(linkrole)s est aussi la cible d'un hypercube positif
ru: Не все гиперкубы %(hypercube)s в роли DRS %(linkrole)s также ссылаются на положительный гиперкуб

source: Table %(hypercube)s in DRS role %(linkrole)s, missing targetrole consecutive relationship
fr: Table %(hypercube)s dans le rôle DRS %(linkrole)s, il manque une relation targetRole consécutive
ru: В таблица %(hypercube)s в роли DRS %(linkrole)s отсутствует последовательные связи targetrole

source: Hypercube %(hypercube)s in DRS role %(linkrole)s, missing targetrole to dimension %(dimension)s consecutive relationship
fr: L'hypercube %(hypercube)s dans les rôles DRS %(linkrole)s devrait avoir un rôle cible vers la dimension %(dimension)s de relation consécutive
ru: В гиперкубе %(hypercube)s в роли DRS %(linkrole)s, отсутствует targetrole к измерению %(dimension)s последовательной связи

source: Typed dimension %(dimension)s in DRS role %(linkrole)s, has targetrole consecutive relationship
fr: La dimension typée %(dimension)s du rôle DRS %(linkrole)s a une relation targetrole consécutive
ru: Типизированное измерение %(dimension)s в роли DRS %(linkrole)s имеет последовательную targetrole связь

source: Negative table axis %(dimension)s in DRS role %(linkrole)s, not in any positive table in same role
ru: Отрицательная ось таблицы %(dimension)s в роли DRS %(linkrole)s не в положительной таблице той же роли

source: Axis %(dimension)s in DRS role %(linkrole)s, missing targetrole consecutive relationship
fr: Axe %(dimension)s dans le rôle du DRS %(linkrole)s, il manque une relation targetrole consécutive
ru: В оси %(dimension)s в роли DRS %(linkrole)s отсутствует последовательная targetrole связь

source: Dimension relationships have an undirected cycle in DRS role %(linkrole)s starting from table %(hypercube)s, axis %(dimension)s, path %(path)s
fr: Les relations de dimension présentent un cycle non orienté dans le rôle DRS %(linkrole)s débutant de l'hypercube %(hypercube)s, dimension %(dimension)s, chemin %(path)s
ru: Отображение измерений имеет неориентированный цикл в роли DRS %(linkrole)s начиная с таблицы %(hypercube)s, ось %(dimension)s, путь %(path)s

source: Multiple tables (%(hypercubeCount)s) DRS role %(linkrole)s, source %(concept)s, only 1 allowed
fr: Plusieurs (%(hypercubeCount)s) tables du rôle DRS %(linkrole)s, source %(concept)s, seulement une autorisée
ru: Несколько таблиц (%(hypercubeCount)s) DRS роль %(linkrole)s, источник %(concept)s, только 1 разрешено

source: Domain-member primary-item relationships have an undirected cycle in DRS role %(linkrole)s starting from %(conceptFrom)s, path %(path)s
fr: Les relations membre de domaine - item primaire présentent un cycle non orienté dans le rôle DRS %(linkrole)s débutant de %(conceptFrom)s chemin %(path)s
ru: Связи domain-member primary-item включают неориентированный цикл в роли DRS %(linkrole)s начиная с %(conceptFrom)s, путь %(path)s

source: Domain member %(concept)s in DRS role %(linkrole)s, missing targetrole consecutive relationship
fr: Le membre de domaine %(concept)s dans le rôle %(linkrole)s, il manque une relation targetrole
ru: В элементе домена %(concept)s в роли DRS %(linkrole)s, отсутствует последовательная targetrole связь

source: hypercube %(hypercube)s in segment not allowed, ELR role %(linkrole)s
fr: L'hypercube %(hypercube)s dans le segment n'est pas autorisé, rôle de lien étendu %(linkrole)s
ru: гиперкуб %(hypercube)s в сегменте не разрешен, роль ELR %(linkrole)s

source: Notall from primary item %(primaryItem)s in ELR role %(linkrole)s to %(hypercube)s
fr: Notall de l'item primaire %(primaryItem)s dans l'ELR %(linkrole)s vers %(hypercube)s
ru: Notall от основной единицы %(primaryItem)s в роли ELR %(linkrole)s %(hypercube)s

source: ELR role %(linkrole)s, has hypercube %(hypercube)s and a %(arcrole)s relationship not involving the hypercube or primary domain, from %(fromConcept)s to %(toConcept)s
ru: Роль ELR %(linkrole)s имеет гиперкуб %(hypercube)s и отображение %(arcrole)s не связанное с гиперкубом или основным доменом от %(fromConcept)s до %(toConcept)s

source: Dimension %(dimension)s in DRS role %(linkrole)s, has usable domain with members %(domain)s
ru: Измерение %(dimension)s в роли DRS %(linkrole)s имеет подходящий домен с элементами %(domain)s

source: Dimension %(dimension)s in DRS role %(linkrole)s, has nonAbsract domain %(domain)s
fr: La dimension %(dimension)s dans le rôle DRS %(linkrole)s a un domaine %(domain)s non abstrait
ru: Измерение %(dimension)s в роли DRS %(linkrole)s имеет nonAbsract домен %(domain)s

source: Domain item %(domain)s in DRS role %(linkrole)s, in dimension %(dimension)s is not a domainItem
fr: L'élément de domaine %(domain)s dans le rôle DRS %(linkrole)s dans la dimension %(dimension)s n'est pas un domainItem
ru: Элемент домена %(domain)s в роли DRS %(linkrole)s в измерении %(dimension)s не является domainItem

source: Dimension %(dimension)s in DRS role %(linkrole)s, missing targetrole to consecutive domain relationship
fr: Dimension %(dimension)s dans le rôle du DRS %(linkrole)s, il manque une relation targetrole vers la relation dimaine consécutive
ru: В измерении %(dimension)s в роли DRS %(linkrole)s отсутствует targetrole для последовательной связи домена

source: Linkrole %(linkrole)s, has multiple domains %(domains)s
fr: Le rôle de liens %(linkrole)s a plusieurs domaines %(domains)s
ru: Linkrole %(linkrole)s имеет несколько доменов %(domain)s

source: Dimension %(dimension)s usable members same in linkroles %(linkroles)s
ru: Измерение %(dimension)s. Используемые элементы одинаковы в linkroles %(linkroles)s

source: Domain member %(member)s in DRS role %(linkrole)s, has nested members
fr: Le membre de domaine %(member)s dans le rôle DRS %(linkrole)s, a des membres imbriqués
ru: Элемент домена %(member)s в роли DRS %(linkrole)s имеет вложенные элементы

source: Domain member item %(member)s in DRS role %(linkrole)s is not a domainMemberItem
fr: Le membre de domaine %(member)s dans le rôle DRS %(linkrole)s n'est pas un domainMemberItem
ru: Элемент домена %(member)s в роли DRS %(linkrole)s не является domainMemberItem

source: Domain item %(domain)s in DRS role %(linkrole)s is not a domainItem
fr: L'élément de domaine %(domain)s dans le rôle DRS %(linkrole)s n'est pas un domainItem
ru: Элемент домена %(domain)s в роли DRS %(linkrole)s не является идентификатором домена domainItem

source: Abstract domain item %(domain)s in DRS role %(linkrole)s is not a primaryDomainItem
fr: L'élément de domaine %(domain)s dans le rôle DRS %(linkrole)s n'est pas un domainItem primaire
ru: Абстрактный элемент домена %(domain)s в роли DRS %(linkrole)s не является primaryDomainItem

source: Hypercube %(hypercube)s has same dimensions in ELR roles %(linkrole)s and %(linkrole2)s: %(dimensions)s
ru: Гиперкуб %(hypercube)s имеет одинаковые измерения в ролях ELR %(linkrole)s и %(linkrole2)s: %(dimensions)s

source: Primary items for hypercube %(hypercube)s ELR %(ELR)s, have non-unique (inheritance) member %(concept)s in DRS role %(linkrole)s
fr: Les items primaires pour l'hypercube %(hypercube)s ELR %(ELR)s ont un membre non-uniques (hérité) %(concept)s dans DRS rôle %(linkrole)s
ru: Главные элементы для гиперкуба %(hypercube)s с ELR %(ELR)s, имеют не уникальный (inheritance) элемент %(concept)s в роли DRS %(linkrole)s

source: Primary item %(concept)s in DRS role %(linkrole)s for hypercube %(hypercube)s, has parent %(concept2)s which is not a primaryDomainItem
fr: L'item primaire %(concept)s dans le rôle DRS %(linkrole)s pour l'hypercube %(hypercube)s, a un parent %(concept2)s qui n'est pas un primaryDomainItem
ru: Главный элемент %(concept)s в роли DRS %(linkrole)s для гиперкуба %(hypercube)s имеет родительский %(concept2)s, который не является primaryDomainItem

source: Disallowed entity code %(text)s in file %(file)s line %(line)s column %(column)s
fr: Entité '%(text)s' non autorisée dans le fichier %(file) ligne %(line)s colonne %(column)s
ru: Недопустимый код сущности %(text)s в файле %(file)s строка %(line)s столбец %(column)s

source: Disallowed character '%(text)s' (%(unicodeIndex)s) in file %(file)s at line %(line)s col %(column)s
ru: Недопустимый символ '%(text)s' (%(unicodeIndex)s) в файле %(file)s в строке %(line)s колонке %(column)s
