Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: DTS of %(entryFile)s has %(numberOfFiles)s files packaged into %(packageOutputFile)s
fr: Le DTS de %(entryFile)s a %(numberOfFiles)s fichiers packagés dans %(packageOutputFile)s
ru: DTS %(entryFile)s включает %(numberOfFiles)s файлов, упакованных в %(packageOutputFile)s

source: Package catalog syntax error %(error)s
ru: Синтаксическая ошибка каталога пакета %(error)s

source: Multi-lingual element %(element)s has no in-scope xml:lang attribute
ru: Многоязычный элемент %(element)s не имеет атрибута xml:lang

source: Multi-lingual element %(element)s has multiple (%(count)s) in-scope xml:lang %(lang)s elements
ru: Многоязычный элемент %(element)s имеет несколько (%(count)s) элементов в области xml:lang: %(lang)s

source: Package catalog duplicate rewrite start string %(rewriteStartString)s
ru: Стартовая строка перезаписи дубликата каталога пакета %(rewriteStartString)s

source: Skipping multiple-document entry point (not supported) %(href)s
ru: Пропуск точки входа нескольких документов (не поддерживается) %(href)s

source: Taxonomy package contains %(count)s top level directories: %(topLevelDirectories)s
ru: Пакет таксономии содержит каталоги верхнего уровня %(count)s: %(topLevelDirectories)s

source: Taxonomy package does not contain a subdirectory META-INF
ru: Пакет таксономии не содержит подкаталога META-INF

source: Taxonomy package does not contain a metadata file */META-INF/taxonomyPackage.xml
ru: Пакет таксономии не содержит файл метаданных */META-INF/taxonomyPackage.xml

source: Taxonomy package contained no metadata file: {0}.
ru: Пакет таксономии не содержит файла метаданных: {0}.

source: Taxonomy package is not a zip file.
ru: Пакет таксономии не является zip-файлом.

source: File must be a taxonomy package (zip file), catalog file, or manifest (): {0}.
ru: Файл должен быть пакетом таксономии (zip-файл), файлом каталога или манифестом (): {0}.

source: Packages overlap the same rewrite start string %(rewriteStartString)s
ru: Пакеты перекрывают одну и ту же начальную строку перезаписи %(rewriteStartString)s

source: Packages overlap rewrite start strings %(rewriteStartString)s and %(rewriteStartString2)s
ru: Пакеты перекрывают перезапись стартовых строк %(rewriteStartString)s и %(rewriteStartString2)s

source: Exception at plug-in method modulesWihtNewerFileDates: {error}
ru: Исключение в методе плагина modulesWihtNewerFileDates: {error}

source: Exception obtaining plug-in module info: {error} {traceback}
ru: Исключение при получении информации о плагине: {error} {traceback}

source: Exception loading plug-in {name}: processing ModelObjectFactory.ElementSubstitutionClasses
ru: Исключение загрузки плагина {name}: обработка ModelObjectFactory.ElementSubstitutionClasses

source: Exception loading plug-in {name}: {error} {traceback}
ru: Исключение при загрузке плагина {name}: {error} {traceback}

source: Exception finding plug-in {name}: {error}
ru: Исключение при поиске плагина {name}: {error}

source: compiling rendering tables
ru: компиляция рендеринга таблиц

source: Table %(xlinkLabel)s, aspect model %(aspectModel)s not recognized
ru: Таблица %(xlinkLabel)s, аспектная модель %(aspectModel)s не распознана

source: Table %(xlinkLabel)s does not include the concept aspect as one of its participating aspects
ru: Таблица %(xlinkLabel)s не включает аспект концепта в качестве одного из его участвующих аспектов

source: Table %(xlinkLabel)s has parameter name clash for variable %(name)s
ru: Таблица %(xlinkLabel)s имеет имя параметра конфликтующее с переменной %(name)s

source: %(definitionNode)s %(xlinkLabel)s, aspect model %(aspectModel)s, aspect %(aspect)s not allowed
ru: %(DefinitionNode)s %(xlinkLabel)s, аспектная модель %(aspectModel)s, аспект %(aspect)s не разрешен

source: %(definitionNode)s %(xlinkLabel)s, aspect %(aspect)s defined on axes of disposition %(axisDisposition)s and %(axisDisposition2)s
ru: %(DefinitionNode)s %(xlinkLabel)s, аспект %(aspect)s, определенный по осям размещения %(axisDisposition)s и %(axisDisposition2)s

source: Merged %(definitionNode)s %(xlinkLabel)s has tagged rule set(s)
ru: Объединенный %(definitionNode)s %(xlinkLabel)s имеет тегированный набор правил

source: Merged %(definitionNode)s %(xlinkLabel)s has label(s)
ru: Объединенный %(definitionNode)s %(xlinkLabel)s имеет метки

source: Merged %(definitionNode)s %(xlinkLabel)s is not abstract
ru: Объединенный %(definitionNode)s %(xlinkLabel)s не является абстрактным

source: %(definitionNode)s %(xlinkLabel)s duplicate rule set tags %(tag)s
ru: %(DefinitionNode)s %(xlinkLabel)s дублирует теги набора правил %(tag)s

source: %(definitionNode)s %(xlinkLabel)s constraint set mismatches between %(tag1)s and %(tag2)s in constraints %(aspects)s
ru: %(DefinitionNode)s %(xlinkLabel)s задает несоответствие между %(tag1)s и %(tag2)s в ограничениях %(aspects)s

source: DimensionRelationship axis %(xlinkLabel)s can't be used in non-dimensional aspect model
ru: DimensionRelationship ось %(xlinkLabel)s не может использоваться в модели безразмерного (non-dimensional) аспекта

source: Aspect node %(xlinkLabel)s dimensional aspect %(dimension)s is not a dimension
ru: Узел аспекта %(xlinkLabel)s, размерный (dimensional) аспект %(dimension)s не является измерением

source: %(definitionNode)s %(xlinkLabel)s does not define an aspect
ru: %(DefinitionNode)s %(xlinkLabel)s не определяет аспект

source: Abstract %(definitionNode)s %(xlinkLabel)s has no children
ru: Абстракт %(definitionNode)s %(xlinkLabel)s не имеет подчиненных элементов

source: %(definitionNode)s %(xlinkLabel)s does not define an aspect for %(aspect)s
ru: %(DefinitionNode)s %(xlinkLabel)s не определяет аспект для %(аспект)s

source: [{0}] exception {1}
ru: [{0}] исключение {1}

source: no table relationships for {0}
fr: pas de relation table pour {0}
ru: нет табличных связей для {0}

source: Closed definition node %(xlinkLabel)s does not contribute at least one structural node
ru: Закрытый узел определения %(xlinkLabel)s не входит в, по меньшей мере, один структурный узел

source: Concept relationship rule node %(xlinkLabel)s source %(source)s does not refer to an existing concept.
ru: Концепт отношения правил узла %(xlinkLabel)s, источник %(source)s не относится к существующему концепту.

source: Dimension relationship rule node %(xlinkLabel)s dimension %(dimension)s does not refer to an existing explicit dimension.
ru: Узел правила отношения измерений %(xlinkLabel)s, измерение %(dimension)s не ссылается на существующее explicit измерение.

source: Dimension relationship rule node %(xlinkLabel)s source %(source)s does not refer to an existing domain member.
ru: Узел правила отношения исмерений %(xlinkLabel)s, источник %(source)s не относится к существующему элементу домена (domain member).

source: Relationship rule node %(xlinkLabel)s formulaAxis %(axis)s implies a single generation tree walk but generations %(generations)s is greater than one.
ru: Узел правила отношения %(xlinkLabel)s. formulaAxis %(axis)s подразумевает одно дерево отношений, но их больше (%(generations)s).

source: Filter node %(xlinkLabel)s facts partitions: %(factsPartitions)s
ru: Узел фильтра %(xlinkLabel)s: разделы фактов:%(factsPartitions)s

source: Rule node %(xlinkLabel)s specifies concept %(concept)s does not refer to an existing primary item concept.
ru: Узел правила %(xlinkLabel)s указывает на концепт %(concept)s, который не относится к существующему концепту основного элемента (item).

source: Rule node %(xlinkLabel)s specifies dimension %(concept)s does not refer to an existing dimension concept.
ru: Узел правила %(xlinkLabel)s определяет измерение %(concept)s и не относится к существующему концепту измерения.

source: Rule node %(xlinkLabel)s specifies domain member %(concept)s does not refer to an existing domain member concept.
ru: Узел правила %(xlinkLabel)s определяет член домена %(concept)s, который не относится к существующему концепту члена домена.

source: Exception in resolution of definition node %(node)s: %(error)s
ru: Исключение в разрешении узла определения %(node)s: %(error)s

source: Checking for updates to Arelle
ru: Проверка обновлений Arelle

source: arelleâ¢ - Updater
ru: arelleâ ¢ - Обновление

source: Update {0} is available, running version is {1}. Download now? (Arelle will exit before installing.)
ru: Обновление {0} доступно, запущенная версия {1}. Скачать сейчас? (Приложение Arelle закроется до установки.)

source: Arelle running version, {0}, is newer than the downloadable version, {1}.
fr: La version d'Arelle en cours d'exécution ({0}) est plus récente que la dernière version téléchargeable ({1})
ru: Текущая версия Arelle, {0}, новее, чем загружаемая версия, {1}.

source: Arelle running version, {0}, is the same as the downloadable version.
fr: Arelle version {0} est à jour
ru: Текущая версия Arelle, {0}, совпадает с загружаемой версией.

source: Download ompleted
fr: Téléchargement terminé
ru: Загрузка завершена

source: Validation skipped, document not successfully loaded: %(file)s
ru: Валидация пропущена, документ не загружен: %(file)s

source: Testcase validation exception: %(error)s, testcase: %(testcase)s
fr: Exception lors de la validation du cas de test : %(error)s, cas de test: %(testcase)s
ru: Исключение при валидации тестового примера: %(error)s, тестовый пример: %(testcase)s

source: Versioning report exception: %(error)s, testcase: %(reportFile)s
fr: Exception du rapport de version : %(error)s, cas de test %(reportFile)s
ru: Исключение в отчете о версиях: %(error)s, тестовый пример: %(reportFile)s

source: Instance validation exception: %(error)s, instance: %(instance)s
fr: Exception lors de la validation de l'instance %(instance)s : %(error)s
ru: Исключение при проверке отчета: %(error)s, отчет: %(instance)s

source: skipping RSS Item %(accessionNumber)s %(formType)s %(companyName)s %(period)s
ru: пропуск элемента RSS %(accessionNumber)s %(formType)s %(companyName)s %(period)s

source: RSS Item %(accessionNumber)s %(formType)s %(companyName)s %(period)s
ru: Элемент RSS %(accessionNumber)s %(formType)s %(companyName)s %(period)s

source: validating
fr: validation
ru: валидация

source: RSS item validation exception: %(error)s, instance: %(instance)s
ru: Исключение валидации элемента RSS: %(error)s, отчет: %(instance)s

source: Variation %(id)s %(name)s: %(expected)s - %(description)s
ru: Разновидность %(id)s %(name)s: %(expected)s - %(description)s

source: Testcase %(id)s %(name)s document not loaded: %(file)s
fr: Cas de test %(id)s %(name)s document non chargé : %(file)s
ru: Тестовый документ %(id)s %(name)s не загружен: %(file)s

source: Testcase variation validation exception: %(error)s, instance: %(instance)s
ru: Исключение валидации тестового набора: %(error)s, отчет: %(instance)s

source: validating existing version report
fr: validation du rapport de version existant
ru: отчет проверки существующей версии

source: Testcase %(id)s %(name)s DTSes not loaded, unable to generate versioning report: %(file)s
fr: Cas de test %(id)s %(name)s les DTS ne sont pas chargées, impossible de générer un rapport de version : %(file)s
ru: Тестовый пример %(id)s %(name)s DTSы не загружены, не удалось создать отчет о версиях: %(file)s

source: Testcase formula variation validation exception: %(error)s, instance: %(instance)s
ru: Исключение валидации тестового набора для формул: %(error)s, отчет: %(instance)s

source: loading result infoset
ru: загрузка результирующего инфонабора

source: Testcase %(id)s %(name)s result infoset not loaded: %(file)s
ru: Тестовый пример %(id)s %(name)s. Инфонабор не загружен: %(file)s

source: loading expected result XBRL instance
fr: chargemetn de l'instance des résultats attendus
ru: загрузка ожидаемого результата отчета XBRL

source: Testcase %(id)s %(name)s expected result instance not loaded: %(file)s
fr: Cas de test %(id)s %(name)s l'instance de résultat attendu n'est pas chargée : %(file)s
ru: Тестовый набор %(id)s %(name)s. Ожидаемый результат отчета не загружен: %(file)s

source: Formula output %(countFacts)s facts, expected %(expectedFacts)s facts
fr: La formule produit %(countFacts)s faits, %(expectedFacts)s faits étaient attendus
ru: Факты формулы %(countFacts)s. Ожидаемые факты %(expectedFacts)s

source: Output missing expected fact %(fact)s
ru: В выводе отсутствует ожидаемый факт %(fact)s

source: Output expected fact %(fact)s expected footnotes %(footnotes1)s produced footnotes %(footnotes2)s
ru: В выводе ожидается факт %(fact)s. Ожидались сноски %(footnotes1)s, выведены сноски %(footnotes2)s

source: validating {0}
fr: validation de {0}
ru: проверка {0}

source: parameters for cikList and cikNameList different list entry counts: %(cikList)s, %(cikNameList)s
fr: paramètres pour cikList et cikNameList ne contiennent pas autant d'éléments : %(cikList)s, %(cikNameList)s
ru: параметры для cikList и cikNameList: различное количество записей в списке: %(cikList)s, %(cikNameList)s

source: Invalid inline xbrl document in {base}.htm": %(filename)s
ru: Недопустимый отчет inline xbrl в "{base}.htm": %(fileName)s

source: Invalid instance document base name part (ticker or mnemonic name) in "{base}-{yyyymmdd}.xml": %(filename)s
ru: Недопустимая часть базового имени документа отчета (тикер или мнемоническое имя) в "{base}-{yyyymmdd}.xml": %(fileName)s

source: Invalid instance document base name part (date) in "{base}-{yyyymmdd}.xml": %(filename)s
ru: Недопустимая часть базового имени документа отчета (date) в "{base}-{yyyymmdd}.xml": %(fileName)s

source: Invalid instance document name, must match "{base}-{yyyymmdd}.xml": %(filename)s
ru: Недопустимое имя документа отчета. Должно совпадать с "{base}-{yyyymmdd}.xml": %(fileName)s

source: Invalid entity identifier scheme %(scheme)s in context %(context)s for identifier %(identifier)s
ru: Недопустимая схема идентификатора объекта %(scheme)s в контексте %(context)s для идентификатора %(identifier)s

source: Invalid entity identifier %(entityIdentifierName)s: %(entityIdentifer)s
fr: Identifant d'entité %(entityIdentifierName)s non valide : %(entityIdentifier)s
ru: Недопустимый идентификатор организации %(entityIdentifierName)s: %(entityIdentifer)s

source: EntityIdentifier %(entityIdentifer)s must be 10 digits.
ru: EntityIdentifier %(entityIdentifer)s должен быть из 10 цифр.

source: Multiple %(entityIdentifierName)ss: %(entityIdentifer)s, %(entityIdentifer2)s
fr: Plusieurs %(entityIdentifierName)s : %(entityIdentifier)s et %(entityIdentifier2)s
ru: Несколько %(entityIdentifierName)s: %(entityIdentifer)s, %(entityIdentifer2)s

source: Context ID %(context)s is equivalent to context ID %(context2)s
fr: Contexte ID %(context)s est équivalent au context ID %(context2)s
ru: Context ID %(context)s эквивалентен Context ID %(context2)s

source: Context id %(context)s %(elementName)s invalid content %(value)s
fr: Context ID %(context)s %(elementName)s : Contenu invalide %(value)s
ru: Context ID %(context)s. %(elementName)s недопустимый контент %(value)s

source: Scenario
fr: Scénario
ru: Сценарий

source: Segment
ru: Сегмент

source: Both segment and scenario
fr: À la fois segment et scénario
ru: Как сегмент, так и сценарий

source: Neither segment nor scenario
fr: ni segment, ni scénario
ru: Ни сегмент, ни сценарий

source: %(elementName)s element not allowed in context Id: %(context)s
fr: élément %(elementName)s non autorisé dans le context Id %(context)s
ru: %(ElementName)s не разрешен в контексте Id: %(context)s

source: %(elementName)s of context Id %(context)s has disallowed content: %(content)s
ru: %(ElementName)s контекста Id %(context)s имеет недопустимый контент: %(content)s

source: Context %(contextID)s has a forever period.
ru: Контекст %(contextID)s имеет вечный период.

source: %(count)s contexts contain disallowed %(elementName)s: %(context)s
ru: %(count)s содержит недопустимый %(elementName)s: %(context)s

source: %(count)s contexts contain disallowed %(elementName)s content: %(context)s
ru: %(count)s содержит недопустимый %(elementName)s контент: %(context)s

source: Fact %(fact)s of context %(contextID)s has an XBRL error
fr: Le fait %(fact)s du context %(contextID)s est en erreur XBRL
ru: Факт %(fact)s контекста %(contextID)s имеет ошибку XBRL

source: Numeric fact %(fact)s of context %(contextID)s has a precision attribute '%(precision)s'
fr: Fait numérique %(fact)s du contexte %(contextID)s a un attribut précision '%(precision)s'
ru: Числовой факт %(fact)s контекста %(contextID)s имеет атрибут точности ' %(precision)s'

source: Domain item %(fact)s in context %(contextID)s may not appear as a fact
fr: L'élément %(fact)s du domaine dans le contexte %(contextID)s peut ne pas apparaître comme un fait
ru: Объект домена %(fact)s в контексте %(contextID)s может не отображаться как факт

source: dei:%(elementName)s %(value)s must match the context entity identifier %(entityIdentifier)s
ru: dei:%(elementName)s %(value)s должно соответствовать контекстe идентификатора организации %(entityIdentifier)s ​

source: dei:%(elementName)s %(value)s must match submission: %(filerIdentifier)s
ru: dei:%(elementName)s %(value)s должно соответствовать представлению: %(filerIdentifier)s

source: dei:%(elementName)s %(prefix)s should be a case-insensitive prefix of: %(value)s
ru: dei:%(elementName)s %(prefix)s должен быть префикс без учета регистра: %(value)s

source: The instance document contained a context(s) %(contextIDs)s that was(are) not used in any fact.
fr: Le document instance contient des contextes %(contextIDs)s qui ne sont utilisés par aucun fait.
ru: Отчет содержит контекст (ы) %(contextIDs)s, которые не используются ни в одном факте.

source: Context endDate %(endDate)s, and startDate(s) have a duration of one day, for end context(s): %(endContexts)s and start context(s): %(startContexts)s; that is inconsistent with document type %(documentType)s.
ru: Контекст endDate %(endDate)s, и startDate(s) имеют продолжительность одного дня, для контекста(ов): %(endContexts)s и начального контекста(ов): %(startContexts)s; что не соответствует типу документа %(documentType)s.

source: Context instant date %(endDate)s startDate has a duration of one day,with end (instant) of context(s): %(contexts)s; that is inconsistent with document type %(documentType)s.
ru: Instant дата контекста %(endDate)s startDate имеет продолжительность одного дня, с окончанием в контексте(ах): %(contexts)s; что не соответствует типу документа %(documentType)s.

source: Required context (no segment) not found for document type %(documentType)s.
fr: Le contexte requis (sans segment) non trouvé pour le type de document %(documentType)s.
ru: Обязательный контекст (без сегмента) не найден для типа документа %(documentType)s.

source: Units %(unitID)s and %(unitID2)s are equivalent.
fr: Les unités %(unitID)s et %(unitID)s sont équivalentes
ru: Элементы %(unitID)s и %(unitID2)s эквивалентны.

source: Unit has a measure with localName length (%(length)s) over 200 bytes long in utf-8, %(measure)s.
ru: Единица имеет меру с длиной localName (%(length)s) более 200 байтов в utf-8, %(measure)s.

source: Fact %(fact)s of context %(contextID)s decimals %(decimals)s value %(value)s has nonzero digits in insignificant portion %(insignificantDigits)s.
ru: Факт %(fact)s контекста %(contextID)s. Decimals %(decimals)s значения %(value)s имеют ненулевые цифры в незначительной части %(insignificantDigits)s.

source: Fact %(fact)s of context %(contextID)s decimals %(decimals)s value %(value)s causes Value Error exception.
fr: Le fait %(fact)s du context %(contextID)s décimales %(decimals)s valeur %(value)s est à l'origine d'une exception Value Error.
ru: Факт %(fact)s контекста %(contextID)s. Decimals числа %(decimals)s значения %(value)s вызывает исключение Value Error.

source: Fact %(fact)s of context %(contextID)s has text of xml:lang '%(lang)s' without corresponding %(lang2)s text
fr: Le fait %(fact)s du context %(contextID)s précise xml:lang="%(lang)s" mais il n'y a pas de texte correspondant pour %(lang2)s
ru: Факт %(fact)s контекста %(contextID)s имеет текст xml:lang '%(lang)s' без соответствующего текста %(lang2)s

source: A label linkbase is required but was not found
fr: Une base de liens libellé est requise, mais non trouvée
ru: База ссылок меток (Labels) обязательна, но не найдена

source: %(elementName)s is not found in the default context
fr: %(elementName)s n'est pas trouvé dans le contexte par défaut
ru: %(elementName)s не найден в контексте по умолчанию

source: %(elementName)s is required and was not found in the default context
fr: %(elementName)s est requis et non trouvé dans le contexte par défaut
ru: %(elementName)s требуется и не найден в контексте по умолчанию

source: %(elementName)s is in the default context is incorrect '%(date)s'
fr: %(elementName)s dans le context par défaut est incorrect '%(date)s'
ru: %(elementName)s в контексте по умолчанию неверен '%(date)s'

source: AmendmentFlag is true in context %(contextID)s so AmendmentDescription is also required
fr: AmendmentFlag est vrai dans le contexte %(contextID)s, ainsi AmendmentDescription est également requis
ru: AmendmentFlag является истинным в контексте %(contextID)s, поэтому также требуется описание AmendmentDescription

source: AmendmentDescription can not be provided when AmendmentFlag is not true in context %(contextID)s
fr: 'AmendmentDescription' ne peut pas être fourni quand 'AmendmentFlag' n'est pas vrai dans le contexte %(contextID)s
ru: AmendmentDescription не может быть указано, если AmendmentFlag не является истинным в контексте %(contextID)s

source: DocumentType is required and was not found in the default context
fr: DoucmentType est requis mais non trouvé dans le contexte par défaut
ru: DocumentType требуется и не найден в контексте по умолчанию

source: DocumentType '%(documentType)s' of context %(contextID)s was not recognized
fr: Le DocumentType '%(documentType)s' du contexte %(contextID) n'est pas reconnu
ru: DocumentType '%(documentType)s' контекста %(contextID)s не был распознан

source: DocumentType '%(documentType)s' of context %(contextID)s inapplicable to submission form %(submissionType)s
fr: Le DocumentType '%(documentType)s' du contexte %(contextID) n'est pas reconnu
ru: DocumentType '%(documentType)s' контекста %(contextID)s неприменим к форме %(submissionType)s

source: The value for dei:DocumentType, %(documentType)s, is not allowed for %(exhibitType)s attachments.
ru: Значение для dei:DocumentType, %(documentType)s не допускается для вложений %(exhibType)s.

source: The value for dei:DocumentType, '%(documentType)s' is not allowed for %(exhibitType)s attachments.
ru: Значение для dei:DocumentType, '%(documentType)s' недопустимо для вложений %(exhibType)s.

source: dei:%(elementName)s is required for DocumentType '%(documentType)s' of context %(contextID)s
ru: dei:%(elementName)s требуется для DocumentType ' %(documentType)s' контекста %(contextID)s

source: dei:EntityCommonStockSharesOutstanding is required for DocumentType '%(documentType)s' but not in the default context because there are multiple classes of common shares
ru: dei:EntityCommonStockSharesOutstanding требуется для DocumentType '%(documentType)s', но не в контексте по умолчанию, поскольку существует несколько классов обычных акций

source: dei:EntityCommonStockSharesOutstanding is required for DocumentType '%(documentType)s' but but a default-context because only one class of stock
ru: dei:EntityCommonStockSharesOutstanding требуется для DocumentType '%(documentType)s', но в контексте по умолчанию, поскольку только один класс акций

source: dei:EntityCommonStockSharesOutstanding is required for DocumentType '%(documentType)s' but only one per stock class %(stockClass)s
ru: dei:EntityCommonStockSharesOutstanding требуется для DocumentType '%(documentType)s', но только один для класса акций %(stockClass)s
