Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: Unknown log level name: {0}, please choose from {1}
ru: Неизвестное имя уровня журнала: {0}, выберите из {1}

source: FILENAME is an entry point, which may be an XBRL instance, schema, linkbase file, inline XBRL instance, testcase file, testcase index file. FILENAME may be a local file or a URI to a web located file. For multiple instance filings may be | separated file names or JSON list of file/parameter dicts [{"file":"filepath"}, {"file":"file2path"} ...].
ru: FILENAME - это точка входа (entry point), которая может быть файлом XBRL отчетности (XBRL instance), таксономией (schema), базой ссылок (linkbase), отчетом inline XBRL, тестовым файлом или индексом. FILENAME может быть как локальным файлом или URI на ресурс в сети Интернет (URI). Для выбора нескольких файлов отчетности (instance filings) их наименования должны быть разделены символом | или быть представлены в формате JSON списком файлов/параметров [{"file":"filepath"}, {"file":"file2path"} ...].

source: user name if needed (with password) for web file retrieval
ru: имя пользователя при необходимости (с паролем) для поиска веб-файлов

source: password if needed (with user name) for web retrieval
ru: пароль при необходимости (с именем пользователя) для веб-поиска

source: FILENAME is a list of files to import to the DTS, such as additional formula or label linkbases. Multiple file names are separated by a '|' character.
fr: FICHIER est une liste de fichiers à importer dans le DTS, tel que des bases de liens de formules ou de libellés. Les différents fichiers sont séparés par le caractère '|'.
ru: FILENAME - это список файлов для импорта в DTS, таких как дополнительные формулы или метки. Несколько имен файлов разделяются символом '|' персонаж

source: FILENAME is a second entry point when comparing (diffing) two DTSes producing a versioning report.
fr: FILENAME est le second point d'entrée lors d'une comparaison différentielle de 2 DTS pour produire un rapport de version.
ru: FILENAME - это вторая точка входа при сравнении двух разных DTS, создающих отчет о версировании.

source: FILENAME is the filename to save as the versioning report.
fr: FILENAME est le nom de fichier du rapport de version à sauver
ru: FILENAME - это имя файла для сохранения в качестве отчета о версии.

source: Validate the file according to the entry file type. If an XBRL file, it is validated according to XBRL validation 2.1, calculation linkbase validation if either --calcDecimals or --calcPrecision are specified, and SEC EDGAR Filing Manual (if --efm selected) or Global Filer Manual disclosure system validation (if --gfm=XXX selected). If a test suite or testcase, the test case variations are individually so validated. If formulae are present they will be validated and run unless --formula=none is specified.
ru: Подтвердите файл в соответствии с типом входа файла. Если файл XBRL, он проверяется в соответствии с валидацией XBRL 2.1, проверка ссылочной базы калькуляции, если заданы значения --calcDecimals или --calcPrecision, и Руководство по заполнению SEC EDGAR (если выбрано --efm) или система валидации раскрытия информации Global Filer Manual (если --gfm=XXX). Если набор тестов или примеры тестов, варианты тестовых примеров проверяются индивидуально. Если присутствуют формулы, они будут проверяться и выполняться, если не указано значение --formula=none

source: Specify calculation linkbase validation inferring decimals.
fr: Indique une base de liens de calcul, avec inférence des décimales
ru: Задайте валидацию вычисления базы ссылок, выведя десятичные числа.

source: Specify calculation linkbase validation inferring precision.
fr: Indique une base de liens de calcul, avec inférence de précision
ru: Задайте валидацию вычисления базы ссылок, выведя точность.

source: Select Edgar Filer Manual (U.S. SEC) disclosure system validation (strict).
ru: Выберите валидацию системы раскрытия информации Edgar Filer Manual (US. SEC) (строго).

source: Specify a disclosure system name and select disclosure system validation. Enter --disclosureSystem=help for list of names or help-verbose for list of names and descriptions.
ru: Укажите имя системы раскрытия информации и выберите валидацию системы обнаружения. Введите --disclosureSystem=help для списка имен или help-verbose для списка имен и описаний

source: Select U.K. HMRC disclosure system validation.
ru: Выберите валидацию системы раскрытия информации HMRC U.K.

source: Select validation with respect to Unit Type Registry.
fr: Choisis la validation relative au registre des types d'unité
ru: Выберите валидацию в отношении реестра типа устройства (Unit Type Registry).

source: Override disclosure systems Unit Type Registry location (URL or file path).
ru: Измените локацию реестра типа устройств систем раскрытия информации (URL-адрес или путь к файлу).

source: Select validation with respect testcase infosets.
ru: Выберите валидацию с учетом информационных данных тестового инфонабора.

source: Language for labels in following file options (override system settings)
ru: Язык для меток в следующих параметрах файла (отменить системные настройки)

source: Label role for labels in following file options (instead of standard label)
ru: Роль метки для меток в следующих параметрах файла (вместо стандартной метки)

source: Write DTS tree into FILE (may be .csv or .html)
ru: Напишите дерево DTS в FILE (может быть .csv или .html)

source: Write fact list into FILE
ru: Напишите список тем в FILE

source: Columns for fact list file
ru: Столбцы для файла списка тем

source: Write fact table into FILE
ru: Запишите таблицу фактов в FILE

source: Write concepts into FILE
ru: Запишите концепты в FILE

source: Write presentation linkbase into FILE
ru: Запишите презентационную базу ссылок в FILE

source: Write calculation linkbase into FILE
ru: Напишите расчетную базу ссылок в FILE

source: Write dimensions (of definition) linkbase into FILE
ru: Запишите базу ссылок измерений (определений) в FILE

source: Write formulae linkbase into FILE
ru: Запишите базу ссылок формул в FILE

source: Write linkbase relationships for viewArcrole into viewFile
ru: Запишите связь базы ссылок для viewArcrole в viewFile

source: Write defined role types into FILE
ru: Запишите обозначенные типы ролей в файл

source: Write defined arcrole types into FILE
ru: Запишите обозначенные типы archRoles в FILE

source: Write test report of validation (of test cases) into FILE
ru: Запишите отчет валидации (тестовых примеров) в FILE

source: Columns for test report file
ru: Столбцы для файла отчета о тестировании

source: Write RSS report into FILE
ru: Запишите RSS-отчет в FILE

source: Columns for RSS report file
ru: Столбцы для файла отчета RSS

source: Skip DTS activities (loading, discovery, validation), useful when an instance needs only to be parsed.
ru: Пропуск действия DTS (загрузка, обнаружение, валидация) может быть полезен, когда отчет нужно только разпарсить.

source: Skip loading discovered or schemaLocated files matching pattern (unix-style file name patterns separated by '|'), useful when not all linkbases are needed.
ru: Пропуск загрузки обнаруженных или schemaLocated файлов, соответствующих шаблону (шаблоны имен файлов в стиле unix, разделенные символом '|') - полезно, когда необходимы не все ссылочные базы.

source: Write log messages into file, otherwise they go to standard output. If file ends in .xml it is xml-formatted, otherwise it is text.
ru: Запись сообщения журнала в файл, в противном случае на стандартный вывод. Если файл заканчивается на .xml, он форматируется в формате xml, иначе - текст

source: Logging format for messages capture, otherwise default is "[%(messageCode)s] %(message)s - %(file)s".
ru: Формат ведения журнала для сбора сообщений, в противном случае по умолчанию используется "[%(messageCode)s] %(message)s - %(file)s".

source: Minimum level for messages capture, otherwise the message is ignored. Current order of levels are debug, info, info-semantic, warning, warning-semantic, warning, assertion-satisfied, inconsistency, error-semantic, assertion-not-satisfied, and error.
ru: Минимальный уровень захвата сообщений, иначе сообщение будет проигнорировано. Текущий порядок уровней - отладка, информация, информация-семантика, предупреждение, предупреждение-семантика, предупреждение, контроль-пройден, несогласованность, ошибка-семантика, контроль-не пройден, ошибка

source: Regular expression filter for logLevel. (E.g., to not match *-semantic levels, logLevelFilter=(?!^.*-semantic$)(.+).
ru: Фильтр регулярных выражений для logLevel. (Например, чтобы не совпадать с *-semantic уровнями, logLevelFilter=(?!^.*-semantic$)(.+).

source: Regular expression filter for log message code.
ru: Фильтр регулярных выражений для кода сообщения журнала.

source: Specify parameters for formula and validation (name=value[,name=value]).
ru: Укажите параметры для формулы и валидации (name=value[,name=value]).

source: Specify parameters separator string (if other than comma).
ru: Укажите строку разделителя параметров (если не запятая).

source: Specify formula action: validate - validate only, without running, run - validate and run, or none - prevent formula validation or running when also specifying -v or --validate. if this option is not specified, -v or --validate will validate and run formulas if present
ru: Укажите действие формулы: validate - только проверять, не запускать, run - проверять и запускать, или none - предотвратить проверку или запуск формулы, когда также указывая -v или --validate. Если этот параметр не указан, -v или --validate будет проверять и запускать формулы, если они присутствуют

source: Specify formula tracing.
fr: Indique le niveau de log de formule
ru: Укажите трассировку формулы.

source: Specify showing times of variable set evaluation.
ru: Укажите время отображения проверки переменных.

source: Specify formula/assertion IDs to run, separated by a '|' character.
ru: Укажите идентификаторы formula/assertion ID для запуска (разделенные символом '|').

source: Language for user interface (override system settings, such as program messages). Does not save setting.
ru: Язык пользовательского интерфейса (переопределяет системные настройки, такие как сообщения программы). Не сохраняет настройку.

source: Modify and re-save proxy settings configuration. Enter 'system' to use system proxy setting, 'none' to use no proxy, 'http://[user[:password]@]host[:port]' (e.g., http://192.168.1.253, http://example.com:8080, http://joe:secret@example.com:8080), or 'show' to show current setting, .
ru: Измените и сохраните конфигурацию настроек прокси. Введите 'system', чтобы использовать системный прокси-параметр, 'none' чтобы не использовать прокси-сервер, 'http://[user[:password]@]host[:port]' (например, http://192.168.1.253, http: //example.com:8080, http://joe:secret@example.com:8080) или 'show', чтобы показать текущую настройку.

source: Specify internet connectivity: online or offline
ru: Укажите подключение к Интернету: онлайн или офлайн

source: Specify internet connection timeout in seconds (0 means unlimited).
ru: Укажите время ожидания подключения к Интернету в секундах (0 означает неограниченно).

source: Specify rechecking cache files (weekly is default)
ru: Укажите перепроверку файлов кеша (еженедельно по умолчанию)

source: Log info message for downloads to web cache.
ru: Введите информационное сообщение для загрузки в веб-кеш.

source: Specify non-standard location for configuration and cache files (overrides environment parameter XDG_CONFIG_HOME).
ru: Укажите нестандартное расположение файлов конфигурации и кеша (переопределяет параметр пространства XDG_CONFIG_HOME).

source: Modify plug-in configuration. Re-save unless 'temp' is in the module list. Enter 'show' to show current plug-in configuration. Commands show, and module urls are '|' separated: +url to add plug-in by its url or filename, ~name to reload a plug-in by its name, -name to remove a plug-in by its name, relative URLs are relative to installation plug-in directory, (e.g., '+http://arelle.org/files/hello_web.py', '+C:\Program Files\Arelle\examples\plugin\hello_dolly.py' to load, or +../examples/plugin/hello_dolly.py for relative use of examples directory, ~Hello Dolly to reload, -Hello Dolly to remove). If + is omitted from .py file nothing is saved (same as temp). Packaged plug-in urls are their directory's url.
ru: Измените конфигурацию подключаемого модуля. Пересохраните, если 'temp' не указан в списке модулей. Введите 'show', чтобы показать текущую конфигурацию подключаемого модуля. Отображаются команды, а URL модуля разделены символом '|': +url для добавления плагина по его URL-адресу или имени файла, ~name для перезагрузки подключаемого модуля по его имени, -name для удаления подключаемого модуля по его имени, близкие URL-адреса относятся к каталогу подключаемого модуля, (Например, '+http://arelle.org/files/hello_web.py', '+ C:\Program Files\Arelle\examples\plugin\hello_dolly.py' для загрузки или +../examples/plugin/hello_dolly.py для относительного использования каталога примеров, ~Hello Dolly для перезагрузки, -Hello Dolly для удаления). Если + отсутствует в .py файле, ничего не сохраняется (то же самое, что и temp). Упакованные URL-адреса подключаемых модулей - это адрес их каталога

source: Modify taxonomy packages configuration. Re-save unless 'temp' is in the module list. Enter 'show' to show current packages configuration. Commands show, and module urls are '|' separated: +url to add package by its url or filename, ~name to reload package by its name, -name to remove a package by its name, URLs are full absolute paths. If + is omitted from package file nothing is saved (same as temp).
ru: Измените конфигурацию пакетов таксономии. Перезагрузите, если 'temp' не указан в списке модулей. Введите 'show', чтобы отобразить текущую конфигурацию пакетов. Отображаются команды, а URL модуля разделены символом- '|': +url для добавления пакета по его URL-адресу или имени файла, ~name для перезагрузки пакета по его имени, -имя для удаления пакета по его имени, URL-адреса являются полными абсолютными траекториями. Если пропущен + в файле пакета, тогда ничего не сохранено (то же самое, что и темп)

source: Provide non-standard archive manifest file name pattern (e.g., *taxonomyPackage.xml). Uses unix file name pattern matching. Multiple manifest files are supported in archive (such as oasis catalogs). (Replaces search for either .taxonomyPackage.xml or catalog.xml).
ru: Предоставьте нестандартный шаблон имени файла манифеста архива (например, *taxonomyPackage.xml). Использует соответствие шаблону имени файла unix. В архиве поддерживаются несколько файлов манифеста (например, каталоги оазиса). (Заменяет поиск для .taxonomyPackage.xml или catalog.xml)

source: Abort process on major error, such as when load is unable to find an entry or discovered file.
ru: Прерывание процесса при существенной ошибке, например, когда загрузка не может найти точку входа или файл.

source: Show Arelle's config and cache directory and host OS environment parameters.
ru: Показать каталог конфигурации и кэша Arelle и параметры операционной среды хоста операционной системы.

source: Collect profile statistics, such as timing of validation activities and formulae.
ru: Собирать статистику профиля, например, время исполнения валидации.

source: start web server on host:port[:server] for REST and web access, e.g., --webserver locahost:8080, or specify nondefault a server name, such as cherrypy, --webserver locahost:8080:cherrypy. (It is possible to specify options to be defaults for the web server, such as disclosureSystem and validations, but not including file names.)
ru: запустите веб-сервер на host:port[:server] для REST и веб-доступа, например, --webserver locahost:8080, или укажите имя сервера не по умолчанию, например cherrypy, --webserver locahost:8080:cherrypy. (Можно указать параметры по умолчанию для веб-сервера, такие как системы раскрытия информации и валиидаций, но не включая имена файлов.)

source: Show product version, copyright, and license.
fr: Afficher la version du logicelle, les droits d'auteurs et la licence.
ru: Показывать версию продукта, авторские права и лицензию.

source: arelle(r) {0}bit {1} An open source XBRL platform (c) 2010-2015 Mark V Systems Limited All rights reserved http://www.arelle.org support@arelle.org Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License. You may obtain a copy of the License at 'http://www.apache.org/licenses/LICENSE-2.0' Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License. Includes: Python(r) {3[0]}.{3[1]}.{3[2]} (c) 2001-2013 Python Software Foundation PyParsing (c) 2003-2013 Paul T. McGuire lxml {4[0]}.{4[1]}.{4[2]} (c) 2004 Infrae, ElementTree (c) 1999-2004 by Fredrik Lundh xlrd (c) 2005-2013 Stephen J. Machin, Lingfo Pty Ltd, (c) 2001 D. Giffin, (c) 2000 A. Khan xlwt (c) 2007 Stephen J. Machin, Lingfo Pty Ltd, (c) 2005 R. V. Kiseliov{2} May include installable plug-in modules with author-specific license terms
ru: arelle (r) {0} бит {1} Платформа XBRL с открытым исходным кодом (C) 2010-2015 гг. Mark V Systems Limited Все права защищены http://www.arelle.org support@arelle.org Лицензируется по лицензии Apache, версия 2.0 ("Лицензия"); вы не можете использовать этот файл, кроме как в соответствии с Лицензией. Вы можете получить копию Лицензии на странице "http://www.apache.org/licenses/LICENSE-2.0" Если это не предусмотрено действующим законодательством или не согласовано в письменной форме, программное обеспечение распространяемое по лицензии, распространяется на основе "КАК ЕСТЬ", БЕЗ КАКИХ_ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ , явных или подразумеваемых. См. Лицензию на конкретном языке, определяющем разрешения и Ограничения по Лицензии. Включает: Python(r) {3[0]}.{3[1]}.{3[2]} (c) 2001-2013 Python Software Foundation PyParsing (c) 2003-2013 Paul T. McGuire lxml {4[0]}.{4[1]}.{4[2]} (c) 2004 Infrae, ElementTree (c) 1999-2004 by Fredrik Lundh xlrd (c) 2005-2013 Stephen J. Machin, Lingfo Pty Ltd, (c) 2001 D. Giffin, (c) 2000 A. Khan xlwt (c) 2007 Stephen J. Machin, Lingfo Pty Ltd, (c) 2005 R. V. Kiseliov{2} Может включать устанавливаемые модули плагинов с условиями лицензии для конкретного автора

source: Disclosure system choices: {0}
ru: Выбор системы раскрытия информации: {0}

source: incorrect arguments, please try python CntlrCmdLine.py --help
ru: неправильные параметры, пожалуйста, попробуйте Python CntlrCmdLine.py --help

source: incorrect arguments with --webserver, please try python CntlrCmdLine.py --help
ru: неверные параметры with --webserver, пожалуйста, попробуйте Python CntlrCmdLine.py --help

source: Proxy configuration has been set.
ru: Конфигурация прокси установлена.

source: Proxy configured to use {0}.
ru: Прокси настроен на использование {0}.

source: Microsoft Windows Internet Settings
fr: Options Internet de Microsoft Windows
ru: Настройки Интернета Microsoft Windows

source: Mac OS X System Configuration
fr: Configuration du système Mac OS X
ru: Конфигурация системы Mac OS X

source: environment variables
fr: variables d'environnement
ru: переменные среды

source: Proxy setting: http://{0}{1}{2}{3}{4}
ru: Настройка прокси: http://{0}{1}{2}{3}{4}

source: Proxy is disabled.
ru: Прокси отключен.

source: Addition of plug-in {0} successful.
ru: Добавление плагина {0} выполнено успешно.

source: Unable to load plug-in.
ru: Не удалось загрузить подключаемый модуль.

source: Reload of plug-in successful.
ru: Перезагрузка плагина прошла успешно.

source: Unable to reload plug-in.
ru: Невозможно перезагрузить подключаемый модуль.

source: Deletion of plug-in successful.
ru: Подключаемый модуль удален.

source: Unable to delete plug-in.
ru: Не удалось удалить подключаемый модуль.

source: Activation of plug-in {0} successful, version {1}.
ru: Активация подключаемого модуля {0} прошла успешно, версия {1}.

source: Unable to load "%(name)s" as a plug-in or "%(name)s" is not recognized as a plugin command.
ru: Невозможно загрузить "%(name)s" в качестве подключаемого модуля или "%(name)s" не распознается как команда плагина.

source: Plug-in modules:
ru: Подключаемые модули:

source: Plug-in: {0}; author: {1}; version: {2}; status: {3}; date: {4}; description: {5}; license {6}.
ru: Подключаемый модуль: {0}; Автор: {1}; Версия: {2}; Статус: {3}; Дата: {4}; Описание: {5}; Лицензия {6}.

source: Addition of package {0} successful.
ru: Добавление пакета {0} выполнено успешно.

source: Reload of package successful.
ru: Перезагрузка пакета прошла успешно.

source: Unable to reload package.
ru: Невозможно перезагрузить пакет.

source: Deletion of package successful.
ru: Удаление пакета прошло успешно.

source: Unable to delete package.
ru: Не удалось удалить пакет.

source: Activation of package {0} successful.
ru: Активация пакета {0} выполнена успешно.

source: Unable to load package "%(name)s" as a package or "%(name)s" is not recognized as a packages command.
ru: Невозможно загрузить пакет "%(name)s" в виде пакета или "%(name)s" не распознается как команда пакетов.

source: Taxonomy packages:
ru: Таксономические пакеты:

source: Package: {0}; version: {1}; status: {2}; date: {3}; description: {4}.
ru: Пакет: {0}; Версия: {1}; Статус: {2}; Дата: {3}; Описание: {4}.

source: Config directory: {0}
ru: Каталог конфигураций: {0}

source: Cache directory: {0}
ru: Каталог кеша: {0}

source: both --efm and --disclosureSystem validation are requested, ignoring --efm only
ru: необходима проверка --efm и --disclosureSystems проверки, игнорируя --efm

source: both --calcDecimals and --calcPrecision validation are requested, proceeding with --calcDecimals only
fr: Les validations --calcDecimals et --calcPrecision sont demandées simultanément, continue avec --calcDecimals uniquement
ru: необходима проверка --calcDecimals и --calcPrecision валидация, при условии, только исходя из --calcDecimals

source: File name parameter appears to be malformed JSON: {0}
ru: Параметр File name выглядит некорректным. JSON: {0}

source: views loading
fr: chargement des vues
ru: загружаюся Views

source: Entry point loading Failed to complete request: {0} {1}
ru: Загрузка точки входа не удалась: {0} {1}

source: load
ru: загрузка

source: loaded in %.2f secs at %s
fr: chargé en %.2f secondes à %s
ru: загружено за %.2f сек в %s

source: import in %.2f secs at %s
ru: импорт за %.2f сек в %s

source: import
ru: импорт

source: diff comparison DTS loaded in %.2f secs
fr: comparaison différentielle DTS chargée en %.2f secondes
ru: сравнение DTS за %.2f сек

source: compared in %.2f secs
fr: Comparé en %.2f secondes
ru: сравнение за %.2f сек

source: [Exception] Failed to doad diff file: {0} {1}
ru: [Исключение] Не удалось загрузить файл сравнения: {0} {1}

source: validated in %.2f secs
fr: validé en %.2f secondes
ru: проверено за %.2f сек

source: formula validation and execution in %.2f secs
ru: проверка и выполнение формулы за %.2f сек

source: formula validation only in %.2f secs
ru: проверка формулы за %.2f сек

source: [IOError] Failed to save output: {0}
fr: [IOError] Impossible d'enregistrer la sortie {0}
ru: [IOError] Не удалось сохранить: {0}

source: [Exception] Failed to complete request: {0} {1}
ru: [Исключение] Не удалось выполнить запрос: {0} {1}

source: total
ru: итого
