Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: FILENAME is an excel 95-2003 index file containing columns: Dir is a test directory, fromURI is the fromDTS URI relative to test director, toURI is the toDTS URI relative to test director, Description is the goal of the test for testcase description, Assignment is the business, technical, or errata classification, Expected event is an event localName that is expected Output files and testcases are located in filename's directory, report files are generated in '/report' under fromURI's directory.
fr: FILENAME est un fichier index MS Excel 95-2003 contenant les colonnes: Dir répertoire de test; fromURi est l'URL relative de fromDRS, toURi est l'URL relative de toDTS, Description est une description du but du test, Assignment est la classification métier, technique ou errata, Expected event est l'événement locatlName qui est attendu. Les fichiers de sorties et les cas de test sont localisés dans le même répertoire que FILENAME, les rapports sont produits dans "/report" sous le répertoire de fromURI
ru: FILENAME - файл Excel 95-2003, содержащий столбцы: Dir - тестовый каталог, FromURI - URI fromDTS, относящийся к тестовому каталогу, ToURI - URI toDTS, относящийся к тестовому каталогу, Description - тектовое описание цели теста, Assignment - это бизнес или техническая классификация или классификация ошибок. Expected event - это ожидаемое событие localName Выходные файлы и тестовые файлы находятся в каталоге исходного файла Файлы отчетов генерируются в подкаталоге '/ report' каталога fromURI.

source: Date if desired to use (instead of today) in generated testcase elements.
fr: Date à utiliser (à la place d'aujourd'hui) dans la génération des cas de test.
ru: Дата, если есть желание использовать (вместо today) в сгенерированных элементах тестового набора.

source: [info] xls loaded in {0:.2} secs at {1}
fr: [info] xls chargé en {0:.2} secondes à {1}
ru: [Info] xls загружен за {0:.2} сек. в {1}

source: [info] testcase uriFrom {0}
ru: [Info] uriFrom тестового набора {0}

source: loading from DTS
fr: chargement depuis le DTS
ru: загрузка из DTS

source: loading to DTS
fr: chargement dans le DTS
ru: выгрузка в DTS

source: Exception: %(error)s, Excel row: %(excelRow)s
fr: Exception: %(error)s, Ligne %(excelRow)s dans Excel
ru: Исключение: %(error)s, строка Excel: %(excelRow)s

source: [info] loaded in {0:.2} secs
fr: [info] chargé en {0:.2} s
ru: [Info] загружен за {0:.2} сек

source: [info] testcases {0}
ru: [Info] тестовые наборы {0}

source: Waiting for QuickBooks
ru: Ожидание QuickBooks

source: Generating XBRL-GL from QuickBooks response
ru: Генерация XBRL-GL из ответа QuickBooks

source: Saving XBRL-GL instance
ru: Сохранение отчета XBRL-GL

source: Done
ru: Готово

source: <html><body><form method="POST"><table> <tr><td>Name:</td><td><input name="name" type="text" /></td></tr> <tr><td>Password:</td><td><input name="password" type="password" /></td></tr> <tr><td>&nbsp;</td><td><input type="submit" value="Submit" /></td></tr> </table></form></body></html>
ru: <html><body><form method="POST"><table> <Tr> <td> Имя: </td> <td> <input name="name" type="text" /></td></tr> <Tr> <td> Пароль: </td> <td> <input name="password" type="password" /></td></tr> <Tr> <td> & nbsp; </td> <td> <input type="submit" value="Submit" /></td></tr> </table> </form> </body> </HTML>

source: <p>You are logged in as user: {0}</p>
ru: <P> Вы вошли как пользователь: {0} </p>

source: <p>Login failed</p>
ru: <P> Ошибка входа </p>

source: <p>You are logged out.</p>
ru: <P> Вы вышли из системы. </P>

source: POST file upload must be a zip file
ru: POST - загружаемый файл должна быть zip

source: POST must provide a zip file, Content-Type '{0}' not recognized as a zip file.
ru: POST должен быть zip. Content-Type '{0}' не распознан как zip.

source: Only validation or one view can be specified in one requested.
ru: В одном запросе может быть указана только проверка или просмотр.

source: Media '{0}' is not supported for validation (please select xhtml, html, xml, json or text)
ru: Формат '{0}' не поддерживается для валидации (выберите xhtml, html, xml, json или text)

source: Media '{0}' is not supported for view (please select xhtml, html, xml, csv, or json)
ru: Формат '{0}' не поддерживается для просмотра (выберите xhtml, html, xml, csv или json)

source: Neither validation nor view requested, nothing to do.
ru: Ни валидация, ни просмотр не запрашиваются.

source: Flavor '{0}' is not supported
ru: Разновидность '{0}' не поддерживается

source: View '{0}' is not supported
ru: Вид '{0}' не поддерживается

source: Messages
ru: Сообщения

source: From DTS, to DTS, and report must be specified
ru: Должны быть указаны: исходный DTS, результирующий DTS и отчет

source: proxy, plugins, packages or environment must be specified
ru: прокси, плагины, пакеты или среда должны быть указаны

source: Configuration Request
ru: Запрос конфигурации

source: Stop Request
ru: Запрос остановки

source: QuickBooks report '{0}' is not supported (please select from: {1})
ru: Отчет QuickBooks '{0}' не поддерживается (пожалуйста, выберите из: {1})

source: Media '{0}' is not supported for xbrl-gl (please select xhtml, html or xml)
ru: Формат '{0}' не поддерживается для xbrl-gl (выберите xhtml, html или xml)

source: FromDate '{0}' missing or not valid
ru: FromDate '{0}' отсутствует или некорректен

source: ToDate '{0}' missing or not valid
ru: ToDate '{0}' отсутствует или некорректен

source: Request queued for QuickBooks...
ru: Запрос в очереди для QuickBooks ...

source: Quickbooks Request
ru: Запрос QuickBooks

source: QuickBooks ticket not found, request canceled.
ru: Запрос QuickBooks не найден, запрос отменен.

source: {0}, Waiting 20 seconds...
ru: {0}, Ожидание 20 секунд ...

source: <table width="700p"> <tr><th colspan="2">Arelle QuickBooks Global Ledger Interface</th></tr> <tr><td>checkbox</td><td>Trial Balance.</td></tr> <tr><td>close button</td><td>Done</td></tr> </table>
ru: <table width="700p"> <Tr> <th colspan="2"> Интерфейс Arelle QuickBooks Global Ledger</th> </tr> <tr><td>checkbox</td><td>Trial Balance.</td></tr> <tr><td>close button</td><td>Done</td></tr> </table>

source: <table> <tr><th colspan="2">Arelle web API</th></tr> <tr><td>/help</td><td>This web page.</td></tr> <tr><td>/about</td><td>About web page, copyrights, etc.</td></tr> <tr><th colspan="2">Validation</th></tr> <tr><td>/rest/xbrl/{file}/validation/xbrl</td><td>Validate document at {file}.</td></tr>
ru: <table> <tr><th colspan="2">Arelle web API</th></tr> <Tr> <td> /help </td> <td> Эта веб-страница. </Td> </tr> <Tr> <td> /about </td> <td> О веб-странице, авторских правах и т. д. </Td> </tr> <tr><th colspan="2"> Проверка </th> </tr> <tr><td>/rest/xbrl/{file}/validation/xbrl</td><td> Проверить документ в {файле}. </Td> </tr>

source: <tr><td>Â </td><td>For an http POST of a zip file (mime type application/zip), {file} is the relative file path inside the zip file.</td></tr> <tr><td>Â </td><td>For an http GET request, {file} may be a web url, and may have "/" characters replaced by ";" characters (but that is not necessary).</td></tr> <tr><td style="text-align=right;">Example:</td><td><code>/rest/xbrl/c.xbrl/validation/xbrl?media=xml</code>: Validate entry instance document in the POSTed zip archived file c.xbrl and return structured xml results.</td></tr> <tr><td>/rest/xbrl/validation</td><td>(Alternative syntax) Validate document, file is provided as a parameter (see below).</td></tr> <tr><td style="text-align=right;">Example:</td><td><code>/rest/xbrl/validation?file=c.xbrl&amp;media=xml</code>: Validate entry instance document c.xbrl (in POSTed zip) and return structured xml results.</td></tr>
ru: <Tr> <td> Â </td> <td> Для http POST zip-файла (mime type application / zip), {file} - путь к файлу внутри zip-файла. </Td> </tr > <Tr> <td> Â </td> <td> Для HTTP-запроса GET {файл} может быть URL-адресом WWW и может быть заменен символом "/" на ";" (Но это необязательно). </Td> </tr> <tr><td style="text-align=right;">Например: </td> <td> <code> /rest/xbrl/c.xbrl/validation/xbrl?media=xml </code>: Проверить документ в файле zip архива и вернуть результат в xml. </Td> </tr> <tr><td>/rest/xbrl/validation</td><td> (Альтернативный синтаксис) Проверить документ. Имя файла как параметр (см. Ниже). </Td> </tr> <tr><td style="text-align=right;"> Пример: </td> <td> <code> /rest/xbrl/validation?file=c.xbrl&amp;media=xml </code>: Проверить документ xbrl и вернуть результаты xml. </Td> </tr>

source: <tr><td>Â </td><td>For a browser request or http GET request, {file} may be local or web url, and may have "/" characters replaced by ";" characters (but that is not necessary).</td></tr> <tr><td style="text-align=right;">Example:</td><td><code>/rest/xbrl/c:/a/b/c.xbrl/validation/xbrl?media=xml</code>: Validate entry instance document at c:/a/b/c.xbrl (on local drive) and return structured xml results.</td></tr> <tr><td>Â </td><td>For an http POST of a zip file (mime type application/zip), {file} is the relative file path inside the zip file.</td></tr> <tr><td>/rest/xbrl/validation</td><td>(Alternative syntax) Validate document, file is provided as a parameter (see below).</td></tr> <tr><td style="text-align=right;">Example:</td><td><code>/rest/xbrl/validation?file=c:/a/b/c.xbrl&amp;media=xml</code>: Validate entry instance document at c:/a/b/c.xbrl (on local drive) and return structured xml results.</td></tr>
ru: <Tr> <td> Â </td> <td> Для запроса браузера или HTTP-запроса GET {файл} может быть локальным или веб-адресом и может быть заменен символом "/" на ";" (Но это необязательно). </Td> </tr> <tr><td style="text-align=right;"> Пример: </td> <td> <code> /rest/xbrl/c:/a/b/c.xbrl/validation/xbrl?media= Xml </code>: проверить документа в c: /a/b/c.xbrl (на локальном диске) и вернуть результаты в xml. </Td> </tr> <Tr> <td> Â </td> <td> Для http POST zip-файла (mime type application / zip), {file} - путь к файлу внутри zip-файла. </Td> </tr > <tr><td>/rest/xbrl/validation</td><td> (Альтернативный синтаксис) Проверить документ (см. ниже). </Td> </tr> <tr><td style="text-align=right;"> Пример: </td> <td> <code> /rest/xbrl/validation?file=c:/a/b/c.xbrl&amp;media= Xml </code>: проверить документ в c: /a/b/c.xbrl (на локальном диске) и вернуть результаты в xml. </Td> </tr>

source: <tr><td>/rest/stopWebServer</td><td>Shut down (terminate process after 2.5 seconds delay).</td></tr>
ru: <Tr> <td> /rest/stopWebServer </td> <td> Остановить веб-сервер (завершить процесс после задержки 2,5 секунды). </Td> </tr>

source: <table width="700p"> <tr><th colspan="2">About arelle</th></tr> <tr><td rowspan="12" style="vertical-align:top;"><img src="%s"/></td><td>arelle&reg; version: %s %sbit %s. An open source XBRL platform</td></tr> <tr><td>&copy; 2010-2015 Mark V Systems Limited. All rights reserved.</td></tr> <tr><td>Web site: <a href="http://www.arelle.org">http://www.arelle.org</a>. E-mail support: <a href="mailto:support@arelle.org">support@arelle.org</a>.</td></tr> <tr><td>Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License. You may obtain a copy of the License at <a href="http://www.apache.org/licenses/LICENSE-2.0">http://www.apache.org/licenses/LICENSE-2.0</a>. Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.</td></tr> <tr><td>Includes:</td><tr> <tr><td style="text-indent: 2.0em;">Python&reg; %s.%s.%s &copy; 2001-2010 Python Software Foundation</td></tr> <tr><td style="text-indent: 2.0em;">PyParsing &copy; 2003-2010 Paul T. McGuire</td></tr> <tr><td style="text-indent: 2.0em;">lxml %s.%s.%s &copy; 2004 Infrae, ElementTree &copy; 1999-2004 by Fredrik Lundh</td></tr> <tr><td style="text-indent: 2.0em;">xlrd &copy; 2005-2013 Stephen J. Machin, Lingfo Pty Ltd, &copy; 2001 D. Giffin, &copy; 2000 A. Khan</td></tr> <tr><td style="text-indent: 2.0em;">xlwt &copy; 2007 Stephen J. Machin, Lingfo Pty Ltd, &copy; 2005 R. V. Kiseliov</td></tr> <tr><td style="text-indent: 2.0em;">Bottle &copy; 2011 Marcel Hellkamp</td></tr> </table>
ru: <table width="700p"> <tr><th colspan="2">О Arelle</th></tr> <tr><td rowspan="12" style="vertical-align:top;"><img src="%s"/></td><td>arelle&reg; version: %s %sbit %s. Open source XBRL платформа</td></tr> <tr><td>&copy; 2010-2015 Mark V Systems Limited. All rights reserved.</td></tr> <tr><td>Сайт: <a href="http://www.arelle.org">http://www.arelle.org</a>. E-mail: <a href="mailto:support@arelle.org">support@arelle.org</a>.</td></tr> <tr><td>Лицензия Apache License, Version 2.0 (the "License") <a href="http://www.apache.org/licenses/LICENSE-2.0">http://www.apache.org/licenses/LICENSE-2.0</a>. <tr><td>Включает:</td><tr> <tr><td style="text-indent: 2.0em;">Python&reg; %s.%s.%s &copy; 2001-2010 Python Software Foundation</td></tr> <tr><td style="text-indent: 2.0em;">PyParsing &copy; 2003-2010 Paul T. McGuire</td></tr> <tr><td style="text-indent: 2.0em;">lxml %s.%s.%s &copy; 2004 Infrae, ElementTree &copy; 1999-2004 by Fredrik Lundh</td></tr> <tr><td style="text-indent: 2.0em;">xlrd &copy; 2005-2013 Stephen J. Machin, Lingfo Pty Ltd, &copy; 2001 D. Giffin, &copy; 2000 A. Khan</td></tr> <tr><td style="text-indent: 2.0em;">xlwt &copy; 2007 Stephen J. Machin, Lingfo Pty Ltd, &copy; 2005 R. V. Kiseliov</td></tr> <tr><td style="text-indent: 2.0em;">Bottle &copy; 2011 Marcel Hellkamp</td></tr> </table>

source: <table width="700p"> <tr><th colspan="2">Arelle Web Services</th></tr> <tr><td>/help</td><td>Help web page, web services API.</td></tr> <tr><td>/about</td><td>About web page, copyrights, license, included software.</td></tr> </table>
ru: <table width="700p"> <tr><th colspan="2">Arelle Web Services</th></tr> <tr><td>/help</td><td>ПОмощь по использованию API.</td></tr> <tr><td>/about</td><td>О продукте, авторских правах, лицензии, прилагаемом программном обеспечении</td></tr> </table>

source: <table width="700p"> <tr><th colspan="2">Arelle CGI Services</th></tr> <tr><td>?help</td><td>Help web page, CGI services.</td></tr> <tr><td>?about</td><td>About web page, copyrights, license, included software.</td></tr> <tr><td>REST API</td><td>The Arelle REST API is supported through CGI if the entire CGI path is wildcard-mapped to the arelleCmdLine executable.</td></tr> </table>
ru: <table width="700p"> <tr><th colspan="2">Arelle CGI Services</th></tr> <Tr> <td>?help </td> <td>Помощь по сервисам CGI. </Td> </tr> <Tr> <td>?about </td> <td>О продукте, авторских правах, лицензии, прилагаемом программном обеспечении. </Td> </tr> <Tr> <td> REST API </td> <td>Arelle REST API поддерживается через CGI, если весь путь CGI сопоставлен с шаблоном для исполняемого файла arelleCmdLine. </Td> </tr> </Table>

source: Open File...
fr: Ouvrir le fichier...
ru: Открыть файл...

source: Open Web...
fr: Ouvrir Web...
ru: Открыть веб-адрес...

source: Import File...
fr: Importer un fichier...
ru: Импортировать файл...

source: Import Web...
ru: Импортировать веб-адрес...

source: Save
ru: Сохранить

source: Save As...
ru: Сохранить как...

source: Save DTS Package
fr: Enregistrer le DTS dans un paquet
ru: Сохранить пакет DTS

source: Close
fr: Fermer
ru: Закрыть

source: Quit
fr: Quitter
ru: Выход

source: File
fr: Fichier
ru: Файл

source: Validation
ru: Валидация

source: Validate
fr: Valider
ru: Проверить

source: Disclosure system checks
ru: Проверка систем раскрытия информации

source: Select disclosure system...
ru: Выберите систему раскрытия информации ...

source: Calc Linkbase checks
fr: Vérification de la base de lien de calculs
ru: Проверка Calc Linkbase

source: Infer Decimals in calculations
fr: Inférer les décimales dans les calculs
ru: Вывести десятичные числа в вычислениях

source: Unit Type Registry validation
fr: Validation du registre de types d'unité
ru: Валидация Типов Данных (Unit Type Registry)

source: Parameters...
fr: Paramètres...
ru: Параметры ...

source: Formula
fr: Formule
ru: Формула

source: Compare DTSes...
fr: Comparaison des DTS...
ru: Сравнить DTS...

source: Options...
ru: Настройки...

source: Start
fr: Démarrer
ru: Запустить

source: Stop
fr: Arrêter
ru: Остановить

source: RSS Watch
ru: Просмотр RSS

source: Internet
ru: Интернет

source: Work offline
fr: Travailler hors-ligne
ru: Работать в офлайн

source: Clear cache
fr: Vider le cache
ru: Очистить кэш

source: Manage cache
fr: Gestion du cache
ru: Управление кешем

source: Proxy Server
fr: Serveur mandataire
ru: Прокси-сервер

source: Messages log
fr: Messages de log
ru: Журнал сообщений

source: Clear
fr: Vider
ru: Очистить

source: Save to file
fr: Enregistrer dans le fichier
ru: Сохранить в файл

source: Collect profile stats
ru: Сбор статистики профиля

source: Log profile stats
ru: Журнал статистики профиля

source: Clear profile stats
ru: Очистить статистику профиля

source: Show debug messages
ru: Показать отладочные сообщения

source: Language...
fr: Langue...
ru: Язык...

source: Tools
fr: Outils
ru: Инструменты

source: View
fr: Vue
ru: Посмотр

source: Check for updates
fr: Vérification des mises à jour
ru: Проверить наличие обновлений

source: Manage plug-ins
ru: Управление подключаемыми модулями

source: Manage packages
ru: Управление пакетами

source: About...
fr: À propos...
ru: О программе...

source: Help
fr: Aide
ru: Помощь

source: Ready...
fr: Prêt...
ru: Готово...

source: Open by choosing a local XBRL file, testcase, or archive file
fr: Ouvrir en choisissant un fichier local (fichier XBRL, jeu de test, archive)
ru: Открыть, выбрав локальный файл XBRL, тестовый файл или файл архива

source: Open local file
fr: Ouvrir un fichier local
ru: Открыть локальный файл

source: Enter an http:// URL of an XBRL file or testcase
fr: Entrer une URL http d'un fichier XBRL ou d'un cas de test
ru: Введите URL http:// файла XBRL или тестового файла

source: Open web file
fr: Ouvrir un fichier web
ru: Открыть файл из веб

source: Save file
fr: Enregistrer le fichier
ru: Сохранить файл

source: Saves currently selected local XBRL file
fr: Enregistre le fichier XBRL sélectionné
ru: Сохранить выбранный локальный файл XBRL

source: Closes currently selected instance/DTS or testcase(s)
fr: Fermer l'instance/DTS ou le jeu de tests sélectionné
ru: Закрыть выбранный отчет/DTS или тестовый файл(ы)

source: Find dialog for scope and method of searching
fr: Boîte de dialogie pour la recherche de méthode et de périmètre
ru: Диалог поиска для области и метода поиска

source: Find
fr: Recherche
ru: Найти

source: Validate currently selected DTS or testcase(s)
fr: Valider le DTS ou le cas de test actuellement sélectionné
ru: Подтвердить выбранный DTS или тестовый файл(ы)

source: Compare DTSes
fr: Comparer les DTS
ru: Сравнить DTSы

source: compare two DTSes
fr: Comparer deux DTS
ru: сравнить два DTS

source: Clears the messages log
fr: Vider le journal d'événements
ru: Очистить журнал сообщений

source: Messages Log | Clear
fr: Messages de log | Effacer
ru: Журнал сообщений | Очистить

source: messages
ru: сообщения

source: Copy to clipboard
fr: Copy dans le presse-papier
ru: Скопировать в буфер обмена

source: arelle - Unnamed
fr: arelle - Sans nom
ru: arelle - Без имени

source: Recent files
fr: Fichiers récents
ru: Недавние файлы

source: Recent imports
fr: Importations récentes
ru: Недавний импорт

source: Packages
ru: Пакеты

source: arelle - Unsaved Changes
fr: arelle - Modifications non enregistrées
ru: arelle - Несохраненные изменения

source: Are you sure to close the current instance without saving? (OK will discard changes.)
ru: Вы действительно хотите закрыть текущий отчет без сохранения? (ОК отменит изменения.)

source: arelle - Save HTML-rendered Table
fr: arelle - Enregistrer le fichier HTML de rendu du tableau
ru: arelle - Сохранить таблицу в формате HTML

source: HTML file .htm
fr: Fichier HTML .htm
ru: HTML-файл .htm

source: HTML file .html
fr: Fichier HTML .html
ru: HTML-файл .html

source: arelle - Save Table Layout Model
ru: arelle - Сохранить модель макета таблицы

source: Layout model file .xml
ru: Файл модели макета .xml

source: arelle - Save XBRL Instance or HTML-rendered Table
ru: arelle - Сохранить отчет XBRL или таблицу в формате HTML

source: HTML table .htm
ru: HTML-таблица .htm

source: HTML table .html
ru: HTML-таблица .html

source: XBRL instance .xbrl
ru: Отчет XBRL .xbrl

source: XBRL instance .xml
ru: XBRL отчет .xml

source: arelle - Error
fr: arelle - Erreur
ru: arelle - Ошибка

source: Failed to save {0}: {1}
fr: Échec de l'enregistrement de {0} : {1}
ru: Не удалось сохранить {0}: {1}

source: arelle - Save Instance
fr: arelle - Enregistrer l'instance
ru: arelle - Сохранить отчет

source: arelle - Save Test Results
fr: arelle - Enregistrer les résultats de test
ru: arelle - Сохранить результаты проверки

source: CSV file
fr: fichier CSV
ru: CSV-файл

source: arelle - Save {0}
ru: arelle - Сохранить {0}

source: JSON file
ru: Файл JSON

source: XML file
ru: Файл XML

source: HTML file
fr: Fichier HTML
ru: HTML-файл

source: arelle - Save Formula Result Instance Document
fr: arelle - Enregistrer l'instance de résultat de formule
ru: arelle - Сохранить отчет с результатами выполнения Formula

source: XBRL output instance .xbrl
fr: Sortie XBRL instance .xbrl
ru: Отчет XBRL .xbrl

source: XBRL output instance .xml
fr: Sortie XBRL instance .xml
ru: Отчет XBRL .xml

source: [info] Saved formula output instance to {0}
fr: [info] Instance de formules enregistrée dans {0}
ru: [Info] Сохраненный отчет выполнения formula в {0}

source: arelle - Save what?
ru: arelle - Сохранить что?

source: Nothing has been selected that can be saved. Please select a view pane that can be saved.
ru: Не выбрано ничего, что можно сохранить. Пожалуйста, выберите область просмотра, которую можно сохранить.

source: arelle - Open file
fr: arelle - Ouvrir le fichier
ru: arelle - Открыть файл

source: XBRL files
fr: Fichiers XBRL
ru: Файлы XBRL

source: Loading web-accessed files
fr: Chargement des fichiers web
ru: Загрузка файлов с веб-доступом

source: Please open web-accessed files with the second toolbar button, "Open web file", or the File menu, second entry, "Open web..."
fr: Merci d'ouvrir les fichiers web avec le deuxième bouton de la barre d'outils "'Ouvrir un fichier web", ou depuis le menu "Fichier" > "Ouvrir web..."
ru: Пожалуйста, откройте файлы с веб-доступом (вторая кнопка на панели инструментов): "Открыть веб-ссылку" или меню "Файл" -> "Открыть веб-ссылку"...

source: arelle - Warning
fr: arelle - Avertissement
ru: arelle - Предупреждение

source: Import requires an opened DTS
fr: L'import nécessite un DTS ouvert
ru: Для импорта требуется открытый DTS

source: arelle - Import file into opened DTS
fr: arelle - Importer le fichier dans le DTS ouvert
ru: arelle - импортировать файл в открытый DTS

source: Please import web-accessed files with the File menu, fourth entry, "Import web..."
ru: Импортируйте файлы из веб через меню "Файл", запись "Импортировать веб-ссылку" ...

source: imported
fr: importé
ru: импортировано

source: loaded
fr: chargé
ru: загружено

source: Loading terminated, unrecoverable error
ru: Ошибка, загрузка прекращена

source: Exception loading {0}: {1}, at {2}
fr: Exception lors du chargement de {0}: {1} à {2}
ru: Исключение при загрузке {0}: {1}, в {2}

source: %s in %.2f secs
fr: %s en %.2f s
ru: %s за %.2f сек

source: Initializing table rendering
ru: Инициализация табличного отображения

source: {0}, preparing views
fr: {0}, préparation des vues
ru: {0}, подготовка визуализации

source: not successfully %s in %.2f secs
fr: en échec %s en %.2f secondes
ru: операция не успешна %s за %.2f сек

source: views %.2f secs
fr: vues %.2f secondes
ru: просмотр %.2f secs
