Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: XML declaration encoding %(encoding)s and meta content type encoding %(metaContentTypeEncoding)s must both be utf-8
fr: La déclaration d'encodage %(encoding) and le type d'encodage du méta-contenu %(metaContentTypeEncoding) doivent tous deux être UTF-8
ru: Кодировка XML %(encoding)s и кодировка содержимого метаконтента meta %(metaContentTypeEncoding)s должны быть utf-8

source: Element %(element)s id %(value)s is duplicated
fr: L'élément %(element)s id %(value)s est dupliqué
ru: Элемент %(element)s id %(value)s дублируется

source: Schema targetNamespace length (%(length)s) is over 255 bytes long in utf-8 %(targetNamespace)s
ru: Длина схемы targetNamespace ( %(length)s) более 255 байт в utf-8 %(targetNamespace)s

source: Schema element must have a targetNamespace attribute
fr: L'élément schéma doit avoir un attribut targetNamespace
ru: Элемент схемы должен иметь атрибут targetNamespace

source: Schema element attributeFormDefault must be "unqualified" and elementFormDefault must be "qualified"
fr: L'élément de schéma attributeFormDefault doit être "unqualified" et elementFormDefault doit être "qualified"
ru: Элемент схемы attributeFormDefault должен быть "unqualified", а elementFormDefault должен быть "qualified"

source: Schema element must not have a %(attribute)s attribute
fr: L'élément schéma ne doit pas avoir d'attribut %(attribute)s
ru: Элемент схемы не должен иметь атрибут %(attribute)s

source: Schema contains XSD 1.1 content "%(element)s"
fr: Le schéma contient un contenu XSD 1.1 "%(element)s"
ru: Схема содержит содержимое XSD 1.1 "%(element)s"

source: Schema element %(concept)s %(requirement)s contain attribute %(attribute)s
fr: L'élément de schéma %(concept)s, %(requirement)s contient un attribut %(attribute)s
ru: Элемент схемы %(concept)s %(requirement)s содержит атрибут %(attribute)s

source: MUST
fr: DOIT
ru: ДОЛЖЕН

source: MUST NOT
fr: NE DOIT PAS
ru: НЕ ДОЛЖЕН

source: Schema element %(concept)s contains XSD 1.1 datatype "%(xsdType)s"
fr: L'élément de schéma %(concept)s contient un typde de données XSD 1.1 : %(xsdType)s
ru: Элемент схемы %(concept)s содержит XSD 1.1 тип данных " %(xsdType)s"

source: Schema concept definition is not at the root level: %(concept)s
ru: Определение концепта схемы не находится на корневом уровне: %(concept)s

source: Schema root element %(concept)s %(requirement)s contain attribute %(attribute)s
fr: Dans le schéma, l'élément racine %(concept)s %(requirement)s contient un attribut %(attribute)s
ru: Корневой элемент схемы %(concept)s %(requirement)s содержит атрибут %(attribute)s

source: Schema %(element)s must have minOccurs and maxOccurs
ru: Схема %(element)s должна иметь minOccurs и maxOccurs

source: Tuple concept %(concept)s must have maxOccurs='1'
ru: Концепт кортежа %(concept)s должен иметь maxOccurs='1'

source: Abstract concept %(concept)s must not be a child of a tuple
fr: Le concept abstrait %(concept)s ne doit pas être fils d'un tuple
ru: Абстрактный концепт %(concept)s не должен быть дочерним элементом кортежа

source: Schema %(element)s must have %(attrName)s
ru: Схема %(element)s должен иметь %(attrName)s

source: Schema %(element)s must have %(attrName)s = "1"
ru: Схема %(element)s должен иметь %(attrName)s = "1"

source: %(element)s ref %(ref)s not found
fr: %(element)s ref %(ref)s non trouvé
ru: %(element)s ref %(ref)s не найден

source: xs:attribute must not be used
fr: xs:attribute ne doit pas être utilisé
ru: xs:attribute не должен использоваться

source: Annotation/appinfo record must be be behind schema and before import
fr: L'enregistrement annotation/appinfo doit être derrière le schema et avant l'import
ru: Annotation/appinfo запись должна идти за схемой и перед импортом

source: Annotation/appinfo record must be followed only by import
fr: L'enregistrement annotation/appinfo ne peut être suivi que par un import
ru: За Annotation/appinfo записью должен быть импорт

source: Schema file annotation missing appinfo element must be be behind schema and before import
ru: Отсутствие элемента. Appinfo должно быть за схемой и перед импортом

source: Schema %(element)s has a name length (%(length)s) over 200 bytes long in utf-8, %(name)s.
ru: Схема %(element)s имеет длину имени ( %(length)s) длиной более 200 байт в utf-8, %(name)s.

source: Schema file element must not be used "%(element)s"
ru: Элемент файла схемы не должен использоваться "%(element)s"

source: Element %(element)s is mis-located in schema file
fr: L'élément %(element)s est mal positionné dans le fichier du schéma
ru: Элемент %(element)s неправильно расположен в файле схемы

source: %(element)s not child of xsd:appinfo
fr: %(element)s n'est pas fils de xsd:appinfo
ru: %(element)s не дочерний элемент xsd:appinfo

source: %(element)s missing or invalid %(attribute)s
fr: %(element)s a l'attribut %(attribute)s manquant ou non valide
ru: %(element)s отсутствует или недействителен %(attribute)s

source: Duplicate %(element)s %(attribute)s %(roleURI)s
fr: Élément %(element)s %(attribute)s %(roleURI)s dupliqué
ru: Дубликат %(element)s %(attribute)s %(roleURI)s

source: %(element)s %(roleURI)s not s-equal in %(otherSchema)s
fr: %(element)s %(roleURI)s n'est pas s-égal dans %(otherSchema)s
ru: %(element)s %(roleURI)s не s-equal в %(otherSchema)s

source: %(element)s %(roleURI)s invalid cyclesAllowed %(value)s
fr: %(element)s %(roleURI)s a cyclesAllowed invalide : %(value)s
ru: %(element)s %(roleURI)s недопустимый cyclesAllowed %(value)s

source: ArcroleType is not allowed %(roleURI)s
fr: L'ArcroleType n'est pas autorisé %(roleURI)s
ru: ArcroleType не допускается %(roleURI)s

source: RoleType %(roleURI)s must have a label in lang "nl"
ru: RoleType %(roleURI)s должен иметь метку в lang "nl"

source: Schema %(element)s %(attribute)s length (%(length)s) is over 255 bytes long in utf-8 %(roleURI)s
ru: Схема %(element)s %(attribute)s длина ( %(length)s) превышает 255 байт в utf-8 %(roleURI)s

source: %(element)s %(roleURI)s usedOn %(value)s on has s-equal duplicate
fr: %(element)s %(roleURI)s usedOn %(value)s a un doublon au sens s-equal
ru: %(element)s %(roleURI)s usedOn %(value)s on имеет s-equal дубликат

source: %(element)s usedOn must not be link:calculationLink
fr: %(element)s usedOn doit être link:calculationLink
ru: %(element)s usedOn не должен быть link:calculationLink

source: %(element)s usedOn %(usedOn)s not addressed for role %(role)s
ru: %(element)s usedOn %(usedOn)s не адресуется для роли %(role)s

source: Linkbase element is not prefixed: "%(element)s"
fr: L'élément de base de liens %(element)s n'est pas préfixé
ru: Элемент Linkbase не имеет префикса: "%(element)s"

source: Link:%(elementName)s not child of link:linkbase or xbrli:instance
fr: Lien : %(elementName)s n'est pas enfant de link:linkbase ni xbrli:instance
ru: Ссылка: %(elementName)s не является дочерней link:linkbase или xbrli:instance

source: %(element)s %(refURI)s missing
fr: L'élément %(element)s %(refURI)s est manquant
ru: %(element)s %(refURI)s отсутствует

source: %(element)s is duplicated for %(refURI)s
fr: %(element)s duplqiue %(refURI)s
ru: %(element)s дублируется для %(refURI)s

source: %(element)s %(refURI)s is not defined
fr: %(element)s %(refURI)s n'est pas défini
ru: %(element)s %(refURI)s не определен

source: %(element)s %(refURI)s defined with different URI
ru: %(element)s %(refURI)s определен с другим URI

source: Arcrole %(refURI)s arcroleRef %(xlinkHref)s must be a standard taxonomy
fr: L'rcrole %(refURI)s arcroleRef %(xlinkHref)s doit être une taxonomie standard
ru: Arcrole %(refURI)s arcroleRef %(xlinkHref)s должен быть стандартной таксономией

source: Arcrole %(refURI)s arcroleRef %(xlinkHref)s must not have an %(attribute)s attribute
fr: L'arcrole %(refURI)s arcroleRef %(xlinkHref)s ne peut pas avoir d'attribut %(attribute)s
ru: Arcrole %(refURI)s arcroleRef %(xlinkHref)s не должен иметь атрибут %(attribute)s

source: Role %(refURI)s roleRef %(xlinkHref)s must not have an %(attribute)s attribute
fr: Rôle %(refURI)s roleRef %(xlinkHref)s doit avoir un attribut M(attribute)s
ru: Роль %(refURI)s roleRef %(xlinkHref)s не должна иметь атрибут %(attribute)s

source: Xlink 1.1 simple type is not allowed (xlink:type is missing)
ru: Простой тип Xlink 1.1 недопустим (отсутствует xlink:type)

source: Element %(element)s missing xlink:type="simple"
fr: xlink:type="simple" est manquant pour l'élément %(element)s
ru: В элементе %(element)s отсутствует xlink:type="simple"

source: Element %(element)s missing or invalid href
fr: Le href est manquant ou erronné pour l'élément %(element)s
ru: В элементе %(element)s отсутствует или некорректный href

source: Element %(element)s has empty %(attribute)s
ru: Элемент %(element)s имеет пустой %(attribute)s

source: LinkbaseRef missing arcrole
fr: linkbaseRef devrait avoir un rôle d'arc
ru: В LinkbaseRef отсутсвует arcrole

source: Element %(element)s missing xlink:type="locator"
fr: xlink:type="locator" est manquant pour l'élément %(element)s
ru: В элементе %(element)s отсутствует xlink:type="locator"

source: Element %(element)s missing: %(attribute)s
fr: L'attribut %(attribute)s est manquant pour l'élément %(element)s
ru: В элементе %(element)s отсутствует: %(attribute)s

source: Footnote %(xlinkLabel)s element missing xml:lang attribute
fr: Il manque l'attribut xml:lang à l'élément pied de page %(xlinkLabel)s
ru: В сноске %(xlinkLabel)s отсутствует xml:lang атрибут

source: Label %(xlinkLabel)s element missing xml:lang attribute
fr: Le libellé %(xlinkLabel)s devrait avoir un attribut xml:lang
ru: В метке %(xlinkLabel)s отсутствует xml:lang атрибут

source: Extended link %(element)s must have a standard xlink:role attribute (%(xlinkRole)s)
fr: Le lien étendu %(element)s doit avoir un attribut xlink:role standard (%(xlinkRole)s)
ru: Расширенная ссылка %(element)s должна иметь стандартный атрибут xlink:role (%(xlinkRole)s)

source: Link part %(element)s is not authorized
fr: L'élément %(element)s n'est pas autorisé
ru: Часть ссылки %(element)s не разрешена

source: Extended link %(element)s must have an xlink:role attribute
fr: Le lien étendu %(element)s doit avoir un attribut xlink:role
ru: Расширенная ссылка %(element)s должна иметь атрибут xlink:role

source: Element %(element)s appears to be a resource missing xlink:type="resource"
fr: L'élément %(element)s semble être une resource mais il lui manque xlink:type="resource"
ru: Элемент %(element)s представлен ресурсом, в котором отсутствует xlink:type="resource"

source: Element %(element)s is a custom locator in a standard %(link)s
ru: Элемент %(element)s является обычным локатором в стандартном %(link)s

source: Element %(element)s missing xlink:label
fr: xlink:label est manquant pour l'élément %(element)s
ru: В элементе %(element)s отсутствует xlink:label

source: Element %(element)s missing xlink:%(attribute)s
fr: xlink:%(attribute)s est manquant pour l'élément %(element)s
ru: В элементе %(element)s отсутствует xlink:%(attribute)s

source: TargetRole %(targetRole)s is missing a roleRef
fr: targetRole %(targetRole)s devrait avoir roleRef
ru: В TargetRole %(targetRole)s отсутствует roleRef

source: Element %(element)s %(xlinkLabel)s has unauthorized xml:lang='%(lang)s'
fr: Lélément %(element)s %(xlinkLabel)s a xml:lang='%(lang)s' non autorisé
ru: Элемент %(element)s %(xlinkLabel)s имеет неразрешенный xml:lang='%(lang)s'

source: Element %(element)s is out of order
fr: L'élément %(element)s n
ru: Элемент %(element)s не работает

source: Inline XBRL footnote %(footnoteID)s must be in non-displayable div due to arcrole %(arcrole)s
fr: Pied de page inline XBRL %(footnoteID)s doit être dans un div non visible en raison de son arcrole %(arcrole)s
ru: Inline XBRL сноска %(footnoteID)s должна быть в не отображаемом div из-за arcrole %(arcrole)s

source: Inline XBRL footnote %(footnoteID)s is missing an xml:lang attribute
fr: Pied de page inline XBRL %(footnoteID)s devrait avoir un attribut xml:lang
ru: В InlineXBRL сноске %(footnoteID)s отсутствует атрибут xml:lang

source: Inline XBRL footnotes require an in-scope xml:lang
ru: Inline XBRL сноска требует in-scope xml:lang

source: Inline XBRL fraction may only contain ix:numerator, ix:denominator, or ix:fraction, but contained %(wrongDescendants)s
ru: Inline XBRL-фрагмент может содержать только ix:numerator, ix:denominator, или ix:fraction, но содержит %(wrongDescendants)s

source: Inline XBRL fraction must have one ix:numerator and one ix:denominator when not nil
ru: Inline XBRL должна иметь один ix:numerator и один ix:denominator, когда он не nil

source: Inline XBRL fraction must not have ix:numerator or ix:denominator when nil
ru: Inline XBRL фрагмент не должен иметь ix:numerator или ix:denominator, когда он nil

source: Inline XBRL nil ix:fraction may not have an ancestor ix:fraction
ru: Inline XBRL - нулевая ix:fraction не может иметь предком ix:fraction

source: Inline XBRL fraction term ix:%(name)s may only contain text nodes, but contained %(wrongDescendants)s
ru: Термин Inline XBRL фракции ix:%(name)s может содержать только текстовые узлы, но содержит %(wrongDescendants)s

source: Inline XBRL ix:numerator or ix:denominator without format attribute must be non-negative
ru: Inline XBRL - ix:numerator или ix:denominator без атрибута формата должен быть неотрицательным

source: Warning, Inline XBRL ix:header is recommended to be nested in a <div> with style display:none
ru: Предупреждение. Inline XBRL - ix:header рекомендуется вставлять в <div> со стилем display:none

source: Inline XBRL nil ix:nonFraction may not have an ancestor ix:nonFraction
ru: Inline XBRL nil ix:nonFraction может не иметь первичное событие ix:nonFraction

source: Inline XBRL nil ix:nonFraction may only have one child ix:nonFraction
ru: Inline XBRL nil ix:nonFraction может иметь только один дочерний элемент ix:nonFraction

source: Inline XBRL nested ix:nonFraction must have matching format, scale, and unitRef properties
ru: Inline XBRL вложенное ix:nonFraction должно иметь соответствующие свойства формат, масштаб и unitRef

source: Inline XBRL ix:nonFraction without format attribute must be non-negative
ru: Inline XBRL ix:nonFraction без атрибута формата должен быть неотрицательным

source: Inline XBRL non-nil tuples without ix:fraction, ix:nonFraction, ix:nonNumeric or ix:tuple descendants require a tupleID
ru: Inline XBRL ненулевой кортеж без подчиненных ix:fraction, ix:nonFraction, ix:nonNumeric или ix:tuple требуют tupleID

source: Extended element %(element)s must be the same as %(element2)s
fr: L'élément étendu %(element)s doit être le même que %(element2)s
ru: Расширенный элемент %(element)s должен быть таким же, как %(element2)s

source: Loc element %(element)s may not be contained in a linkbase with %(element2)s
fr: L'élément loc %(element)s ne peut pas être contenu dans la même base de liens que %(element2)s
ru: Элемент loc %(element)s не может содержаться в linkbase с %(element2)s

source: %(element)s is missing an xlink:role
fr: Il manque un xlink:role à %(element)s
ru: в %(element)s отсутствует xlink:role

source: Resource %(xlinkLabel)s role %(role)s is not a standard taxonomy role
fr: Resource %(xlinkLabel)s, le rôle %(role) n'est pas un rôle standard de taxonomy
ru: Ресурс %(xlinkLabel)s - роль %(role)s не является стандартной таксономической ролью

source: Reference %(xlinkLabel)s has unauthorized part element %(element)s
ru: Ссылка %(xlinkLabel)s имеет некорректную часть элемента %(element)s

source: Reference %(xlinkLabel)s is missing an id attribute
fr: La référence %(xlinkLabel)s devrait avoir un attribut id
ru: В ссылке %(xlinkLabel)s отсутствует атрибут id

source: Reference %(xlinkLabel)s has duplicated id %(id)s also in linkbase %(otherLinkbase)s
fr: La référence %(xlinkLabel)s a un id dupliqué %(id)s également dans %(otherLinkbase)s
ru: Ссылка %(xlinkLabel)s имеет дубли ID %(id)s также в linkbase %(otherLinkbase)s

source: Resource element %(element)s may not be contained in a linkbase with %(element2)s
ru: Элемент ресурса %(element)s не может содержаться в linkbase с %(element2)s

source: Arc from %(xlinkFrom)s to %(xlinkTo)s priority %(priority)s must be less than 10
fr: L'arc de %(xlinkFrom)s vers %(xlinkTo)s a une priorité de %(priority)s qui doit être inférieure ou égale à 9
ru: Arc из %(xlinkFrom)s в %(xlinkTo)s - приоритет %(priority)s должен быть меньше 10

source: Arc from %(xlinkFrom)s to %(xlinkTo)s priority %(priority)s is not an integer
fr: L'arc de %(xlinkFrom)s vers %(xlinkTo)s a une priorité de %(priority)s qui doit être un entier
ru: Arc от %(xlinkFrom)s до %(xlinkTo)s - приоритет %(priority)s не является целым числом

source: PresentationArc from %(xlinkFrom)s to %(xlinkTo)s must have an order
fr: L'arc de présentation de %(xlinkFrom)s vers %(xlinkTo)s doit avoir un ordre
ru: PresentationArc из %(xlinkFrom)s в %(xlinkTo)s должен иметь порядок

source: CalculationArc from %(xlinkFrom)s to %(xlinkTo)s must have an order
fr: CalculationArc de %(xlinkFrom)s vers %(xlinkTo)s doit avoir un ordre
ru: CalculationArc из %(xlinkFrom)s в %(xlinkTo)s должен иметь порядок

source: CalculationArc from %(xlinkFrom)s to %(xlinkTo)s weight %(weight)s must be 1 or -1
fr: CalculationArc de %(xlinkFrom)s vers %(xlinkTo)s : le poids %(weight)s doit être 1 ou -1
ru: CalculationArc из %(xlinkFrom)s к %(xlinkTo)s вес %(weight)s должtн быть 1 или -1

source: CalculationArc from %(xlinkFrom)s to %(xlinkTo)s must have an weight (value error in "%(weight)s")
ru: CalculationArc из %(xlinkFrom)s в %(xlinkTo)s должен иметь вес (ошибка значения в "%(weight)s")

source: DefinitionArc from %(xlinkFrom)s to %(xlinkTo)s must have an order
fr: Le DefinitionArc de %(xlinkFrom)s vers %(xlinkTo)s doit avoir un ordre
ru: DefinitionArc из %(xlinkFrom)s в %(xlinkTo)s должtн иметь порядок

source: DefinitionArc from %(xlinkFrom)s to %(xlinkTo)s has unauthorized arcrole %(arcrole)s
fr: Le DefinitionArc de %(xlinkFrom)s vers %(xlinkTo)s a un rôle %(arcrole)s non permis
ru: DefinitionArc из %(xlinkFrom)s в %(xlinkTo)s имеет неразрешенный arcrole %(arcrole)s

source: ReferenceArc from %(xlinkFrom)s to %(xlinkTo)s has an order
fr: referenceArc de %(xlinkFrom) vers %(xlinkTo)s a un ordre
ru: ReferenceArc из %(xlinkFrom)s в %(xlinkTo)s имеет порядок

source: %(arc)s must not contain use='prohibited'
fr: L'arc %(arc)s ne doit pas avoir l'attribut use='prohibited'
ru: %(arc)s не должно содержать use='prohibited'

source: Arc element %(element)s may not be contained in a linkbase with %(element2)s
fr: L'élément étendu %(element)s ne doit pas être contenu dans la même base de liens que que %(element2)s
ru: Элемент arc %(element)s не может содержаться в linkbase с %(element2)s

source: labelArc may not be contain order (%(order)s)
fr: Le labelArc ne peut pas contenir d'attribut ordre (%(order)s)
ru: labelArc может не содержать порядок (%(order)s)

source: %(fileType)s element %(element)s must not have custom namespace %(namespace)s
fr: %(fileType)s l'élément %(element)s ne doit pas avoir d'espace de nommage personnalisé xmlns:%(prefix)s
ru: %(fileType)s элемент %(element)s не должен иметь собственное пространство имен %(namespace)s

source: %(fileType)s element %(element)s must not have %(prefix)s:%(localName)s
fr: %(fileType)s l'élément %(element)s ne doit pas avoir de %(prefix)s:%(localName)s
ru: %(fileType)s элемент %(element)s не должен иметь %(prefix)s:%(localName)s

source: %(fileType)s element %(element)s must not have xmlns:%(prefix)s
fr: %(fileType)s l'élément %(element)s ne doit pas avoir xmlns:%(prefix)s
ru: %(fileType)s элемент %(element)s не должен иметь xmlns:%(prefix)s

source: RoleType %(roleURI)s missing id attribute
fr: Le type de rôle %(roleType)s doit avoir l'attribut id
ru: В RoleType %(roleURI)s отсуствует атрибут id

source: Loc %(xlinkLabel)s has unauthorized role attribute
fr: loc %(xlinkLabel)s a un attribut de rôle non autorisé
ru: Loc %(xlinkLabel)s имеет неразрешенную роль атрибута

source: Documentation element must not be used: %(value)s
fr: L'élément documentation ne doit pas êter utilisé : %(value)
ru: Элемент документа не должен использоваться: %(value)s

source: Linkbase element must not have schemaLocation entry for %(schemaLocation)s
fr: L'élément de base de liens %(element)s ne doit pas avoir de schemaLocation pour %(schemaLocation)s
ru: Элемент Linkbase не должен иметь schemaLocation запись для %(schemaLocation)s

source: Linkbase element %(element)s must not have attribute %(attribute)s
fr: L'élément de base de liens %(element)s ne doit pas avoir d'attribut %(attribute)s
ru: Элемент linkbase %(element)s не должен иметь атрибут %(attribute)s

source: Linkbase element %(element)s must not have attribute xlink:%(attribute)s
fr: L'élément de base de liens %(element)s doit avoir un attribut xlink:%(attribute)s
ru: Элемент linkbase %(element)s не должен иметь атрибут xlink:%(attribute)s

source: %(fileType)s must have only one comment node before schema element: "%(value)s"
fr: %(fileType)s ne peut avoir qu'un noud commentaire avant l'élémentchéma "%(value)s"
ru: %(fileType)s должен иметь только один узел комментария перед элементом схемы: "%(value)s"

source: Simple link role %(xlinkRole)s is empty
fr: Le rôle de lien simple %(xlinkRole)s est vide
ru: Простая роль ссылки %(xlinkRole)s пустая

source: Standard extended link role %(xlinkRole)s is empty
fr: Le rôle étendu standard %(xlinkRole)s est vide
ru: Стандартная расширенная ссылка %(xlinkRole)s пуста

source: Role %(xlinkRole)s is not absolute
fr: Le rôle %(xlinkRole)s n'est pas absolu
ru: Роль %(xlinkRole)s не является абсолютной

source: Generic link role %(xlinkRole)s is not absolute
fr: Le rôle de lien générique %(xlinkRole)s n'est pas absolu
ru: Роль общей ссылки %(xlinkRole)s не является абсолютной

source: Generic resource role %(xlinkRole)s is not absolute
fr: Le rôle de ressource générique %(xlinkRole)s n'est pas absolu
ru: Общая роль ресурса %(xlinkRole)s не является абсолютной

source: Standard role %(xlinkRole)s is not defined for %(element)s
ru: Стандартная роль %(xlinkRole)s не определена для %(element)s

source: Role %(xlinkRole)s is missing a roleRef
fr: Le rôle %(xlinkRole)s devrait avoir un roleRef
ru: В роли %(xlinkRole)s отсутствует roleRef

source: Generic link role %(xlinkRole)s is missing a roleRef
fr: Le rôle de lien générique %(xlinkRole)s devrait avoir roleRef
ru: В роли общей ссылки %(xlinkRole)s отсутствует roleRef

source: Generic resource role %(xlinkRole)s is missing a roleRef
fr: Le rôle de ressource générique %(xlinkRole)s devrait avoir roleRef
ru: В общей роли ресурса %(xlinkRole)s отсутствует roleRef

source: Role %(xlinkRole)s missing usedOn for %(element)s
fr: Le rôle %(xlinkRole)s devrait avoir usedOn pour l'élément %(element)s
ru: В роли %(xlinkRole)s отсутствует usedOn для %(element)s

source: Generic link role %(xlinkRole)s missing usedOn for {2}
fr: Le rôle de lien générique %(xlinkRole)s devrait avoir usedOn pour {2}
ru: Роль общей ссылки %(xlinkRole)s отсутствует usedOn для {2}

source: Generic resource role %(xlinkRole)s missing usedOn for %(element)s
fr: Le rôle de ressource générique %(xlinkRole)s devrait avoir usedOn pour l'élément %(element)s
ru: В общей роли ресурса %(xlinkRole)s отсутствует usedOn для %(element)s

source: Arcrole on %(element)s is empty
fr: L'arcrole on %(element)s est vide
ru: Arcrole на %(element)s пуст

source: Arcrole %(arcrole)s is not absolute
fr: L'arcrole %(arcrole)s n'est pas absolu
ru: Arcrole %(arcrole)s не является абсолютным

source: Generic arc arcrole %(arcrole)s is not absolute
fr: Le rôle d'arc générique %(arcrole)s n'est pas absolu
ru: Общая arc arcrole %(arcrole)s не является абсолютной

source: Arcrole %(arcrole)s is missing an arcroleRef
fr: L'arcrole %(arcrole)s devrait avoir arcroleRef
ru: Arcrole %(arcrole)s - отсутствует arcroleRef
