Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: Instance fact %(element)s missing schema definition
fr: Le fait d'instance %(element)s devrait avoir une définition de schéma

source: invalid cast from {0} to xs:{1}
fr: Conversion de type automatique de {0} vers xs:{1} non valide

source: Invalid entity identifier scheme: %(scheme)s
fr: L'identifiant d'entité a un attribut scheme non valide : %(scheme)s

source: Label Role
fr: Rôle libellé

source: Lang
fr: Langue

source: Loading Unit Type Registry
fr: Chargement du registre des types d'unité

source: Locator href attribute missing or malformed in non-standard extended link
fr: L'attribut href du locator est manquant ou mal formé dans le lien étendu non standard

source: Locator href attribute missing or malformed in standard extended link
fr: L'attribut href du locator est manquant ou mal formé dans le lien étendu standard

source: lxml schema validating
fr: Validation du schéma par lxml

source: lxml validation done
fr: Valdiation lxml terminée

source: lxml validator loading xml schema
fr: Le valideur lxml charge le schéma xml

source: No Prefix
fr: Aucun préfixe

source: Number of arguments do not match signature arity.
fr: Le nombre d'arguments ne correspond pas à l'arité de la fonction.

source: Prec
fr: Précision

source: precision
fr: précision

source: Presentation linkrole order number %(order)s of %(linkrole)s also used in %(otherLinkrole)s
fr: L'ordre n°%(order)s du rôle de lien présentation %(linkrole)s est également utilisé pour %(otherLinkrole)s

source: rangeVar('{0}' in {1})
fr: rangeVar('{0}' dans {1})

source: Relationship from %(xlinkFrom)s to %(xlinkTo)s should have an %(element)s target
fr: La relation de %(xlinkFrom)s vers %(xlinkTo)s devrait avoir une cible %(element)s

source: ReportRef xlink:arcrole %(arcrole)s is invalid
fr: reportRef xlink:arcrole %(arcrole) n'est pas valide

source: ReportRef xlink:arcrole is missing
fr: reportRef xlink:arcrole est manquant

source: ReportRef xlink:type %(xlinkType)s must be "simple"
fr: reportRef xlink:type %(xlinkType)s doit être "simple"

source: Save unsaved changes?
fr: Enregistrement les modifications?

source: Save...
fr: Enregistrer...

source: Saved {0} items to {1}
fr: {0} items enregistrés dans {1}

source: Saved output html to %(file)s
fr: Sortie enregistrer en HTML dans %(file)s

source: Schema has %(annotationsCount)s xs:annotation elements, only 1 allowed
fr: Le schéma a %(annotationsCount)s éléments xs:annotation, seulement 1 autorisé

source: schema loaded in %.2f secs
fr: schéma chargé en %.2f secondes

source: Schema validate (experimental)
fr: Validation du schéma (expérimental)

source: schema validated in %.3f secs
fr: schéma validé en %.3f secondes

source: Segment of context Id %(context)s has disallowed content: %(content)s
fr: Le segment du context %(context)s a un contenu interdit : (content)s

source: Seq
fr: Séquence

source: start web server on host:port for REST and web access, e.g., --webserver locahost:8080.
fr: démarre le serveur sur host:port pour les services REST et l'interface web, ex: --webserver localhost:8080

source: The source and target of an arc must be in the DTS from %(elementFrom)s to %(elementTo)s, in linkrole %(linkrole)s, arcrole %(arcrole)s
fr: La source et la cible d'un arc doivent être dans le DTS de %(elementFrom)s vers %(elementTo)s, dans le linkrole %(linkrole)s, arcrole %(arcrole)s

source: Typed dimension %(concept)s domain element %(typedDomainElement)s has disallowed complex content
fr: Dimension typée %(concept)s, l'élément du domaine %(typedDomainElement)s a un contenu complex non permis

source: Validate testcase
fr: Valider le cas de test

source: Validate testcases
fr: Validation des jeux de tests

source: Validate{0}{1}
fr: Validation {0}{1}

source: Value operation {0} incompatible arguments {1} and {2}
fr: Opération valeur {0}, arguments incompatilbles : {1} et {2}

source: Variable set %(xlinkLabel)s Exception: %(error)s
fr: Ensemble de variables : %(xlinkLabel)s Exception : %(error)s

source: viewing tuples
fr: voir les tuples

source: WARNING: skipping multiple-document entry point (not supported)
fr: ATTENTION: passe les points d'entrée multi-documents (non supporté)

source: web caching {0}: {1:.0f} KB
fr: mise en cache web {0} : {1:.0f} ko

source: web caching {0}: {1:.0f} of {2:.0f} KB
fr: mise en cache web {0} : {1:.0f} ko sur {2:.0f} ko

source: Write calculation linkbase into CSVFILE
fr: Enregistre la base de liens de calcul dans CSVFILE

source: Write concepts into CSVFILE
fr: Enregistre les conepts dans CSVFILE

source: Write dimensions (of definition) linkbase into CSVFILE
fr: Enregistre la base de liens des dimensions dans CSVFILE

source: Write DTS tree into CSVFILE
fr: Enregistre l'arbre du DTS dans CSVFILE

source: Write fact list into CSVFILE
fr: Enregistre la liste de faits dans CSVFILE

source: Write presentation linkbase into CSVFILE
fr: Enregistre la base de liens de présentation dans CSVFILE

source: Write test report of validation (of test cases) into CSVFILE
fr: Enregistre le rapport de validation (des cas de test) dans CSVFILE

source: Xbrl file
fr: Fichier XBRL
