Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: Variable set %(xlinkLabel)s, source %(name)s is not in the variable set
fr: Ensemble de varables : %(xlinkLabel)s, la source %(name)s n'est pas dans l'ensemble de variables
ru: Набор переменных %(xlinkLabel)s, источник %(name)s не входит в набор переменных

source: Variable set %(xlinkLabel)s, source %(name)s not a factVariable but is a %(element)s
fr: Ensemble de varables : %(xlinkLabel)s, la source %(name)s n'est pas une factVariable mais un %(element)s
ru: Набор переменных %(xlinkLabel)s, источник %(name)s не является factVariable, но является %(element)s

source: Formula %(xlinkLabel)s: source %(name)s is a fact variable that has a fallback value
fr: Formule %(xlinkLabel)s, la source %(name)s est une variable de fait qui a une valeur de repli
ru: Формула %(xlinkLabel)s: источник %(name)s - это переменная факта, которая имеет fallback значение

source: Formula %(xlinkLabel)s: formula source %(name)s is a fact variable that binds as a sequence
fr: Formule %(xlinkLabel)s, la source %(name)s est une variable de fait qui se lie comme une séquence
ru: Формула %(xlinkLabel)s: источник формулы %(name)s - это переменная факта, которая связывается как последовательность

source: RuleAxis %(xlinkLabel)s dimension attribute %(dimension)s on the %(dimensionType)s dimension rule contains a QName that does not identify an (dimensionType)s dimension.
ru: Атрибут измерения RuleAxis %(xlinkLabel)s %(dimension)s в правиле измерения %(sizeType)s содержит QName, которое не идентифицирует измерение %(dimensionType)s.

source: RuleAxis rule %(xlinkLabel)s contains a member QName %(memQname)s which is not in the DTS.
ru: Правило RuleAxis %(xlinkLabel)s содержит элемент QName %(memQname)s, который не находится в DTS.

source: RuleAxis %(xlinkLabel)s aspect model, %(aspectModel)s, includes an rule for aspect not defined in this aspect model: %(undefinedAspects)s
ru: Аспектная модель RuleAxis %(xlinkLabel)s, %(aspectModel)s, включает правило для аспекта, не определенного в модели аспекта: %(undefinedAspects)s

source: RuleAxis rule %(xlinkLabel)s contains a @source attribute %(qnSource)s which is not applicable to table rule axes.
ru: Правило RuleAxis %(xlinkLabel)s содержит атрибут @source %(qnSource)s, который не применим к осям таблицы.

source: RuleAxis rule %(xlinkLabel)s contains a concept QName %(conceptQname)s which is not in the DTS.
ru: Правило RuleAxis %(xlinkLabel)s содержит концепт QName %(conceptQname)s, который не находится в DTS.

source: %(axis)s rule %(xlinkLabel)s contains a %(qnameAttr)s QName %(qname)s which is not in the DTS.
ru: %(axis)s правило %(xlinkLabel)s содержит значение %(qnameAttr)s QName %(qname)s, которое не находится в DTS.

source: Message %(xlinkLabel)s: unbalanced %(character)s character(s) in: %(text)s
fr: Message %(xlinkLabel)s: Il n'y a pas aurant de caractères ouvrants et fermants pour '%(character)s' dans la chaîne : %(text)s
ru: Сообщение %(xlinkLabel)s: неустойчивый символ %(character)s в: %(text)s

source: Message %(xlinkLabel)s is missing an effective value for xml:lang: %(text)s.
ru: В сообщении %(xlinkLabel)s отсутствует корректное значение для xml:lang: %(text)s.

source: Undefined variable dependency in message %(xlinkLabel)s, %(name)s
fr: Dépendance de variable non défine dans le message %(xlinkLabel)s, %(name)s
ru: Неопределенная зависимость переменной в сообщении %(xlinkLabel)s, %(name)s

source: Existence Assertion depends on evaluation variable in message %(xlinkLabel)s, %(name)s
ru: Existence Assertion зависит от переменной оценки в сообщении %(xlinkLabel)s, %(name)s

source: Inconsistent duplicate facts %(fact)s context %(contextID)s and %(contextID2)s.
fr: Fait %(fact)s en doublon non cohérent dans les contextes %(contextID)s et %(contextID2)s.
ru: Непоследовательные повторяющиеся факты %(fact)s. Контекст %(contextID)s и %(contextID2)s.

source: Numeric fact %(fact)s of context %(contextID)s has a negative value '%(value)s' but label does not have a bracketed negative term (using parentheses): %(label)s
ru: Числовой факт %(fact)s контекста %(contextID)s имеет отрицательное значение '%(value)s', но метка не имеет заключенного в скобки отрицательного члена (с использованием круглых скобок): %(label)s

source: Period Start Date (uk-bus:StartDateForPeriodCoveredByReport) is missing.
ru: Дата начала периода (uk-bus:StartDateForPeriodCoveredByReport) отсутствует.

source: Period Start Date (uk-bus:StartDateForPeriodCoveredByReport) must be 6 April 2008 or later.
ru: Начало периода (uk-bus:StartDateForPeriodCoveredByReport) должен быть 6 апреля 2008 года или позже.

source: Company Name (uk-bus:EntityCurrentLegalOrRegisteredName) is missing.
ru: Название компании (uk-bus:EntityCurrentLegalOrRegisteredName) отсутствует.

source: Period End Date (uk-bus:EndDateForPeriodCoveredByReport) is missing.
ru: Дата окончания периода (uk-bus:EndDateForPeriodCoveredByReport) отсутствует.

source: Balance Sheet Date (uk-bus:BalanceSheetDate) is missing.
ru: Дата баланса (uk-bus:BalanceSheetDate) отсутствует.

source: Dormant/non-dormant indicator (uk-bus:EntityDormant) is missing.
ru: Отсутствует индикатор (uk-bus:EntityDormant).

source: Trading/non-trading indicator (uk-bus:EntityTrading) is missing.
ru: Отсутствует торговый/неторговый индикатор (uk-bus:EntityTrading).

source: Date of signing Directors Report (uk-direp:DateSigningDirectorsReport) is missing.
ru: Дата подписания отчета менеджмента (uk-direp:DateSigningDirectorsReport) отсутствует.

source: Name of Director signing Directors Report (uk-direp:DirectorSigningReport) is missing.
ru: Имя директора, подписавшего отчет директоров (uk-direp:DirectorSigningReport) отсутствует.

source: Balance Sheet Date of Approval (uk-gaap:DateApprovalAccounts) is missing OR Balance Sheet Date of Approval (uk-ifrs:DateAuthorisationFinancialStatementsForIssue) is missing.
ru: Дата утверждения балансового отчета (uk-gaap:DateApprovalAccounts) отсутствует ИЛИ Дата утверждения балансового отчета (uk-ifrs:DateAuthorisationFinancialStatementsForIssue) отсутствует.

source: Name of Director Approving Balance Sheet (uk-gaap:NameDirectorSigningAccounts) is missing OR Name of Director Approving Balance Sheet (ifrs:ExplanationOfBodyOfAuthorisation) is missing.
ru: Имя директора, подписавшего балансовый отчет (uk-gaap:NameDirectorSigningAccounts) отсутствует ИЛИ имя Утверждающего балансовый отчет Директора (ifrs:ExplanationOfBodyOfAuthorization) отсутствует.

source: Profit or Loss for the period (uk-gaap:ProfitLossForPeriod OR ifrs:ProfitLoss) is missing.
ru: Прибыль или убыток за период (uk-gaap:ProfitLossForPeriod ИЛИ ifrs:ProfitLoss) отсутствует.

source: Company Reference Number (uk-bus:UKCompaniesHouseRegisteredNumber) is missing.
ru: Reference номер компании (uk-bus:UKCompaniesHouseRegisteredNumber) отсутствует.

source: Context entity identifier (%(entityIdentifier)s) does not match Company Reference Number (uk-bus:UKCompaniesHouseRegisteredNumber) Location: Accounts (context id %(contextID)s).
ru: Контекст кода компании (%(entityIdentifier)s) не соответствует Reference номеру компании (uk-bus:UKCompaniesHouseRegisteredNumber). Расположение: учетные записи (код контекста %(contextID)s).

source: Fact counts mismatch, testcase instance %(foundFactCount)s, infoset instance %(expectedFactCount)s
ru: Кол-во фактов не совпадает, тестовый экземпляр %(foundFactCount)s, экземпляр инфонабора %(expectedFactCount)s

source: Fact %(factNumber)s mismatch %(concept)s
ru: Факт %(factNumber)s несоответствие %(concept)s

source: Fact %(factNumber)s periodType mismatch %(concept)s expected %(expectedPeriodType)s found %(foundPeriodType)s
ru: Факт %(factNumber)s тип периода periodType не соответствует %(concept)s. Ожидается %(expectedPeriodType)s, найден %(foundPeriodType)s

source: Fact %(factNumber)s balance mismatch %(concept)s expected %(expectedBalance)s found %(foundBalance)s
ru: Факт %(factNumber)s. Баланс не соответствует (%) %(concept)s. Ожидается %(expectedBalance)s, найден %(foundBalance)s

source: Fact %(factNumber)s inferred decimals mismatch %(concept)s expected %(expectedDecimals)s found %(inferredDecimals)s
ru: Факт %(factNumber)s. Десятичный знак не соответствует %(concept)s. Ожидается %(expectedDecimals)s, найдены %(inferredDecimals)s

source: Fact %(factNumber)s inferred precision mismatch %(concept)s expected %(expectedPrecision)s found %(inferredPrecision)s
ru: Факт %(factNumber)s. Точность не соответствует %(concept)s. Ожидается %(expectedPrecision)s, найдено %(inferredPrecision)s

source: Arc fromPath not found: %(fromPath)s
ru: Arc fromPath не найдена: %(fromPath)s

source: Label expected='%(expectedLabel)s', found='%(foundLabel)s'
ru: Ожидаемая метка='%(expectedLabel)s', найдена='%(foundLabel)s'

source: Reference inner text expected='%(expectedRef)s, found='%(foundRef)s'
ru: Ожидается внутренний текст ссылки='%(expectedRef)s, найден='%(foundRef)s '

source: %(linkType)s not found containing '%(text)s' linkRole %(linkRole)s
ru: %(LinkType)s не найден с содержанием '%(text)s' linkRole %(linkRole)s

source: Arc toPath not found: %(toPath)s
ru: Arc toPath не найдена: %(toPath)s

source: Arc not found: from %(fromPath)s, to %(toPath)s, role %(arcRole)s, linkRole $(extRole)s
ru: Arc не найдена: от %(fromPath)s, до %(toPath)s, роль %(arcRole)s, ссылка $(extRole)s

source: Fact %(sPointer)s mismatch Qname, expected %(qnElt)s, observed %(factQname)s
ru: Факт %(sPointer)s не соответствует Qname. Ожидается %(qnElt)s, найден %(factQname)s

source: Fact %(sPointer)s has no context: %(qnElt)s
ru: Факт %(sPointer)s не имеет контекста: %(qnElt)s

source: Fact %(sPointer)s (qnElt)s dimension mismatch %(qnDim)s
ru: Факт %(sPointer)s (qnElt). Несоответствие измерения %(qnDim)s

source: Fact %(sPointer)s (qnElt)s dimensions count mismatch
ru: Факт %(sPointer)s (qnElt) - не соответствует кол-во измерений

source: Invalid entity fact dimensions infoset sPointer: %(test)s, error details: %(error)s
ru: Недопустимые значения измерений факта объекта sPointer: %(test)s, информация об ошибке: %(error)s

source: Infoset expecting %(elt1)s found %(elt2)s source line %(elt1line)s comparison line %(elt2line)s
ru: Инфонабор ожидается %(elt1)s, найден %(elt2)s, исходная строка %(elt1line)s, сравнительная строка %(elt2line)s

source: Infoset comparison element %(elt)s expecting text %(text1)s found %(text2)s source line %(elt1line)s comparison line %(elt2line)s
ru: Элемент сравнения инфонабора %(elt)s. Ожидаемый текст %(text1)s, найдено %(text2)s, строка исходного кода %(elt1line)s, строка сравнения %(elt2line)s

source: Infoset comparison element %(elt)s expecting attributes %(attrs1)s found %(attrs2)s source line %(elt1line)s comparison line %(elt2line)s
ru: Элемент сравнения инфонабора %(elt)s. Ожидаемые атрибуты %(attrs1)s, найдено %(attrs2)s, строка источника %(elt1line)s, строка сравнения %(elt2line)s

source: Infoset comparison file %(xmlfile)s error %(error)s
ru: Файл сравнения инфонабора %(xmlfile)s. Ошибка %(error)s

source: Validating for Unit Type Registry
fr: Validation du registre des types d'unité
ru: Проверка для реестра типа элементов (Unit Type Registry)

source: Unit %(unitID)s disallowed on fact %(element)s of type %(typeName)s
fr: L'unité %(unitID)s n'est pas autorisée pour le fait %(element)s de type %(typeName)s
ru: Единица %(unitID)s запрещена к факту %(element)s типа %(typeName)s

source: %(dts)s is missing or not loaded
fr: %(dts)s est manquante ou non chargée
ru: %(dts)s отсутствует или не загружен

source: %(dts)s has errors: %(error)s
ru: %(dts)s имеет ошибки: %(error)s

source: AssignmentRef %(assignmentRef)s does not reference an assignment
fr: L'assignmentRef %(assignmentRef)s ne référence pas une affectation
ru: AssignmentRef %(assignRef)s не ссылается на назначение

source: NamespaceRename fromURI %(uri)s does not reference a schema in fromDTS
fr: namespaceRename fromURI %(uri)s ne référence pas un schéma du DTS
ru: NamespaceRename fromURI %(uri)s не ссылается на схему в fromDTS

source: NamespaceRename toURI %(uri)s does not reference a schema in toDTS
fr: namespaceRename toURI %(uri)s ne référence pas un schéma du DTS
ru: NamespaceRename toURI %(uri)s не ссылается на схему в toDTS

source: RoleChange fromURI %(uri)s does not reference a roleType in fromDTS
fr: roleChange fromURI %(uri)s ne référence pas un roleType dans fromDTS
ru: RoleChange fromURI %(uri)s не ссылается на тип roleType в fromDTS

source: RoleChange toURI %(uri)s does not reference a roleType in toDTS
fr: roleChange fromURI %(uri)s ne référence pas un roleType dans toDTS
ru: RoleChange toURI %(uri)s не ссылается на roleType в toDTS

source: %(event)s fromConcept %(concept)s does not reference a concept in fromDTS
fr: %(event)s fromConcept %(concept)s ne référence pas un concept dans fromDTS
ru: %(event)s fromConcept %(concept)s не ссылается на концепт в fromDTS

source: %(event)s toConcept %(concept)s does not reference a concept in toDTS
fr: %(event)s toConcept %(concept)s ne référence pas un concept dans toDTS
ru: %(event)s toConcept %(concept)s не ссылается на концепт в toDTS

source: %(event)s toConcept %(concept)s physical attribute conflicts with presence in fromDTS
ru: %(event)s toConcept %(concept)s. Физический атрибут конфликтует с присутствующим в fromDTS

source: %(event)s toConcept %(concept)s physical attribute conflicts with presence in toDTS
ru: %(event)s toConcept %(concept)s. Физический атрибут конфликтует с присутствующим в toDTS

source: %(action)s %(event)s fromConcept %(concept)s does not reference a concept in fromDTS
fr: %(action)s %(event)s fromConcept %(concept)s ne référence pas un concept de fromDTS
ru: %(action)s %(event)s fromConcept %(concept)s не ссылается на концепт в fromDTS

source: Child
fr: Enfant
ru: Дочерний элемент

source: %(action)s %(event)s fromConcept %(concept)s must be defined as a tuple
fr: %(action)s %(event)s fromConcept %(concept)s doit être défini comme tuple
ru: %(action)s %(event)s fromConcept %(concept)s должно быть определено как кортеж (tuple)

source: %(action)s %(event)s fromResource %(resource)s does not reference a resource in fromDTS
fr: %(action)s %(event)s fromResource %(resource)s n'a pas de référence ressource dans fromDTS
ru: %(action)s %(event)s fromResource %(resource)s не ссылается на ресурс в fromDTS

source: %(action)s %(event)s fromResource %(resource)s for %(concept)s in fromDTS does not have expected link, arc, or label elements
fr: %(action)s %(event)s fromResource %(resource)s pour %(concept)s dans fromDTS n'a pas l'élément attendu de type lien, arc, or libellé
ru: %(action)s %(event)s fromResource %(resource)s для %(concept)s в fromDTS не имеет ожидаемых элементов ссылки, ark или метки

source: %(action)s %(event)s fromResource %(resource)s does not have a label relationship to {3} in fromDTS
fr: %(action)s %(event)s fromResource %(resource)s n'a pas de relation libellé avec {3} dans fromDTS
ru: %(action)s %(event)s fromResource %(resource)s не имеет отношения метки к {3} в fromDTS

source: %(action)s %(event)s fromResource %(resource)s for %(concept)s in fromDTS does not have expected link, arc, or label elements
fr: %(action)s %(event)s fromResource %(resource)s for %(concept)s dans fromDTS n'a pas l'élément attendu de type lien, arc, ou libellé
ru: %(action)s %(event)s fromResource %(resource)s для %(concept)s в fromDTS не имеет ожидаемых элементов ссылки, arc или меток

source: %(action)s %(event)s fromResource %(resource)s does not have a reference relationship to %(concept)s in fromDTS
fr: %(action)s %(event)s fromResource %(resource)s n'a pas de relation référence avec %(concept)s dans fromDTS
ru: %(action)s %(event)s fromResource %(resource)s не имеет ссылочного отношения к %(concept)s в fromDTS

source: %(action)s %(event)s toConcept %(concept)s does not reference a concept in toDTS
fr: %(action)s %(event)s toConcept %(concept)s ne référence pas de concept dans toDTS
ru: %(action)s %(event)s toConcept %(concept)s не ссылается на концепт в toDTS

source: %(action)s %(event)s toConcept %(concept)s must be defined as a tuple
fr: %(action)s %(event)s toConcept %(concept)s doit être défini comme tuple
ru: %(action)s %(event)s toConcept %(concept)s должно быть определено как кортеж

source: %(action)s %(event)s toResource %(resource)s for %(concept)s does not reference a resource in toDTS
fr: %(action)s %(event)s toResource %(resource)s pour %(concept)s ne référence pas de resource dans toDTS
ru: %(action)s %(event)s toResource %(resource)s для %(concept)s не ссылается на ресурс в toDTS

source: %(action)s %(event)s toResource %(resource)s is not a label in toDTS
ru: %(action)s %(event)s toResource %(resource)s не является меткой в ​​toDTS

source: %(action)s %(event)s toResource %(resource)s for %(concept)s in toDTS does not have expected link, arc, or label elements
fr: %(action)s %(event)s toResource %(resource)s pour %(concept)s dans toDTS n'a pas l'élément attendu de type lien, arc ou libellé
ru: %(action)s %(event)s toResource %(resource)s для %(concept)s в toDTS не имеет ожидаемых элементов ссылки, arc или метки

source: %(action)s %(event)s toResource %(resource)s does not have a label relationship to %(concept)s in toDTS
fr: %(action)s %(event)s toResource %(resource)s n'a pas de relation libellé vers %(concept)s dans toDTS
ru: %(action)s %(event)s toResource %(resource)s не имеет отношения метки к %(concept)s в toDTS

source: %(action)s %(event)s toResource %(resource)s does not reference a resource in toDTS
fr: %(action)s %(event)s toResource %(resource)s ne référence pas de resource dans toDTS
ru: %(action)s %(event)s toResource %(resource)s не ссылается на ресурс в toDTS

source: %(action)s %(event)s toResource %(resource)s is not a reference in toDTS
ru: %(action)s %(event)s toResource %(resource)s не является ссылкой в ​​toDTS

source: %(action)s %(event)s toResource %(resource)s does not have a reference relationship to %(concept)s in toDTS
ru: %(action)s %(event)s toResource %(resource)s не имеет ссылочного отношения к %(concept)s в toDTS

source: %(action)s %(event)s fromConcept %(conceptFrom)s and toConcept %(conceptTo)s must be equivalent or related
fr: %(action)s %(event)s fromConcept %(conceptFrom)s et toConcept %(conceptTo)s doivent être équivalents
ru: %(action)s %(event)s fromConcept %(conceptFrom)s и toConcept %(conceptTo)s должно быть эквивалентным или схожим

source: %(action)s %(event)s %(attr)s $(attrName)s does not have a name
ru: %(action)s %(event)s %(attr)s $ (attrName) не имеет имени

source: %(action)s %(event)s %(attr)s $(attrName)s has an invalid namespace
fr: %(action)s %(event)s %(attr)s $(attrName)s a un espace de nommage non valide
ru: %(action)s %(event)s %(attr)s $ (attrName) имеет недопустимое пространство имен

source: %(action)s %(event)s event is not recognized
fr: L'événement %(action)s %(event)s n'est pas reconnu
ru: %(action)s %(event)s событие не распознается

source: %(action)s %(event)s concept %(concept)s does not reference an item concept.
ru: %(action)s %(event)s концепт %(concept)s не ссылается на концепт элемента.

source: %(action)s %(event)s concept %(concept)s does not reference a tuple concept.
ru: %(action)s %(event)s концепт %(concept)s не ссылается на концепт кортежа.

source: %(action)s %(event)s neither concepts have a %(attribute)s attribute: %(fromConcept)s, %(toConcept)s.
ru: %(action)s %(event)s ни один концепт не имеет %(attribute)s атрибут: %(fromConcept)s, %(toConcept)s.

source: %(action)s %(event)s has non-equivalent attributes %(fromQname)s and %(toQname)s
ru: %(action)s %(event)s имеет неэквивалентные атрибуты %(fromQname)s и %(toQname)s

source: %(event)s %(relSet)s link %(link)s does not reference an element in its DTS
fr: %(event)s %(relSet)s lien %(link)s ne référence pas un élément dans son DTS
ru: %(event)s %(relSet)s ссылка %(link)s не ссылается на элемент в его DTS

source: %(event)s %(relSet)s arc %(arc)s does not reference an element in its DTS
ru: %(event)s %(relSet)s arc %(arc)s не ссылается на элемент в его DTS

source: %(event)s %(relSet)s linkrole %(linkrole)s does not reference an linkrole in its DTS
fr: %(event)s %(relSet)s linkrole %(linkrole)s ne référence pas un linkrole dans son DTS
ru: %(event)s %(relSet)s linkrole %(linkrole)s не ссылается на ссылку в своем DTS

source: %(event)s %(relSet)s linkrole %(linkrole)s is not used in its DTS
ru: %(event)s %(relSet)s linkrole %(linkrole)s не используется в его DTS

source: %(event)s %(relSet)s arcrole %(arcrole)s does not reference an arcrole in its DTS
fr: %(event)s %(relSet)s arcrole %(arcrole)s ne référence pas un arcrolede dans son DTS
ru: %(event)s %(relSet)s arcrole %(arcrole)s не ссылается на arcrole в своей DTS

source: %(event)s %(relSet)s arcrole %(arcrole)s is not used in its DTS
ru: %(event)s %(relSet)s arcrole %(arcrole)s не используется в его DTS

source: %(event)s %(relSet)s relationship fromConcept %(conceptFrom)s does not reference a concept in its DTS
fr: %(event)s %(relSet)s la relation fromConcept %(conceptFrom)s ne référence pas un concept dans son DTS
ru: %(event)s %(relSet)s fromConcept %(conceptFrom)s не ссылается на концепт в своей DTS

source: %(event)s %(relSet)s relationship toConcept %(conceptTo)s does not reference a concept in its DTS
fr: %(event)s %(relSet)s relation toConcept %(conceptTo)s ne référence pas un concept dans son DTS
ru: %(event)s %(relSet)s toConcept %(conceptTo)s не ссылается на концепт в своей DTS

source: %(event)s %(relSet)s no relationship found from fromConcept %(conceptFrom)s to toConcept %(conceptTo)s in its DTS
fr: %(event)s %(relSet)s aucune relation trouvée de fromConcept %(conceptFrom)s vers toConcept %(conceptTo)s dans son DTS
ru: %(event)s %(relSet)s не найдено отношений fromConcept %(conceptFrom)s toConcept %(conceptTo)s в своей DTS

source: %(event)s %(relSet)s no relationship found fromConcept %(conceptFrom)s in its DTS
fr: %(event)s %(relSet)s aucune relation trouvée pour fromConcept %(conceptFrom)s dans son DTS
ru: %(event)s %(relSet)s не найдено отношений fromConcept %(conceptFrom)s в своей DTS

source: %(event)s dimension %(dimension)s is not a concept in its DTS
ru: %(event)s измерение %(dimension)s не является концептом в своей DTS

source: %(event)s dimension %(dimension)s is not an explicit dimension in its DTS
ru: %(event)s измерение %(dimension)s не является явным измерением в своей DTS

source: %(event)s dimension %(dimension)s is duplicated in a single explicitDimension element
ru: %(event)s измерение %(dimension)s дублируется в одном элементе explicitDimension

source: %(event)s dimension %(dimension)s is not a typed dimension in its DTS
ru: %(event)s измерение %(dimension)s не является типизированным размером в своем DTS

source: %(event)s concept %(concept)s is not an item in its DTS
ru: %(event)s концепт %(concept)s не является элементом в своем DTS

source: %(event)s arcrole %(arcrole)s is not defined in its DTS
ru: %(event)s arcrole %(arcrole)s не определено в его DTS

source: %(event)s arcrole %(arcrole)s is not used in its DTS
ru: %(event)s arcrole %(arcrole)s не используется в его DTS

source: %(event)s linkrole %(linkrole)s is not defined in its DTS
ru: %(event)s linkrole %(linkrole)s не определено в его DTS

source: %(event)s linkrole %(linkrole)s is not used in its DTS
ru: %(event)s linkrole %(linkrole)s не используется в его DTS

source: %(event)s arc %(arc)s is not defined as an arc in its DTS
ru: %(event)s арка %(arc)s не определяется как arc в его DTS

source: %(event)s link %(link)s is not defined in its DTS
ru: %(event)s ссылка %(link)s не определена в ее DTS

source: validating links
fr: validation des liens
ru: проверка ссылок

source: validating relationship sets
fr: validation des ensembles de relations
ru: проверка наборов отношений
