Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: Atomizing {0} to an integer does not have a proper value
ru: Разбор {0} на целое число не имеет правильного значения

source: Axis %(axis)s is not supported in %(step)s
ru: Ось %(axis)s не поддерживается в %(step)s

source: QName prefix not defined for %(name)s
fr: QName non défini pour %(name)s
ru: Префикс QName не определен для %(name)s

source: Function %(name)s cannot be used on an XPath expression associated with a %(name2)s
fr: La fonction %(name)s ne peut pas être utilisée comme une expression XPath associée avec %(name2)s
ru: Функция %(name)s не может использоваться для выражения XPath, связанного с именем %(name2)s

source: wildcard prefix not defined for %(token)s
fr: Le préfixe joker non défini pour %(token)s
ru: префикс регулярного выражения не определен для %(token)s

source: No custom function signature for %(custFunction)s in %(resource)s
fr: Aucune signature pour la fonction spécique %(custFunction)s dans %(resource)s
ru: Нет пользовательской функции подписи для %(custFunction)s в %(resource)s

source: QName prefix not defined for variable reference $%(variable)s
fr: Préfixe QName non défini pour la référence de variable $%(variable)s
ru: Префикс QName не определен для ссылки на переменную $%(variable)s

source: initializing formula xpath2 grammar
ru: инициализация формулы xpath2

source: Formula xpath2 grammar initialized in %.2f secs
fr: Grammaire XPath2 des formules initialisée en %.2f secondes
ru: Словарь формулы xpath2 инициализирован за %.2f сек.

source: Code %(name)s %(source)s
ru: Код %(name)s %(source)s

source: Parse error in %(name)s error: %(error)s %(source)s
fr: Error d'analyse dans %(name)s : %(error)s %(source)s
ru: Ошибка парсинга в %(name)s. Ошибка: %(error)s %(source)s

source: Parsing terminated in %(name)s due to error: %(error)s %(source)s
fr: Analyse terminée dans %(name)s en raison d'une erreur : %(error)s %(source)s
ru: Парсинг остановлен для %(name)s из-за ошибки:%(error)s %(source)s

source: 1Dimension
ru: 1Измерение

source: 1Formula
fr: 1Formule
ru: 1Формула

source: 1Rendering
ru: 1Рендеринг

source: 1Presentation
ru: 1Представление

source: 1Calculation
fr: 1Calcul
ru: 1Вычисление

source: 1Standard Label
fr: 1Libellé Standard
ru: 1Стандартная Метка

source: 0Name
fr: 0 Nom
ru: 0Имя

source: Inline XBRL element %(element)s has qualified attribute %(name)s
ru: Элемент Inline XBRL %(element)s имеет квалифицированный атрибут %(name)s

source: Inline XBRL element %(element)s has disallowed attribute %(name)s
ru: Элемент Inline XBRL %(element)s. Запрещен атрибут %(name)s

source: Inline XBRL attributes are not allowed on html elements: ix:%(name)s
ru: Атрибуты Inline XBRL не допускаются для элементов html: ix:%(name)s

source: Extension attributes are not allowed on html elements: %(tag)s
ru: Атрибуты расширения не допускаются к элементам html: %(tag)s

source: Inline XBRL element %(element)s has disallowed attributes %(attributes)s
ru: Элемент Inline XBRL %(element)s имеет запрещенные атрибуты %(attributes)s

source: Attribute %(attribute)s is not expected on element ix:%(element)s
ru: Атрибут %(attribute)s не ожидается в элементе ix:%(element)s

source: Inline XBRL ix:{0} {1} {2} {3} {4} element
ru: Inline XBRL ix:{0} {1} {2} {3} {4} элемент

source: Fact %(fact)s is a nil nonFraction and MUST not have an ancestor ix:nonFraction
ru: Факт %(fact)s является нулевым nonFraction и НЕ ДОЛЖЕН иметь предка ix:nonFraction

source: Fact %(fact)s is a nil nonFraction and MUST not have an child elements or text
ru: Факт %(fact)s является нулевым nonFraction и НЕ ДОЛЖЕН иметь дочерние элементы или текст

source: Fact %(fact)s is a non-nil nonFraction and MUST have exactly one ix:nonFraction child element or text.
ru: Факт %(fact)s является ненулевым nonFraction и ДОЛЖЕН иметь ровно один дочерний элемент ix:nonFraction или текст.

source: Fact %(fact)s is a nil fraction and MUST not have an ancestor ix:fraction
ru: Факт %(fact)s является nil фракцией и НЕ ДОЛЖЕН иметь предка ix:fraction

source: Fact %(fact)s is a non-nil fraction and not have any child elements except ix:fraction, ix:numerator and ix:denominator: %(children)s
ru: Факт %(fact)s - это non-nil фракция и не имеет дочерних элементов, кроме ix:fraction, ix:numerator и ix:denominator: %(children)s

source: Fact %(fact)s has unrecognized transformation namespace %(namespace)s
ru: Факт %(fact)s имеет неопознанное пространство имен преобразований %(namespace)s

source: Fact %(fact)s has unrecognized transformation name %(name)s
ru: Факт %(fact)s имеет неопознанное имя преобразования %(name)s

source: Inline XBRL element name %(element)s is not valid
ru: Имя элемента Inline XBRL %(element)s некорректно

source: Attribute %(attribute)s required on element ix:%(element)s
ru: Атрибут %(attribute)s требуется для элемента ix:%(element)s

source: %(element)s error %(error)s
ru: %(element)s ошибка %(error)s

source: Element %(element)s fact %(fact)s type %(typeName)s is nil but element has not been defined nillable
ru: Элемент %(element)s факт %(fact)s тип %(typeName)s является nil, но элемент не определен как nillable

source: Inline element %(element)s fact %(fact)s type %(typeName)s transform %(transform)s value error: %(value)s
ru: Встроенный элемент %(element)s факт %(fact)s тип %(typeName)s трансформирует %(transform)s. Ошибка значения: %(value)s

source: Fact %(fact)s has unrecognized transformation %(transform)s, value: %(value)s
ru: Факт %(fact)s имеет неопознанное преобразование %(transform)s, значение: %(value)s

source: Element %(element)s has abstract declaration, value: %(value)s
ru: Элемент %(element)s имеет абстрактную декларацию, значение: %(value)s

source: Element %(element)s error %(error)s value: %(value)s
ru: Элемент %(element)s. Ошибка %(error)s. Значение: %(value)s

source: Element %(element)s type %(typeName)s missing required attributes: %(attributes)s
fr: Il manque l'attribut obligatoire %(attribute)s pour l'élément %(element)s de type %(typeName)s
ru: Элемент %(element)s тип %(typeName)s. Отсутствует требуемые атрибуты: %(attributes)s

source: Element %(element)s type %(typeName)s extraneous attributes: %(attributes)s
ru: Элемент %(element)s тип %(typeName)s. Посторонние атрибуты: %(attributes)s

source: Element %(element)s is nil but has contents
ru: Элемент %(element)s пустой, но содержит контент

source: Element %(element)s attribute %(attribute)s type %(typeName)s value error: %(value)s, %(error)s
fr: Élément %(element)s attribut %(attribute)s type %(typeName)s valeur erronnée : %(value)s, %(error)s
ru: Элемент %(element)s атрибут %(attribute)s тип %(typeName)s. Ошибка значения: %(value)s, %(error)s

source: Element %(element)s type %(typeName)s value error: %(value)s, %(error)s
ru: Элемент %(element)s тип %(typeName)s. Ошибка значения : %(value)s, %(error)s

source: %(compositor)s(%(particles)s) %(element)s occurred %(occurrences)s times, minOccurs=%(minOccurs)s, maxOccurs=%(maxOccurs)s, within %(parentElement)s
ru: %(compositor)s(%(particles)s) %(element)s появился %(occurrences)s раз, minOccurs=%(minOccurs)s, maxOccurs=%(maxOccurs)s, внутри %(parentElement)s

source: %(compositor)s(%(particles)s) content occurred %(occurrences)s times, minOccurs=%(minOccurs)s, maxOccurs=%(maxOccurs)s, within %(parentElement)s
ru: %(compositor)s(%(particles)s) появилось содержание %(occurrences)s раз, minOccurs=%(minOccurs)s, maxOccurs=%(maxOccurs)s, внутри %(parentElement)s

source: All(%(particles)s) missing at %(element)s, within %(parentElement)s
ru: Все (%(particles)s) отсутствуют в %(element)s внутри %(parentElement)s

source: %(compositor)s(%(particles)s) %(element)s unexpected, within %(parentElement)s
ru: %(compositor)s(%(particles)s) %(element)s не ожидаются внутри %(parentElement)s

source: Particles of %(compositor)s have non-unique attribution of element %(element)s
ru: Части %(compositor)s имеют не уникальное описание элемента %(element)s

source: Particle of %(compositor)s has non-unique xs:any preceding element %(element)s
ru: Части %(compositor)s имеют не уникальный xs:any предшествующий элемент %(element)s

source: Particles of %(compositor)s have non-unique xs:any particle
ru: Части %(compositor)s имеют не уникальные xs:any части

source: Element attribute %(typeName)s value error: %(value)s, %(error)s
ru: Атрибут элемента %(typeName)s. Ошибка: %(value)s, %(error)s

source: (non-numeric)
fr: (non numéric)

source: %(action)s %(event)s %(attr)s $(attrName)s does not have a namespace
fr: %(action)s %(event)s %(attr)s $(attrName)s n'a pas d'espace de nommage

source: %(docType)s encoding must be "utf-8" but is "%(xmlEncoding)s"
fr: L'encodage de %(docType)s doit être unicode "utf-8" mais est "%(xmlEncoding)s"

source: %(docType)s must have comment node only on line 2
fr: %(docType)s ne peut avoir un noud de type commentaire qu'à la ligne 2

source: %(docType)s must have only one comment node before schema element
fr: %(docType)s ne peut avoir qu'un noud commentaire avant l'élément "schema"

source: %(docType)s namespace declaration "%(declaration)s" is not used
fr: %(docType)s L'espace de nommage %(prefix)s="%(namespace)s" n'est pas utilisé

source: %(docType)s xml version must be "1.0" but is "%(xmlVersion)s"
fr: La version xml de %(docType)s doit être "1.0" mais est "%(xmlVersion)s"

source: %(dts) has errors: %(error)s
fr: %(dts) a des erreurs : %(error)s

source: %(error)s, %(fileName)s, %(sourceAction)s source element
fr: %(error)s, fichier %(filename)s, élément source %(sourceAction)s

source: %(event)s %(relSet)s arc %(arc) does not reference an element in its DTS
fr: %(event)s %(relSet)s arc %(arc) ne référence pas un élément dans son DTS

source: %(linkElement)s loc href %(locHref)s must identify a concept or label
fr: %(linkElement)s loc href %(locHref)s doit identifier un concept ou un libellé

source: %(variableSetType)s %(xlinkLabel)s Result: %(result)s
fr: %(variableSetType)s %(xlinkLabel)s Résultat : %(result)s

source: [Exception] Failed to complete validation: {0} {1}
fr: [exception] Exception de validation : {0} {1}

source: {0} retrieving {1}
fr: {0} récupération de {1}

source: {0} unsuccessful retrieval of {1} switching to work offline
fr: {0} récupération de {1} passage en mode déconnecté

source: '{0}' proxy-authentication for realm '{1}' is required to access {2} {3}
fr: Le proxy '{0}' demande une authentication sur le realm '{1}' pour accéder à {2} {3}

source: '{0}' www-authentication for realm '{1}' is required to access {2} {3}
fr: Un authentification www '{0}' pour le realm '{1}' est nécessaire pour accéder à {2} {3}

source: <unnamed {0}>
fr: <{} sans nom}

source: A schema import schemas of which no content is being addressed: %(importedFile)s
fr: Un schéma importe des schémas qui ne sont pas utilisés: %(importedFile)s

source: arelle - Save File
fr: arelle - Enregistrer le fichier

source: arelle - Updater
fr: arelle - Effectuer un mise à jour

source: arelle {0} An open source XBRL platform 2010-2011 Mark V Systems Limited All rights reserved http://www.arelle.org support@arelle.org Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License. You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License. Includes: Python 2001-2010 Python Software Foundation PyParsing 2003-2010 Paul T. McGuire lxml 2004 Infrae, ElementTree 1999-2004 by Fredrik Lundh xlrd 2005-2009 Stephen J. Machin, Lingfo Pty Ltd, 2001 D. Giffin, 2000 A. Khan xlwt 2007 Stephen J. Machin, Lingfo Pty Ltd, 2005 R. V. Kiseliov
fr: u00ae {0} Une plateforme XBRL \u00a9 2010-2011 Mark V Systems Limited Tous droits réservers http://www.arelle.org/ support@arelle.org Logiciel sous licence Apache version 2.0 (appelée ci-après «la licence»); vous ne devez utiliser ce fichier qu'en conformité avec la licence. Vous pouvez obtenir une copie de la licence à http://www.apache.org/licenses/LICENSE-2.0 Sauf si la loi l'exige ou en cas d'accord par écrit, le logiciel distribué "EN L'ETAT", SANS GARANTIE NI CONDITION D'AUCUNE SORTE, explicite ou implicite. Voir la licence pour connaître les termes employés afin de régir les autorisations et les restrictions en vertu de la licence. Inclut: Python\u00ae \u00a9 2001-2010 Python Software Foundation PyParsing \u00a9 2003-2010 Paul T. McGuire lxml \u00a9 2004 Infrae, ElementTree \u00a9 1999-2004 by Fredrik Lundh xlrd \u00a9 2005-2009 Stephen J. Machin, Lingfo Pty Ltd, \u00a9 2001 D. Giffin, \u00a9 2000 A. Khan xlwt \u00a9 2007 Stephen J. Machin, Lingfo Pty Ltd, \u00a9 2005 R. V. Kiseliov

source: Argument {0} does not match expected type {1}.
fr: L'argument {0} ne correspond pas au type {1} attendu.

source: both --efm and --gfm validation are requested, proceeding with --efm only
fr: Les validations --efm et --gfm sont demandées simultanément, continue avec --efm uniquement

source: Calculation inconsistent from %(concept)s in link role %(linkrole)s reported sum %(reportedSum)s computed sum %(computedSum)s context %(contextID)s unit %(unitID)s
fr: Calcul incohérent pour %(concept)s dans le rôle %(linkrole)s : somme rapportée %(reportedSum)s ; somme calculée %(computedSum)s contexte %(contextID)s unité %(unitID)s

source: CalculationArc from %(xlinkFrom)s to %(xlinkTo)s must have an weight
fr: CalculationArc de %(xlinkFrom)s vers %(xlinkTo)s doit avoir une pondération

source: Collapse All
fr: Tout Réduire

source: Columns for CSVFILE
fr: Colonnes du FICHIERCSV

source: Compiling formulae
fr: Compile la formule

source: Concept %(concept)s does not participate in an effective presentation relationship
fr: Le concept %(concept)s ne participe pas à une relation de présentation effective

source: Concept %(concept)s id %(id)s should be $(requiredId)s
fr: Le concept %(concept)s id %(id)s devrait être $(requiredId)s

source: Concept %(concept)s is an Axis but not in hypercubeItem substitution group
fr: Le concept %(concept)s est un axe (Axis) mais pas dans le groupe de substitution hypercubeItem

source: Concept %(concept)s is missing an %(lang)s standard label.
fr: Il manque un libellé standard en langue '%(lang)s' pour le concept %(concept)s

source: Concept %(concept)s must end in Axis to be in dimensionItem substitution group
fr: Le concept %(concept)s doit se terminer par 'Axis' pour être dans le groupe de substitution dimensionItem

source: Concept %(concept)s must have a standard label in language 'nl'
fr: Le concept %(concept)s doit avoir un libellé standard en langue 'nl'

source: Concept %(specialName)s is appears to be missing a general-special relationship to %(generalNames)s
fr: Il semble que le concept %(specialName)s n'a pas de relation general-special vers %(generalNames)s

source: Concept Label Role
fr: Rôle de Libellé Concept

source: Context %(contextID) startDate or endDate: %(error)s
fr: Contexte %(contextID) startDate ou endDate : %(error)s

source: Context %(contextID)s endDate and %(contextID2)s startDate have a duration of one day; that is inconsistent with document type %(documentType)s.
fr: Contexte La endDate de %(contextID)s et la startDate de %(contextID2)s forment une durée d'un jour ; ceci est incohérent avec le type de document %(documentType)s.

source: Context %(contextID)s explicit dimension %(dimension)s member {2} is a default member item
fr: Dans la dimension explicite %(dimension)s du contexte %(contextID)s, le membre {2} est un élément par défaut

source: Context %(contextID)s startDate and %(contextID2)s end (instant) have a duration of one day; that is inconsistent with document type %(documentType)s.
fr: Le context %(contextID)s startDate and %(contextID2)s end (instant) a une durée de 1 jour ; ce n'est pas cohérent avec le type de document %(documentType)s.

source: Dec
fr: Décimales

source: decimals
fr: décimales

source: Dimension %(dimension)s domains same in linkroles %(linkroles)s
fr: Dimension %(dimension)s, les domaines son identiques dans les linkroles %(linkroles)s

source: Dimension %(dimension)s in DRS role %(linkrole)s for hypercube %(hypercube)s, non-unique member %(concept)s
fr: La dimension %(dimension)s dans le rôle DRS %(linkrole)s pour l'hypercube %(hypercube)s a un membre non unique %(concept)s

source: dimension not available
fr: dimension non disponible

source: Element %(element)s type %(typeName)s value error: %(value)s
fr: Valeur erronnée pour l'élément %(element)s de type %(typeName)s: %(value)s

source: Element %(element)shas empty %(attribute)s
fr: L'élément %(element)s a un attribut %(attribute)s vide

source: ELR role %(linkrole)s, for hypercube %(hypercube)s has another parent %(concept)s
fr: Le rôle extendu %(linkrole)s pour l'hypercube %(hypercube)s a un autre parent %(concept)s

source: Exception, function not available: {0}
fr: Exception, fonction non disponible: {0}

source: Exception: Arg {0} expected type {1}
fr: Exception: Argument {0}, type {1} attendu

source: Expand All
fr: Déplier Tout

source: Fact %(fact)s context %(contextID)s is a fraction with invalid denominator %(denominator)
fr: Le fait %(fact)s du context %(contextID)s est une fraction avec un dénominateur %(denominateur)s non valide

source: Fact %(fact)s context %(contextID)s must have a monetary unit %(unitID)s
fr: Le fait %(fact)s du context %(contextID)s ne peut as avoir l'unité monétaire %(unitID)s

source: Fact %(fact)s of context %(contextID) has a '>' in text, not well-formed XML: '%(text)s'
fr: Le fait %(fact)s du context %(contextID)s a un '>' dans son texte, le XML n'est pas correctement formé: [%(text)s]

source: Fact %(fact)s of context %(contextID) has an invalid external reference in '%(attribute)s' for <%(element)s>
fr: Le fait %(fact)s du context %(contextID)s a une référence externe non valide dans l'attribut '%(attribute)s' pour <%(element)s>

source: Fact %(fact)s of context %(contextID) has attribute '%(attribute)s' not allowed for <%(element)s>
fr: Le fait %(fact)s du context %(contextID)s a un attribut '%(attribute)s' non autorisé pour <%(element)s>

source: Fact %(fact)s of context %(contextID) has disallowed html tag: <%(element)s>
fr: Le fait %(fact)s du context %(contextID)s contient un tag HTML non autorisé: <%(element)s>

source: Fact %(fact)s of context %(contextID) has javascript in '%(attribute)s' for <%(element)s>
fr: Le fait %(fact)s du context %(contextID)s contient du javascript dans l'attribut '%(attribute)s' pour <%(element)s>

source: Fact %(fact)s of context %(contextID) has text which causes the XML error %(error)s line %(line)s column %(column)s
fr: Le fait %(fact)s du context %(contextID)s contient du texte qui est à l'origine de l'erreur XML %(error)s ligne %(line)s colonne %(column)s

source: Fact %(fact)s of context %(contextID) has text which causes the XML fatal error %(error)s line %(line)s column %(column)s
fr: Le fait %(fact)s du context %(contextID)s contient du texte qui est à l'origine de l'erreur XML fatale %(error)s ligne %(line)s colonne %(column)s

source: Fact %(fact)s of context %(contextID) has text which causes the XML warning %(error)s line %(line)s column %(column)s
fr: Le fait %(fact)s du context %(contextID)s contient du texte qui est à l'origine de l'avertissement XML %(error)s ligne %(line)s colonne %(column)s

source: Fact %(fact)s of context %(contextID)s decimals %(decimals)s value %(value)s has insignificant digits %(value2)s.
fr: Le fait %(fact)s du context %(contextID)s décimales %(decimals)s valeur %(value)s a des chiffres non significatifs %(value2)s.

source: Fact Variable %(variable)s %(filter)s filter %(aspect)s passes %(factCount)s facts
fr: La variable de fait %(variable)s filtrée par %(filter)s passe avec succès %(factCount)s faits

source: Fact Variable %(variable)s %(filter)s filter dimension matching passes %(factCount)s facts
fr: Pour la variable de fait %(variable)s, le filtre de dimension passe avec succès %(factCount)s faits

source: Failed to save output html to %(file)s: \s%(error)s
fr: Impossible d'enregistrer la sortie HTML dans %(file)s : \s%(error)s

source: FILENAME is an entry point, which may be an XBRL instance, schema, linkbase file, inline XBRL instance, testcase file, testcase index file. FILENAME may be a local file or a URI to a web located file.
fr: FICHIER est un point d'entrée, qui peut être une instance XBRL, un schéma, une base de liens, une instance inline XBRL, un cas de test, un index de cas des test. FICHIER peut êter un fichier local ou une resource web.

source: Filing
fr: Instance

source: Footnote %(xlinkLabel)s has an invalid external reference in '%(attribute)s' for <%(element)s>: %(value)s
fr: Le pied de page %(xlinkLabel)s a une référence externe non valide dans '%(attribute)s' pour <%(element)s>: %(value)s

source: Footnote %(xlinkLabel)s has attribute '%(attribute)s' not allowed for <%(element)s>
fr: Le pied de page %(xlinkLabel)s a un attribut '%(attribute)s' qui n'est pas autorisé pour l'élément <%(element)s>

source: Footnote %(xlinkLabel)s has disallowed html tag: <%(element)s>
fr: Le pied de page %(xlinkLabel)s a un tag HTML non autorisé : <%(element)s>

source: Footnote %(xlinkLabel)s has javascript in '%(attribute)s' for <%(element)s>
fr: Le pied de de page %(xlinkLabel)s contient du jaavscript dans l'attribut %(attribute)s pour <%(element)s>

source: FootnoteLink %(footnoteLinkNumber)s footnote %(xlinkLabel)s has no linked fact
fr: FootnoteLink %(footnoteLinkNumber)s, la note de pied de base %(xlinkLabel)s n'a pas de fait lié

source: Formula %(xlinkLabel)s concept %(concept)s is not a %(element)s
fr: Formule %(xlinkLabel)s, le concept %(concept)s n'est pas un item %(element)s

source: Formula %(xlinkLabel)s concept: %(concept)s
fr: Formule %(xlinkLabel)s concept : %(concept)s

source: Formula %(xlinkLabel)s dimension %(dimension)s: %(value)s
fr: Formule %(xlinkLabel)s dimension %(dimension)s : %(value)s

source: Formula %(xlinkLabel)s entity identifier scheme: %(scheme)s
fr: Formula %(xlinkLabel)s identifiant de l'entité a l'attribut @scheme : %(scheme)s

source: Formula %(xlinkLabel)s entity identifier value: %(entityIdentifier)s
fr: Formule %(xlinkLabel)s identifiant de l'entité : %(entityIdentifier)s

source: Formula %(xlinkLabel)s period end: %(period)s
fr: La formule %(xlinkLabel)s a pour fin de période : %(period)s

source: Formula %(xlinkLabel)s period start: %(period)s
fr: La formule %(xlinkLabel)s a pour début de période : %(period)s

source: Formula %(xlinkLabel)s period type: %(periodType)s
fr: La formule %(xlinkLabel)s a un type de période %(periodType)s

source: Formula %(xlinkLabel)s unit: %(unit)s
fr: La formule %(xlinkLabel)s a pour unité : %(unit)s

source: Formula %(xlinkLabel)s value is a sequence of length %(valueSequenceLength)s
fr: La formule %(xlinkLabel)s est valorisée dans une séquence de longueur %(valueSequenceLength)s

source: Formula output missing expected fact %(fact)s
fr: Le fait attendu %(fact)s est manquant dans la formule

source: Function {0} is not available in this build.
fr: La fonction {0} n'est pas disponible dans cette version.

source: Function call not identified.
fr: Appel de fonction non identifié.

source: imported in %.2f secs at %s
fr: chargé en %.2f secondes à %s

source: incorrect arguments with --webserver, please try python CntlrCmdLine.pyw --help
fr: arguments incorrects avec --webserver, essayez python arelleCmdLine --help

source: incorrect arguments, please try python CntlrCmdLine.pyw --help
fr: arguments incorrects, essayez python CntlrCmdLine.pyw --help

source: Initializing formula xpath2 grammar
fr: Initialisation de la grammaire XPath2 des formules
