Repository: Arelle/Arelle
Catalog: arelle/locale/*/LC_MESSAGES/*.po
Languages: fr, ru

source: Generic arc arcrole %(arcrole)s is missing an arcroleRef
fr: Le rôle d'arc générique %(arcrole)s devrait avoir arcroleRef
ru: В общаей arc arcrole %(arcrole)s отсутствует arcroleRef

source: Arcrole %(arcrole)s missing usedOn for %(element)s
fr: L'arcrole %(arcrole)s devrait avoir usedOn pour %(element)s
ru: В arcrole %(arcrole)s отсутствует usedOn для %(элемента)s

source: Generic arc arcrole %(arcrole)s missing usedOn for %(element)s
fr: Le rôle d'arc générique %(arcrole)s devrait avoir usedOn pour l'élément %(element)s
ru: Общая arc arcrole %(arcrole)s - отсутствует usedOn для %(элемента)s

source: XBRL file {0} standard arcrole %(arcrole)s used on wrong arc %(element)s
fr: Fichier XBRL {0}, le rôle d'arc standard %(arcrole)s est utilisé sur le mauvais arc %(element)s
ru: XBRL-файл {0} - стандартный arcrole %(аррол)s используется на неправильной arc %(element)s

source: Inline XBRL continuation chain has elements which are descendants of each other.
ru: В цепочке продолжения Inline XBRL есть элементы, которые являются потомками друг друга.

source: Hypercube-dimension relationship from %(source)s to %(target)s in link role %(linkrole)s must have a hypercube declaration source
fr: La relation hypercube-dimension de %(source)s vers %(target)s dans le rôle %(linkrole)s doit avoir pour source une déclaration d'hypercube
ru: Отношение измерений и гиперкуба от %(source)s к %(target)s в роли ссылки %(linkrole)s должно иметь источник объявления гиперкуба

source: Hypercube-dimension relationship from %(source)s to %(target)s in link role %(linkrole)s must have a dimension declaration target
fr: La relation hypercube-dimension de %(source)s vers %(target)s dans le rôle %(linkrole)s doit cibler une déclaration de dimension
ru: Отношение измерения и гиперкуба от %(source)s к %(target)s в роли ссылки %(linkrole)s должно иметь цель объявления измерения

source: HasHypercube %(arcroleType)s relationship from %(source)s to %(target)s in link role %(linkrole)s must have a primary item source
fr: La relation hasHypercube %(arcroleType)s de %(source)s vers %(target)s dans le rôle %(linkrole)s doit avoir une source item primaire
ru: Отношение HasHypercube %(arcroleType)s от %(source)s к %(target)s в роли ссылки %(linkrole)s должно иметь источник первичного элемента

source: HasHypercube %(arcroleType)s relationship from %(source)s to %(target)s in link role %(linkrole)s must have a hypercube declaration target
fr: La relation hasHypercube %(arcroleType)s de %(source)s vers %(target)s dans le rôle %(linkrole)s doit cibler une déclaration d'hypercube
ru: Отношение HasHypercube %(arcroleType)s от %(source)s к %(target)s в роли ссылки %(linkrole)s должно иметь цель объявления гиперкуба

source: HasHypercube %(arcroleType)s relationship from %(source)s to %(target)s in link role %(linkrole)s must have a context element
fr: La relation hasHypercube %(arcroleType)s de %(source)s vers %(target)s dans le rôle %(linkrole)s doit avoir un élément contexte
ru: Отношение HasHypercube %(arcroleType)s от %(source)s к %(target)s в роли ссылки %(linkrole)s должно иметь элемент контекста

source: Dimension relationships have a directed cycle in DRS role %(linkrole)s starting from hypercube %(hypercube)s, dimension %(dimension)s, path %(path)s
fr: Les relations de dimension présentent un cycle orienté dans le rôle DRS %(linkrole)s débutant de l'hypercube %(hypercube)s, dimension %(dimension)s, chemin %(path)s
ru: Отношение измерений имеет направленный цикл в роли DRS %(linkrole)s начиная с гиперкуба %(hypercube)s, измерение %(dimension)s, путь %(path)s

source: Dimension relationships have a polymorphism cycle in DRS role %(linkrole)s starting from hypercube %(hypercube)s, dimension %(dimension)s, path %(path)s
fr: Les relations de dimension présentent un cycle polymorphique dans le rôle DRS %(linkrole)s débutant de l'hypercube %(hypercube)s, dimension %(dimension)s, chemin %(path)s
ru: Отношение измерений имеет цикл полиморфизма в роли DRS %(linkrole)s начиная с гиперкуба %(hypercube)s, измерение %(dimension)s, путь %(path)s

source: Dimension-domain relationship from %(source)s to %(target)s in link role %(linkrole)s must have a dimension declaration source
fr: La relation dimension-domaine de %(source)s vers %(target)s dans le rôle %(linkrole)s doit avoir pour source un déclaration de dimension
ru: Отношение измерение-домен от %(source)s к %(target)s в роли ссылки %(linkrole)s должно иметь источник объявления измерения

source: Dimension-domain relationship from %(source)s to %(target)s in link role %(linkrole)s has a typed dimension source
fr: La relation dimension-domaine de %(source)s vers %(target)s dans le rôle %(linkrole)s a une source de dimension typée
ru: Отношение измерение-домен от %(source)s до %(target)s в роли ссылки %(linkrole)s имеет типизированный источник размера

source: Dimension-domain relationship from %(source)s to %(target)s in link role %(linkrole)s must have a domain member target
fr: La relation dimension-domaine de %(source)s vers %(target)s dans le rôle %(linkrole)s doit cibler un membre du domaine
ru: Отношение измерение-домен от %(source)s к %(target)s в роли ссылки %(linkrole)s должно иметь связанный элемент домена

source: Dimension-default relationship from %(source)s to %(target)s in link role %(linkrole)s must have a dimension declaration source
fr: La relation dimension-default de %(source)s vers %(target)s dans le rôle %(linkrole)s doit avoir pour source une déclaration de dimension
ru: Отношение измерение - по умолчанию от %(source)s к %(target)s в роли ссылки %(linkrole)s должно иметь источник объявления измерения

source: Dimension-default relationship from %(source)s to %(target)s in link role %(linkrole)s has a typed dimension source
fr: La relation dimension-default de %(source)s vers %(target)s dans le rôle %(linkrole) est associée à une dimension typée
ru: Отношение измерение - по умолчанию от %(source)s к %(target)s в роли ссылки %(linkrole)s имеет типизированный источник размера

source: Dimension-default relationship from %(source)s to %(target)s in link role %(linkrole)s must have a domain member target
fr: La relation dimension-default de %(source)s vers %(target)s dans le rôle %(linkrole)s doit cibler un membre du domaine
ru: Отношение измерение - по умолчанию от %(source)s к %(target)s в роли ссылки %(linkrole)s должно иметь ссылку на элемент домена

source: Dimension %(source)s has multiple defaults %(target)s and %(target2)s
fr: La dimension %(source)s a plusieurs valeurs par défaut: %(target)s et %(target2)s
ru: Измерение %(source)s имеет несколько значений по умолчанию %(target)s и %(target2)s

source: Domain-Member relationship from %(source)s to %(target)s in link role %(linkrole)s must have a domain primary item or domain member source
fr: La relation domaine-membre de %(source)s vers %(target)s dans le rôle %(linkrole)s doit avoir un élément primaire domaine ou un membre source domaine
ru: Отношения домен-элемент домена от %(source)s до %(target)s в роли ссылки %(linkrole)s должен иметь первичный элемент домена или источник домена

source: Domain-Member relationship from %(source)s to %(target)s in link role %(linkrole)s must have a domain primary item or domain member target
fr: La relation domaine-membre de %(source)s vers %(target)s dans le rôle %(linkrole)s doit avoir un élément primaire domaine ou un membre destination domaine
ru: Отношение домен-элемент домена от %(source)s до %(target)s в роли ссылки %(linkrole)s должен иметь основной объект item или ссылаться на объект домена

source: Concept %(concept)s typedDomainRef has no fragment identifier
fr: Le typedDomainRef du concept %(concept)s n'a pas d'identifiant de fragment
ru: Концепт %(concept)s typedDomainRef не имеет идентификатора фрагмента

source: Concept %(concept)s typedDomainRef is not resolved
fr: Le typedDomainRef du concept %(concept)s ne peut pas être résolu
ru: Концепт %(concept)s typedDomainRef не разрешен

source: Concept %(concept)s typedDomainRef must identify a non-abstract element
fr: Le typedDomainRef du concept %(concept)s doit identifier un élément concret
ru: Концепт %(concept)s typedDomainRef должен идентифицировать не абстрактный элемент

source: Concept %(concept)s is not a dimension item but has a typedDomainRef
fr: Le concept %(concept)s n'est pas une dimension mais à l'attribut 'typedDomainRef'
ru: Концепт %(concept)s не является элементом измерения, но имеет typedDomainRef

source: Context %(contextID)s %(dimension)s %(value)s is not an appropriate dimension item
fr: Contexte %(contextID)s %(dimension)s %(value)s n'est pas un élément dimension adéquat
ru: Контекст %(contextID)s %(dimension)s %(value)s не является подходящим элементом измерения

source: missing content
fr: contenu manquant
ru: отсутствует контент

source: multiple contents
fr: contenu multiple
ru: множественное содержание

source: Missing domain element schema definition for {0}
ru: Отсутствие определения схемы элемента домена для {0}

source: wrong content {0}
fr: mauvais contenu {0}
ru: неправильный контент {0}

source: Context %(contextID)s typed dimension %(dimension)s has %(error)s
fr: Contexte %(contextID)s la dimension typée %(dimension)s a %(error)s
ru: Контекст %(contextID)s - типизированный размер %(dimension)s имеет %(error)s

source: Context %(contextID)s explicit dimension %(dimension)s member %(value)s is not a global member item
fr: Contexte %(contextID)s dimension explicite %(dimension)s membre %(value)s n'est pas un membre global
ru: Контекст %(contextID)s - явное измерение %(dimension)s член %(value)s не является глобальным элементом (member item)

source: Context %(contextID)s explicit dimension %(dimension)s member %(value)s is a default member item
ru: Контекст %(contextID)s - явное измерение %(dimension)s член %(value)s является членом элемента по умолчанию

source: Context %(contextID)s dimension %(dimension)s is a repeated dimension value
fr: Contexte %(contextID)s dimension %(dimension)s est une valeur de dimensions répétée
ru: Контекст %(contextID)s, размерность %(dimension)s - повторяющееся значение размера

source: Fact %(fact)s context %(contextID)s dimensionally not valid
fr: Le fait %(fact)s du context %(contextID)s est invalide par ses dimensions
ru: Факт %(fact)s, контекст %(contextID)s недействителен в измерениях (dimensionally)

source: Saved output %(type)s to %(file)s
ru: Сохраненный вывод %(type)s в %(file)s

source: Failed to save output %(type)s to %(file)s: \s%(error)s
ru: Не удалось сохранить результат %(type)s в %(file)s: \ s %(error)s

source: viewing concepts
fr: voir les concepts
ru: просмотр концептов

source: viewing DTS
fr: voir le DTS
ru: просмотр DTS

source: viewing facts
fr: voir les faits
ru: просмотр фактов

source: Unrecognized columns: %(cols)s
fr: Colonnes non reconnues : %(cols)s
ru: Неопознанные столбцы: %(cols)s

source: First column must be Label or Name: %(col1)s
fr: La première colonne doit être le libellé ou le nom: %(col1)s
ru: Первый столбец должен быть ярлыком или именем: %(col1)s

source: viewing formulae
ru: просмотр формул

source: viewing relationships {0}
fr: voir les relations {0}
ru: просмотр отношений {0}

source: saving rendering
ru: сохранение рендеринга

source: rendering saved to {0}
ru: рендеринг сохранен в {0}

source: viewing arcrole types
ru: просмотр типов arcrole

source: viewing role types
ru: просмотр типов ролей

source: viewing RSS feed
fr: voir le flux RSS
ru: просмотр RSS-ленты

source: viewing Tests
fr: voir les tests
ru: просмотр Тестов

source: no relationships for XBRL formulae
fr: aucune relation pour la formule XBRL
ru: нет связей для формул XBRL

source: From DTS Presentation
fr: Depuis Présentation du DTS
ru: Из представления DTS

source: From DTS Calculation
fr: Depuis Calculs du DTS
ru: Из базы вычислений DTS

source: From DTS Dimension
fr: Depuis Dimension du DTS
ru: Из измерений DTS

source: To DTS Presentation
fr: Vers Présentation DTS
ru: В представление DTS

source: To DTS Calculation
fr: Vers Calcul DTS
ru: В базу вычислений DTS

source: To DTS Dimension
fr: Vers Dimension DTS
ru: В измерения DTS

source: Ignore Dimensions
fr: Ignore les dimensions
ru: Игнорировать Измерения

source: Show Dimension Defaults
ru: Показывать Измерения по умолчанию

source: Options
ru: Параметры

source: no relationships for {0}
fr: aucune relation pour {0}
ru: нет связей для {0}

source: Label
fr: Libellé
ru: Метка

source: Value
fr: Valeur
ru: Значение

source: View Tuple Children
fr: Vue des tuples
ru: Просмотр дочерних кортежей

source: viewing formulas
fr: voir les formules
ru: просмотр формул

source: Language
fr: Langue
ru: Язык

source: viewing properties
fr: voir les propriétés
ru: просмотр свойств

source: {0} Relationships
fr: {0} Relations
ru: {0} Отношения

source: Pref. Label
ru: Приор. метка

source: Type
ru: Тип

source: References
fr: Références
ru: Ссылки

source: Weight
fr: Poids
ru: Вес

source: Balance
fr: Bilan
ru: Баланс

source: Dimensions
ru: Измерения

source: viewing rendering
fr: voir le rendu
ru: просмотр рендеринга

source: New fact item options
fr: Options Nouvel item de fait
ru: Новые параметры элемента факта

source: Open breakdown entry rows
ru: Открыть детали строк

source: Ignore Dimensional Validity
fr: Ignorer la validation dimensionnelle
ru: Игнорировать контроль измерения

source: X-Axis Children First
fr: X-Axis Fils en premier
ru: Сначала дочерние элементы по оси X

source: Y-Axis Children First
fr: Y-Axis Fils en premier
ru: Сначала дочерние элементы по оси Y

source: Tables
ru: Таблицы

source: Layout model
ru: Модель макета

source: XBRL instance
ru: Отчет XBRL

source: Table
ru: Таблица

source: arelle - Open breakdown entry rows setting
ru: arelle - Открыть настройки деталей строк

source: The number of extra entry rows for open breakdowns is: {0} (When a row header includes an open breakdown, such as for typed dimension(s), this number of extra entry rows are provided below the table.)
ru: Количество дополнительных строк ввода для открытых измерений: {0} (Когда строка включает открытое измерение, например для типизированных измерений, это количество дополнительных строк ввода приводится ниже в таблице.)

source: Enter new typed dimension value
ru: Введите новое значение типизированного измерения

source: Please make sure every Z axis selection is done
ru: Убедитесь, что сделан выбор по каждой из осей Z

source: Some open values are missing in an axis, the save is incomplete
ru: Некоторые открытые значения отсутствуют на оси. Сохранение не завершено

source: creating new instance {0}
fr: création en cours d'une nouvelle instance {0}
ru: создание нового отчета {0}

source: Saving {0}
ru: Сохранение {0}

source: {0} saved
ru: {0} сохранено

source: Saved {0}
fr: {0} enregistré
ru: Сохранено {0}

source: Arcrole Types
ru: Типы Arcrole

source: Role Types
ru: Типы ролей

source: Definition
ru: Определение

source: Cycles Allowed
ru: Разрешены циклы

source: Open Instance Document
fr: Ouvrir un document instance
ru: Открытый отчет XBRL

source: Exception creating context menu in %(title)s: %(error)s
ru: Исключение создания контекстного меню в %(title)s: %(error)s

source: Expand
fr: Déplier
ru: Раскрыть

source: Collapse
fr: Réduire
ru: Свернуть

source: Expand all
ru: Раскрыть все

source: Collapse all
ru: Свернуть все

source: Cell
fr: Cellule
ru: Ячейка

source: Row
fr: Ligne
ru: Строка

source: Exception creating clipboard menu in %(title)s: %(error)s
ru: Исключение создания меню буфера обмена в %(title)s: %(error)s

source: Exception creating context languages menu in %(title)s: %(error)s
ru: Исключение создания контекстного меню языков в %(title)s: %(error)s

source: Label role
ru: Роль метки

source: Exception creating context label roles menu in %(title)s: %(error)s
ru: Исключение создания контекстного меню ролей меток в %(title)s: %(error)s

source: Name Style
fr: Convention de nommage
ru: Название стиля

source: Prefixed
fr: Préfixé
ru: С префиксом

source: No prefix
ru: Нет префикса

source: Exception creating context name style menu in %(title)s: %(error)s
ru: Исключение создания контекстного меню стиля в %(title)s: %(error)s

source: Units
fr: Unités
ru: Ед. измерения

source: Unit ID
fr: ID unité
ru: Код ед. изм.

source: Measures
fr: Mesures
ru: Размеры

source: Exception creating context unit menu in %(title)s: %(error)s
ru: Исключение создания контекстного меню ед. изм. в %(title)s: %(error)s

source: Additional view
fr: Vue complémentaire
ru: Дополнительный вид

source: Arcrole group...
ru: Группа Arcrole...

source: Exception creating context add-views menu in %(title)s: %(error)s
ru: Исключение создания контекстного меню add-views в %(title)s: %(error)s

source: viewing tuples {0}
ru: просмотр кортежей {0}

source: viewing tuples requires selecting the tuple to report
ru: просмотр кортежей требует выбор кортежа для отчета

source: viewing versioning report
fr: voir le rapport de version
ru: просмотр отчета о сравнении версий

source: Versioning Report
fr: Rapport de version
ru: Отчет по версиям

source: namespace renamings
fr: renommage des espaces de nommage
ru: переименование пространства имен

source: role changes
fr: le rôle change
ru: изменение ролей

source: assignments
fr: affectations
ru: назначения

source: actions
ru: действия

source: viewing xml
fr: voir le xml
ru: просмотр xml

source: Validation exception: \s%(error)s
fr: Ensemble de variables : %(xlinkLabel)s Exception : %(error)s
ru: Исключение проверки: \s%(error)s

source: running formulas
fr: évaluation des formules
ru: запуск формул

source: matching text
fr: recherche de texte
ru: сопоставление текста

source: RSS item %(company)s %(form)s document not loaded: %(date)s
ru: RSS элемент %(company)s. %(form)s документ не загружен: %(date)s

source: Fact Variable {0} context {1} matched text: {2}
fr: Variable de fait {0} Contexte {1} texte correspondant : {2}
ru: Переменная факта {0} контекст {1} совпадающий текст: {2}

source: Filing CIK {0} company {1} published {2} form type {3} filing date {4} period {5} year end {6} results: {7}
ru: Отчет CIK {0} компания {1} опубликовано {2} тип формы {3} дата отчета {4} период {5} конец года {6} результаты: {7}

source: sending e-mail alert
fr: envoyer une alerte par e-mail
ru: отправка оповещения по электронной почте

source: Arelle RSS Watch alert on {0}
fr: Arelle alerte sur {0} dans l'observation RSS
ru: Оповещение Arelle RSS мониторинга - {0}

source: RSS item {0}, {1} completed, status {2}
ru: Элемент RSS {0}, {1} завершен, статус {2}

source: RSS item %(company)s, %(form)s, %(date)s, exception: %(error)s
ru: RSS элемент %(company)s, %(form)s, %(date)s, исключение: %(error)s

source: RSS watch, stop requested
ru: RSS просмотр, остановить запрос

source: Unexpected HTML in {0}
ru: Не подходящий HTML в {0}

source: Is this a logon page? If so, click 'yes', else click 'no' if it is the expected XBRL content, or 'cancel' to abort retrieval: {0}
ru: Это страница входа? Если это так, нажмите "да". Нажмите "нет", если это XBRL. Нажмите "отменить", чтобы прервать загрузку: {0}

source: Web file appears to be an html logon request, not retrieved: %(URL)s Contents: %(contents)s
ru: Веб-файл с запросом на вход не загружен: %(url)s Содержание: %(contents)s с

source: %(error)s unsuccessful retrieval of %(URL)s %(retryCount)s retries remaining
ru: %(error)s с неудачная загрузка %(URL)s %(retryCount)s попыток осталось

source: %(error)s retrieving %(URL)s
ru: %(error)s с загрузка %(url)s

source: '%(scheme)s' www-authentication for realm '%(realm)s' is required to access %(URL)s %(error)s
ru: ' %(scheme)s' www-authentication для области ' %(realm)s' требуется для доступа к %(url)s %(error)s с

source: '%(scheme)s' proxy-authentication for realm '%(realm)s' is required to access %(URL)s %(error)s
ru: ' %(scheme)s' прокси-аутентификация для области ' %(realm)s' требуется для доступа к %(url)s %(error)s с

source: HTTP {0} authentication request
ru: HTTP-запрос на аутентификацию {0}

source: Is browser-based possible? If so, click 'yes', or 'cancel' to abort retrieval: {0}
ru: Возможно ли использование браузера? Если это так, нажмите "да". Нажмите "отменить", чтобы прервать загрузку: {0}

source: Web file HTTP 401 (authentication required) response, not retrieved: %(URL)s
ru: HTTP 401 (требуется проверка подлинности). Не загружено: %(url)s

source: %(error)s unsuccessful retrieval of %(URL)s switching to work offline
ru: %(error)s с неудачная загрузка %(url)s переход на работу в офлайн режиме

source: %(error)s unsuccessful retrieval of %(URL)s
ru: %(error)s с неудачная загрузка %(url)s

source: %(error)s Unsuccessful removal of prior file %(filepath)s Please remove with file manager.
ru: %(error)s с Неудачное удаление предыдущего файла %(filepath)s Удалите файл самостоятельно.

source: Downloaded %(URL)s
ru: Загруженно %(url)s

source: %(error)s Unsuccessful renaming of downloaded file to active file %(filepath)s Please remove with file manager.
ru: %(error)s с неудачное переименование загруженного файла в активный файл %(filepath)s Удалите файл самостоятельно.

source: During refresh of web file ignoring error: %(error)s for %(URL)s
ru: Во время обновления веб-файла игнорируется ошибка: %(error)s для %(url)s

source: retrieval incomplete: got only %i out of %i bytes
fr: récupération incomplète : %i / %i ko reçus
ru: загрузка неполная: получено только% i из% i байтов

source: [{0}] exception at {1} in {2}
fr: [{0}] exception à {1} dans {2}
ru: Исключение [{0}] в {1} в {2}

source: Number of arguments do not match signature arity
ru: Количество аргументов не соответствует

source: Exception: Number of arguments mismatch
fr: Exception: Le nombre d'aguments ne correspond pas
ru: Исключение: количество аргументов неверное

source: [{0}]: Arg {1} expected type {2}
ru: [{0}]: Аргумент {1} ожидаемый тип {2}

source: Exception, function implementation not available: {0}
ru: Исключение. Реализация функции недоступна: {0}

source: Formula run time exceeded
ru: Превышено время выполнения формулы

source: Function call not identified: {0}.
ru: Вызов функции не определен: {0}.

source: Argument {0} does not match expected type {1} for {2} {3}.
ru: Аргумент {0} не соответствует ожидаемому типу {1} ​​для {2} {3}.

source: Function named {0} does not have a custom or built-in implementation.
ru: Функция с именем {0} не имеет пользовательской или встроенной реализации.

source: Value operation '{0}' sequence length error
fr: Opération valeur {0}, erreur de longueur de la séquence
ru: Ошибка операции '{0}'. Ошибка длины последовательности

source: Attempt to divide by zero: {0} {1} {2}.
fr: Tentative de division par zéro : {0} {1} {2}.
ru: Деление на ноль: {0} {1} {2}.

source: Node comparison sequence error
fr: Erreur dans la séquence de comparaison des nœuds
ru: Ошибка последовательности сравнения узлов

source: Node operation sequence error
fr: Erreur dans la séquence d'opération des nœuds
ru: Ошибка последовательности операций узла

source: Unary expression sequence length error
fr: Erreur dans la longueur de la séquence unaire
ru: Ошибка длины последовательности выражений

source: Axis step {0} context item is not a node: {1}
fr: Axe {0}, l'élément contexte n'est pas un noeud {1}
ru: Шаг оси {0}. Элемент контекста не является узлом: {1}

source: Atomizing tuple {0} that does not have a typed value
ru: Разбор кортежа {0}, который не имеет типизированного значения

source: Atomizing element {0} that does not have a typed value
ru: Разбор элемента {0}, который не имеет типизированного значения

source: Atomizing {0} to a {1} does not have a proper value
ru: Разбор {0} в {1}. Нет надлежащего значения

source: Atomizing {0} to decimal does not have a proper value
ru: Разбор {0} до десятичного числа не имеет правильного значения
